{
  "name": "Azorius Functionary",
  "proficiency": "Insight, Intimidation",
  "trait": [
    {
      "name": "Description",
      "text": "The brutes are at the gate, chaos is looming, and the only thing standing in the way of disaster is the foundation of law and order—as embodied in the Azorius Senate. You're a proud member of the Azorius guild, which both enacts and enforces the laws that make Ravnican society function smoothly and safely.\n• Skill Proficiencies: Insight, Intimidation\n• Languages: Two of your choice\n• Equipment: An Azorius insignia, a scroll containing the text of a law important to you, a Ink (1-ounce bottle), a ink pen, a set of fine clothes, and a belt pouch containing 10 gp (Azorius-minted 1-zino coins)\nSource: Guildmasters' Guide to Ravnica p. 33"
    },
    {
      "name": "Feature: Legal Authority",
      "text": "You have the authority to enforce the laws of Ravnica, and that status inspires a certain amount of respect and even fear in the populace. People mind their manners in your presence and avoid drawing your attention; they assume you have the right to be wherever you are. Showing your Azorius insignia gets you an audience with anyone you want to talk to (though it might cause more problems than it solves when you're dealing with incorrigible lawbreakers). If you abuse this privilege, though, you can get in serious trouble with your superiors and even be stripped of your position.\n"
    },
    {
      "name": "Azorius Guild Spells",
      "text": "Prerequisite: Spellcasting or Pact Magic class feature\nFor you, the spells on the Azorius Guild Spells table are added to the spell list of your spellcasting class. (If you are a multiclass character with multiple spell lists, these spells are added to all of them.)\nAzorius Guild Spells\nSpell Level | Spells\nCantrip | friends, message\n1st | command, ensnaring strike\n2nd | arcane lock, calm emotions, hold person\n3rd | clairvoyance, counterspell\n4th | compulsion, divination\n5th | dominate person\n\nYour magic often takes the form of blue or golden runes floating and glowing in the air in circular patterns or of shimmering azure barriers of magical energy. If you cast ensnaring strike, for example, the vines created by the spell might appear as rune-inscribed glowing bands that wrap around the target and hold it in place.\n"
    },
    {
      "name": "Suggested Characteristics",
      "text": "Members of the Azorius Senate tend toward a demeanor of cold dignity and a pragmatic, orderly nature. Steeped in the law as they are, their ideals and priorities revolve around legal issues.\nPersonality Traits\nd8 | Trait\n1 | I try never to let my judgment become clouded by emotion.\n2 | I have infinite patience with the dolts and boors I'm forced to deal with every day.\n3 | When I give an order, I expect it to be obeyed.\n4 | I just want things the way I like them: neat, orderly, and clean.\n5 | No wrongdoing can escape my watchful gaze.\n6 | I always say exactly what I mean, no matter how many words it takes to communicate the particular nuance I am attempting to convey.\n7 | I'm very literal and don't appreciate metaphor or sarcasm.\n8 | I never change my mind once it's made up.\n\nIdeals\nd6 | Ideal\n1 | Guild. My guild is all that really matters. (Any)\n2 | Order. The law is meant to ensure that the gears of society turn smoothly and quietly. (Lawful)\n3 | Peace. The ultimate object of the law is to remove violence from society. (Good)\n4 | Compliance. Coercion is a fine way of ensuring that the laws are obeyed. (Lawful)\n5 | Legislation. The law embodies excellence in its precision and detail. (Lawful)\n6 | Punishment. A public display of consequences is an excellent deterrent for other criminals. (Evil)\n\nBonds\nd6 | Bond\n1 | I am beholden to an Azorius arrester who captured the criminal who killed my parents, saving me from the same fate.\n2 | I hope one day to write the laws, not just enforce them.\n3 | I tried and failed to prevent a murder, and I have sworn to find and arrest the perpetrator.\n4 | I successfully prevented a murder, and the would-be perpetrator wants me dead.\n5 | One of my parents was prominent in the guild, and I resent constantly being compared to that standard.\n6 | I've modeled my career after a highly respected lawmage or arrester, but I fear that my role model might be involved in something illegal.\n\nFlaws\nd6 | Flaw\n1 | I'm unable to distinguish between the letter and the spirit of the law.\n2 | I seem like a harsh judge to others, but I judge myself most harshly of all.\n3 | I have a secret, illegal vice.\n4 | I was traumatized by witnessing a crime as a child.\n5 | I'm incapable of deception.\n6 | I wish I had joined the Boros, but I fear they'd never accept me.\n\n"
    },
    {
      "name": "Contacts",
      "text": "The Azorius Senate is a sprawling bureaucracy, and people in a variety of positions throughout the guild can pull strings to make things happen. Because of the guild's role in making and enforcing laws for the entire city, your place in the Azorius can easily bring you into contact with members of other guilds, for good or ill.\nRoll twice on the Azorius Contacts table (for an ally and a rival) and once on the Non-Azorius Contacts table.\nAzorius Contacts\nd8 | Contact\n1 | As a teenager, I was a page for a prominent judge.\n2 | One of my childhood friends is now a precognitive mage in service of the guild.\n3 | I joined the Azorius hoping to impress an arrester whom I admire.\n4 | My former mentor is now a warden at Udzec, the new Azorius prison.\n5 | I was second best at everything in my legal training, and now I work with the person who was always just a little bit better.\n6 | A good friend was promoted into work they can't tell me about.\n7 | I know a homunculus in the halls of New Prahv who can get things done behind the scenes.\n8 | I was once summoned to the presence of Supreme Judge Isperia, the guildmaster of the Azorius, who complimented me on my work.\n\nNon-Azorius Contacts\nd10 | Contact\n1 | Roll an additional Azorius contact; you can decide if the contact is an ally or a rival.\n2 | The person who recruited me into the Azorius left and joined the Boros.\n3 | I have a friendship with a Dimir agent who sometimes funnels me secrets about Azorius activities.\n4 | A Golgari spore druid would love to see me slip up and break the law.\n5 | A lesser Gruul chieftain seems to think I could be useful.\n6 | The black sheep of my family is putting their maniacal genius to use in the Izzet.\n7 | I'm friends with an Orzhov advokist; we compare notes on different forms of law magic.\n8 | I was ridiculed once in a Rakdos performance; the performer was impressed with my good humor about it and now does me occasional favors.\n9 | I have a fanatical Selesnya cousin who keeps trying to recruit me and everyone else in the family.\n10 | While growing up, I was bullied by a brat who's now a hybrid in the Simic Combine.\n\n"
    },
    {
      "name": "How Do I Fit In?",
      "text": "As a member of the Azorius Senate, you are probably engaged in the work of law enforcement (even if your background involved the legislative or judicial aspects of the senate's activities). Legislative aides and judges' clerks find little reason to venture beyond the Azorius guildhalls, but soldiers and lawmages patrol the streets daily.\nAn Azorius soldier or lawmage is a force for order, charged with fighting crime on the streets—and in the halls of power. You might spend your time foiling thefts, putting a stop to Orzhov extortion, rooting out Dimir spies, or hunting down Golgari assassins. Perhaps you take your orders from a precognitive mage (or you are one yourself) who receives unpredictable and cryptic visions of future crimes that you and your allies must try to prevent.\n"
    }
  ]
}