{
  "name": "Boros Legionnaire",
  "proficiency": "Athletics, Intimidation",
  "trait": [
    {
      "name": "Description",
      "text": "As a member of the Boros Legion, your life is devoted to the service of angels and consecrated to the work of establishing justice and peace on the streets of Ravnica. You might be a true believer, inspired by the example of the angels, moved by the plight of the downtrodden, and devoted to the cause of justice. Or you could be a cynic in the ranks, perhaps because you reluctantly followed in the footsteps of a Boros parent, succumbed to the persuasion of a charismatic recruiter's lofty promises, or were drawn in by the prospect of a life of action.\n• Skill Proficiencies: Athletics, Intimidation\n• Tool Proficiencies: One type of gaming set\n• Languages: Choose one of Celestial, Draconic, Goblin, or Minotaur\n• Equipment: A Boros insignia, a feather from an angel's wing, a tattered piece of a Boros banner (a souvenir from a famous battle), a set of common clothes, and a belt pouch containing 2 gp (Boros-minted 1-zino coins)\nSource: Guildmasters' Guide to Ravnica p. 40"
    },
    {
      "name": "Feature: Legion Station",
      "text": "You have an established place in the hierarchy of the Boros Legion. You can requisition simple equipment for temporary use, and you can gain access to any Boros garrison in Ravnica, where you can rest in safety and receive the attention of medics. You are also paid a salary of 1 gp (a Boros-minted 1-zino coin) per week, which (combined with free lodging in your garrison) enables you to maintain a poor lifestyle between adventures.\n"
    },
    {
      "name": "Boros Guild Spells",
      "text": "Prerequisite: Spellcasting or Pact Magic class feature\nFor you, the spells on the Boros Guild Spells table are added to the spell list of your spellcasting class. (If you are a multiclass character with multiple spell lists, these spells are added to all of them.)\nBoros Guild Spells\nSpell Level | Spells\nCantrip | fire bolt, sacred flame\n1st | guiding bolt, heroism\n2nd | aid, scorching ray\n3rd | beacon of hope, blinding smite\n4th | death ward, wall of fire\n5th | flame strike\n\nYour magic often features dramatic bursts of flame or radiance. When you cast beneficial spells on your allies, they appear momentarily surrounded with halos of bright fire.\n"
    },
    {
      "name": "Suggested Characteristics",
      "text": "The Boros Legion is a zealous army, full of righteous energy tempered with military discipline. Its members share its leadership's devotion to the ideals of justice, or they find satisfaction in the more warfare-oriented aspects of the legion's work.\nPersonality Traits\nd8 | Personality Trait\n1 | I approach every task with the same high degree of military precision.\n2 | I am always the first into the fray.\n3 | I bear any injury or indignity with stoic discipline.\n4 | My righteous wrath is easily inflamed by the slightest iniquity.\n5 | My honor is more important to me than my life.\n6 | Dangerous work is best accomplished by an orderly group working with common purpose.\n7 | I treat my weapons, uniform, and insignia with reverence, for they are gifts of the angels.\n8 | I pace when standing and fidget incessantly when forced to sit.\n\nIdeals\nd6 | Ideal\n1 | Guild. My guild is all that really matters. (Any)\n2 | Justice. Achieving justice requires establishing fair, equitable, and compassionate relationships within a community. (Good)\n3 | Protection. It isn't right for innocents to suffer because of the arrogance of the powerful. (Good)\n4 | Solidarity. It is most crucial to act with a single will, marching side by side in perfect accord. (Lawful)\n5 | Order. Society functions only if people do their duty and respect the chain of command. (Lawful)\n6 | Conviction. Anything worth doing is worth doing with your whole heart. (Lawful)\n\nBonds\nd6 | Bond\n1 | I would lay down my life for Aurelia and the angels.\n2 | I owe my life to the Boros captain who took me in when I was living on the streets.\n3 | My fellow legionnaires are my family.\n4 | I wield the same Boros weapon my grandparent did, for the honor of our family.\n5 | I ran with the Rakdos in my youth, and I'm striving to atone for my past misdeeds.\n6 | I do what I can to help out the spouse of a comrade who died in battle.\n\nFlaws\nd6 | Flaw\n1 | I act bravely when I'm in a group, but I'm a coward when I'm alone.\n2 | I see everything in clear-cut black and white.\n3 | I'm just a little fascinated by the ways of the Gruul.\n4 | I trust the chain of command more than anything—more even than my closest friends.\n5 | I'm slow to trust members of other guilds.\n6 | I've been known to turn a blind eye to injustice, with the help of a modest bribe.\n\n"
    },
    {
      "name": "Contacts",
      "text": "The ordered structure of the Boros Legion offers abundant opportunities to make friends—and rivals—in higher places. You might have close friends in other guilds that share the Boros emphasis on order and community, or bitter enemies among the guilds that represent chaos and destruction.\nRoll twice on the Boros Contacts table (for an ally and a rival) and once on the Non-Boros Contacts table.\nBoros Contacts\nd8 | Contact\n1 | A former comrade in arms was promoted into the prestigious Sunhome Guard.\n2 | One of my parents is a ranking Boros officer.\n3 | A close friend serves aboard the Parhelion II, a flying fortress.\n4 | I had a tangled affair with a Boros garrison captain.\n5 | I have maintained a relationship with one of my instructors at Horizon Military Academy.\n6 | I competed with a fellow student for the attention of a mentor at Horizon Military Academy.\n7 | The person who recruited me into the legion changed the course of my life.\n8 | A Boros angel knows my name.\n\nNon-Boros Contacts\nd10 | Contact\n1 | One of my siblings is an Azorius arrester.\n2 | Roll an additional Boros contact; you can decide if the contact is an ally or a rival.\n3 | I showed mercy to an injured, now-grateful Dimir spy.\n4 | I suspect someone I know is a Golgari assassin, but I can't prove it.\n5 | An adolescent relative ran off to join the Gruul in an act of rebellion and has not yet returned.\n6 | I once befriended an Izzet scientist, and we're still cordial though the relationship ended messily.\n7 | I owe a monetary debt to an Orzhov syndic.\n8 | A Rakdos blood witch seems to enjoy harassing me.\n9 | I tried to recruit a friend who ended up joining the Selesnya.\n10 | I keep running into a particular Simic biomancer, and I enjoy the arguments that inevitably result.\n\n"
    },
    {
      "name": "How Do I Fit In?",
      "text": "As a member of the Boros Legion, you are subject to the orders of your superior officers. You go where the angels tell you to go, and you do what they command you to do, to the best of your ability. If you enjoy some measure of independence, it's either because you have proven yourself capable of working without close supervision or because you're a rebellious sort who is willing to disobey orders now and face the consequences later.\nAs a soldier on the street, you are tasked with bringing dangerous threats like the Rakdos and the Gruul in line. You might contend with Rakdos performances gone horribly out of control, Gruul raids on outlying neighborhoods, shipments of rot-infested vegetation from the Golgari undercity, and violent uprisings among the guildless. At the same time, you might have to worry about Dimir spies infiltrating your leadership, overzealous or corrupt Azorius senators abusing the law at the expense of justice, Izzet experiments leveling city blocks, and Simic creations that break out of laboratories and wreak havoc through the Tenth District.\n"
    }
  ]
}