{
  "name": "Gruul Anarch",
  "proficiency": "Animal Handling, Athletics",
  "trait": [
    {
      "name": "Description",
      "text": "The entire world of Ravnica is a sprawling metropolis, but you are a native of the wild areas that still exist—the abandoned districts, the rubblebelts, the overgrown parks, and the crumbling ruins. You are part of a savage society that clings desperately to the Old Ways—attuned to nature, full of primal rage, and given short shrift by a world consumed with continuing civilization's march of progress.\n• Skill Proficiencies: Animal Handling, Athletics\n• Tool Proficiencies: Herbalism kit\n• Languages: Choose one of Draconic, Giant, Goblin, or Sylvan\n• Equipment: A Gruul insignia, a hunting trap, an herbalism kit, the skull of a boar, a beast-hide cloak, a set of traveler's clothes, and a belt pouch containing 10 gp (Azorius 1-zino coins)\nSource: Guildmasters' Guide to Ravnica p. 60"
    },
    {
      "name": "Feature: Rubblebelt Refuge",
      "text": "You are intimately familiar with areas of the city that most people shun: ruined neighborhoods where wurms rampaged, overgrown parks that no hand has tended in decades, and the vast, sprawling rubblebelts of broken terrain that civilized folk have long abandoned. You can find a suitable place for you and your allies to hide or rest in these areas. In addition, you can find food and fresh water in these areas for yourself and up to five other people each day.\n"
    },
    {
      "name": "Gruul Guild Spells",
      "text": "Prerequisite: Spellcasting or Pact Magic class feature\nFor you, the spells on the Gruul Guild Spells table are added to the spell list of your spellcasting class. (If you are a multiclass character with multiple spell lists, these spells are added to all of them.)\nGruul Guild Spells\nSpell Level | Spells\nCantrip | fire bolt, produce flame\n1st | compelled duel, speak with animals, thunderwave\n2nd | beast sense, shatter\n3rd | conjure animals, conjure barrage\n4th | dominate beast, stoneskin\n5th | destructive wave\n\nFueled by the fire of rage burning in your heart, your magic is almost always accompanied by fiery effects, such as flames smoldering behind your eyes or dancing over your hands.\n"
    },
    {
      "name": "Suggested Characteristics",
      "text": "Gruul ways aren't the ways of civilized folk, and the Gruul have little patience for social niceties. But they do have cherished traditions and values, just as important to them as the different values held by the urban, cosmopolitan culture of Ravnica.\nPersonality Traits\nd8 | Personality Trait\n1 | Unlike people, the beasts of the wild are friends who won't stab me in the back.\n2 | Go ahead and insult me—I dare you.\n3 | I scorn those who can't survive away from the comforts of the city.\n4 | Don't tell me I'm not allowed to do something.\n5 | Laws are for people who are afraid to face their inner beasts.\n6 | I smear the blood of my enemies over my skin.\n7 | I was, in fact, raised by maaka.\n8 | HarrRRAAGGHH! [I rarely form a coherent sentence and prefer to express myself by breaking things.]\n\nIdeals\nd6 | Ideal\n1 | Clan. My clan is all that really matters. (Any)\n2 | Anarchy. No person or law or custom can tell another what to do. (Chaotic)\n3 | Nature. We weren't born tame or domesticated, so we shouldn't have to live that way. (Neutral)\n4 | Might. The strongest are meant to dominate the weak. (Evil)\n5 | Rage. AAAAAARRRRggggh! [To live is to feel and express the rage burning in your belly.] (Chaotic)\n6 | Tradition. The Old Ways must be preserved and upheld. (Any)\n\nBonds\nd6 | Bond\n1 | I am determined that one day I will lead my clan—or a new one.\n2 | I would give my life for my clan chieftain.\n3 | The chieftain of another clan has a grudge against me.\n4 | I am devoted to a sacred site in the midst of the rubblebelt.\n5 | My weapon is made from the first raktusk I ever hunted.\n6 | GrrrRRAAAAGGHH! [I will do anything to prove myself greater than my siblings or ancestors.]\n\nFlaws\nd6 | Flaw\n1 | If you question my courage, I will never back down.\n2 | HrrrGGGAAAARRuuuh! [My anger in battle led to the death of a loved one.]\n3 | I'm as stubborn as a batterboar.\n4 | I'm so convinced of my superiority over soft, civilized people that I'll take great risks to prove it.\n5 | I'm easily manipulated by people I find attractive.\n6 | I'm not actually all that angry.\n\n"
    },
    {
      "name": "Contacts",
      "text": "The members of the Gruul Clans rely on each other even as they vie for territory and glory. Their encounters with members of other guilds are more often violent than friendly, but occasional bonds do form.\nRoll twice on the Gruul Contacts table (for an ally and a rival) and once on the Non-Gruul Contacts table.\nGruul Contacts\nd8 | Contact\n1 | One of my parents is a renowned warrior in my clan.\n2 | My sibling has the ear of the clan chief.\n3 | I have cousins in a different clan.\n4 | When we were younger, I was romantically involved with a prominent warrior in my clan.\n5 | A druid in my clan believes I have a destiny to fulfill.\n6 | The warrior who trained me remembers me for my exceptional potential.\n7 | My clan chief killed one of my parents, who had challenged the chief for leadership of the clan. Some combination of resentment and remorse stirs the clan chief to help me sometimes.\n8 | I made a strong impression on Borborygmos.\n\nNon-Gruul Contacts\nd10 | Contact\n1 | An Azorius arrester thinks I can be reformed.\n2 | A Boros soldier gives me gifts in exchange for information about other clans' movements.\n3 | I once caught and released a Dimir spy.\n4 | I consult with a Golgari shaman for spiritual guidance at times.\n5 | Roll an additional Gruul contact; you can decide if the contact is an ally or a rival.\n6 | An Izzet scientist blames the Gruul for the destruction of his life's work in a raid, but seems to think that I'm not like other Gruul.\n7 | I foolishly borrowed money from an Orzhov syndic to indulge a shameful vice.\n8 | A close friend left our clan and joined the Cult of Rakdos.\n9 | A distant relative is trying to recruit me into the Selesnya Conclave.\n10 | I stopped a Simic biomancer from trapping wild beasts to perform vile experiments on them.\n\n"
    },
    {
      "name": "How Do I Fit In?",
      "text": "In service of a simple goal, you have a simple part to play: Fight. Unleash your rage. Flatten buildings and defeat those who stand in your way. Be Gruul, in your own way.\nYou will frequently be summoned to participate in a raid your clan is launching against the city or against a group of its defenders. Your clan leader might also send you on a special mission, though it would almost certainly still qualify as a raid. You might join a small group of Gruul warriors on a dangerous charge deep into the settled streets to plunder a certain location, retrieve an item stolen from your clan, or assault a Boros garrison.\nSometimes your objective might be more esoteric. With prophecies of the return of Ilharg the Raze-Boar spreading like wildfire among the Gruul druids, you might be asked to carry out some task that the druids believe will speed his coming. Such a task might involve collecting a sacred relic held in an Orzhov vault or collecting sacrifices for a grand ceremony in the Raze-Boar's honor.\n"
    }
  ]
}