{
  "name": "Hillsfar Merchant",
  "proficiency": "Insight, Persuasion",
  "trait": [
    {
      "name": "Description",
      "text": "Before becoming an adventurer, you were a successful merchant operating out Hillsfar, the City of Trade. Your family operated warehouses, organized caravans, managed stores, or owned a ship and has trade contacts throughout the Moonsea region, as well as up and down the length of the Sword Coast. Perhaps they import ore, uncut gems, untreated furs, or grain into the City of Trade, or they export fine cloth, faceted gems, fine furs, or Dragon's Breath, a brandy-like liquor. Regardless, you've largely given that life up for some reason and have chosen to seek adventure instead. Nevertheless, the training you received then, and perhaps the contacts you made, serve you well as an adventurer.\n• Skill Proficiencies: Insight, Persuasion\n• Tool Proficiencies: Vehicles (land) and vehicles (water)\n• Equipment: A set of fine clothes, a signet ring, a letter of introduction from your family's trading house, and a purse containing 25 gp\nSource: Adventurers League: Rage Of Demons p. 7"
    },
    {
      "name": "Lifestyle",
      "text": "Wealthy\n"
    },
    {
      "name": "Overview",
      "text": "Before becoming an adventurer, you were a successful merchant operating out Hillsfar, the City of Trade. Your family operated warehouses, organized caravans, managed stores, or owned a ship and has trade contacts throughout the Moonsea region, as well as up and down the length of the Sword Coast. Perhaps they import ore, uncut gems, untreated furs, or grain into the City of Trade, or they export fine cloth, faceted gems, fine furs, or Dragon's Breath, a brandy-like liquor. Regardless, you've largely given that life up for some reason and have chosen to seek adventure instead. Nevertheless, the training you received then, and perhaps the contacts you made, serve you well as an adventurer.\nChoose one of the following features:\n"
    },
    {
      "name": "Feature: Factor",
      "text": "Although you've left the day-to-day life of a merchant behind, your family has assigned you the services of a loyal retainer from the business, a factor, husbanding agent, seafarer, caravan guard, or clerk. This individual is a commoner who can perform mundane tasks for you such as making purchases, delivering messages, and running errands. He or she will not fight for you and will not follow you into obviously dangerous areas (such as dungeons), and will leave if frequently endangered or abused. If he or she is killed, the family assigns you another within a few days. Note: This feature is a variant of the Noble Knight's Retainers feature.\n"
    },
    {
      "name": "Alternate Feature: Trade Contact",
      "text": "You and your family have trade contacts such as caravan masters, shopkeepers, sailors, artisans, and farmers throughout the Moonsea region and all along the Sword Coast. Once per game session, when adventuring in either of those areas, you can use those contacts to get information about the local area or to pass a message to someone in those areas, even across the great distance between the two areas. Note: This feature is a variant of the Criminal Contact and Researcher features.\n"
    },
    {
      "name": "Suggested Characteristics",
      "text": "d8 | Personality Trait\n1 | I fill my evenings with wine or mead and song.\n2 | I greatly admire gladiators and enjoy the Arena.\n3 | I take my wealth for granted. It seldom occurs to me that others aren't rich themselves.\n4 | I leave broken hearts all around the Moonsea and up and down the Sword Coast.\n5 | I work hard and seldom make time for fun.\n6 | I am a particularly devout and pray often.\n7 | The Red Plumes caught me once. I hate them.\n8 | I ask a lot of questions to get information about those with whom I am working and dealing.\n\nd6 | Ideal\n1 | Frugal. I spend my money very carefully. (Lawful)\n2 | Profligate. I tend to spend extravagantly. (Chaotic)\n3 | Honest. I deal with others above board. (Any)\n4 | Sharp. I seek to make the best deal possible. (Any)\n5 | Charitable. I give generously to others. (Good)\n6 | Greedy. I do not share my wealth with others. (Evil)\n\nd6 | Bond\n1 | I am fiercely loyal to those with whom I work.\n2 | I must uphold the good name of my family.\n3 | I will prove myself to my family as an adventurer.\n4 | Deals are sacrosanct. I never go back on my word.\n5 | I love making deals and negotiating agreements.\n6 | I guard my wealth jealously.\n\nd6 | Flaw\n1 | I am a braggart. I promote myself shamelessly.\n2 | I am vain. I always wear the latest fashions.\n3 | I am a glutton. I eat and drink to excess.\n4 | I am a snob. I want only the finest things in life.\n5 | I am lazy. I want others to take care of everything.\n6 | I am overconfident. I overestimate my abilities.\n\n"
    }
  ]
}