{
  "name": "Rakdos Cultist",
  "proficiency": "Acrobatics, Performance",
  "trait": [
    {
      "name": "Description",
      "text": "You're an entertainer at heart, a performer with a flair for the dramatic and a love of the spotlight. You've spent years honing your craft, mastering a demanding set of skills so you can perform them with panache and make them look easy. The wild applause, the screams of the crowds, the mayhem and terror spreading into the streets—this is what you live for.\nYou're also a member of a cult devoted to an ancient demon who delights in violence and chaos. It just so happens that Rakdos loves a good show, and your highest aspiration is to please the Defiler, the Lord of Riots, with your own performance.\n• Skill Proficiencies: Acrobatics, Performance\n• Tool Proficiencies: One type of musical instrument\n• Languages: Choose either Abyssal or Giant\n• Equipment: A Rakdos insignia, a musical instrument (one of your choice), a costume clothes, a hooded lantern made of wrought iron, a 10-foot length of chain with sharply spiked links, a tinderbox, 10 torch, a set of common clothes, a belt pouch containing 10 gp (a mix of Azorius and Boros 1-zino coins), and a bottle of sweet, red juice\nSource: Guildmasters' Guide to Ravnica p. 79"
    },
    {
      "name": "A Flair for the Dramatic",
      "text": "Rakdos performance styles typically fuse standard circus-style acrobatics with fire, wrought-iron spikes and hooks, and monsters. You can roll a d8 or choose from the options in the Performance Options table to determine your preferred style of performance.\nPerformance Options\nd8 | Type of Performer\n1 | Spikewheel acrobat\n2 | Lampooning satirist\n3 | Fire juggler\n4 | Marionette puppeteer\n5 | Pain artist\n6 | Noise musician\n7 | Nightmare clown\n8 | Master of ceremonies\n\n"
    },
    {
      "name": "Feature: Fearsome Reputation",
      "text": "People recognize you as a member of the Cult of Rakdos, and they're careful not to draw your anger or ridicule. You can get away with minor criminal offenses, such as refusing to pay for food at a restaurant or breaking down a door at a local shop, if no legal authorities witness the crime. Most people are too daunted by you to report your wrongdoing to the Azorius.\n"
    },
    {
      "name": "Rakdos Guild Spells",
      "text": "Prerequisite: Spellcasting or Pact Magic class feature\nFor you, the spells on the Rakdos Guild Spells table are added to the spell list of your spellcasting class. (If you are a multiclass character with multiple spell lists, these spells are added to all of them.)\nRakdos Guild Spells\nSpell Level | Spells\nCantrip | fire bolt, vicious mockery\n1st | burning hands, dissonant whispers, hellish rebuke\n2nd | crown of madness, enthrall, flaming sphere\n3rd | fear, haste\n4th | confusion, wall of fire\n5th | dominate person\n\nYour magic often produces a flashy spectacle, wreathing you or your targets in a mixture of harmless flame and shadowy shapes. When you manipulate an opponent's mind, a flaming symbol of Rakdos might momentarily appear like a mask over the target's face.\n"
    },
    {
      "name": "Suggested Characteristics",
      "text": "Members of demonic cults aren't generally known as the kindest or most mentally stable individuals, so you're likely to have something in your nature that distinguishes you from the law-abiding citizens of Ravnica.\nPersonality Traits\nd8 | Personality Trait\n1 | I revel in mayhem, the more destructive the better.\n2 | When violence breaks out, I lose myself in rage, and it's sometimes hard to stop.\n3 | Everything is funny to me, and the most hilarious and bloodiest things leave me cackling with sadistic glee.\n4 | I derive genuine pleasure from the pain of others.\n5 | I enjoy testing other people's patience.\n6 | I can't stand it when things are predictable, so I like to add a little chaos to every situation.\n7 | I throw my weight around to make sure I get my way.\n8 | I enjoy breaking delicate works of art. And fingers, which are sort of the same.\n\nIdeals\nd6 | Ideal\n1 | Guild. My guild is all that really matters. (Any)\n2 | Hedonism. Death comes for everyone, so take as much pleasure as you can from every moment of life. (Neutral)\n3 | Creativity. I strive to find more ways to express my art through pain—my own as well as others'. (Chaotic)\n4 | Freedom. No one tells me what to do. (Chaotic)\n5 | Equality. I want to see Ravnica remade, with no guilds and no hierarchies. (Chaotic)\n6 | Spectacle. People are inspired by the greatness they see in art. (Any)\n\nBonds\nd6 | Bond\n1 | I have belonged to the same performance troupe for years, and these people mean everything to me.\n2 | A blood witch told me I have a special destiny to fulfill, and I'm trying to figure out what it is.\n3 | I'm secretly hoping that I can change the cult from the inside, using my influence to help rein in the wanton violence.\n4 | I own something that Rakdos once touched (it's seared black at the spot), and I cherish it.\n5 | I want to be better at my chosen form of performance than any other member of my troupe.\n6 | I am devoted to Rakdos and live to impress him.\n\nFlaws\nd6 | Flaw\n1 | My family is prominent in another guild. I enjoy my wild life, but I don't want to embarrass them.\n2 | I couldn't hide my emotions and opinions even if I wanted to.\n3 | I throw caution to the wind.\n4 | I resent the rich and powerful.\n5 | When I'm angry, I lash out in violence.\n6 | There's no such thing as too much pleasure.\n\n"
    },
    {
      "name": "Contacts",
      "text": "The Cult of Rakdos is anything but organized. Individuals frequently move from one performance troupe to another. Almost all members of the cult know former castmates now in different troupes, which allows for the possibility of a widespread network of contacts.\nRoll twice on the Rakdos Contacts table (for an ally and a rival) and once on the Non-Rakdos Contacts table.\nRakdos Contacts\nd8 | Contact\n1 | I was part of a two-person act until my former partner moved to a different troupe.\n2 | My sibling and I ran away from home and joined the Cult of Rakdos together. We're very close.\n3 | A childhood friend of mine is an attendant in Rix Maadi, the Rakdos guildhall.\n4 | My parents brought me into the guild and taught me my trade.\n5 | There's a lesser demon in the cult who thinks he owes me a favor, and who am I to argue?\n6 | The master of ceremonies in my troupe is well connected with other troupes.\n7 | I had a romance with a pain artist in another troupe.\n8 | Rakdos himself has witnessed me perform.\n\nNon-Rakdos Contacts\nd10 | Contact\n1 | I know an Azorius elocutor who has a very amusing dark side.\n2 | A Boros captain really wants to \"redeem\" me.\n3 | I think a member of my troupe is a Dimir agent.\n4 | I once convinced a Golgari medusa to participate in a show. We've been on good terms ever since.\n5 | I came from the Gruul and still have relatives there.\n6 | An Izzet technician provides pyrotechnics for my performances.\n7 | An Orzhov oligarch has taken an interest in my career, like a patron of the arts.\n8 | Roll an additional Rakdos contact; you can decide if the contact is an ally or a rival.\n9 | A Selesnya healer attends my performances regularly.\n10 | A Simic biomancer provides mutant monsters to add a taste of the bizarre to our shows.\n\n"
    },
    {
      "name": "How Do I Fit In?",
      "text": "The Cult of Rakdos encourages independent action on the part of its members. Its goal is fomenting chaos, and it firmly believes in putting its own house in disorder before carrying that mission into the larger city. So your role is to execute your vision of grand satire and disruptive performance art, as you aspire to outdo your guild mates and attract the attention of Rakdos himself.\nYou work as part of a troupe, with your artistic talents used in service to a ringmaster's vision. But your performance is your own, and no one expects you to follow a script. In fact, if you go through a performance without doing something you haven't done before, you're clearly not trying hard enough.\n"
    }
  ]
}