{
  "name": "Rival Intern",
  "proficiency": "History, Investigation",
  "trait": [
    {
      "name": "Description",
      "text": "You were an intern at a rival of Acquisitions Incorporated, and you gained a healthy respect for not just the job and the franchising opportunities, but for the ruthless and efficient way Acquisitions Incorporated goes about its business. Why deal with the rest, when you can work for the best?\nPerhaps the rival did not treat you as well as you were hoping, or you washed out of that organization. Maybe you hope to leverage the knowledge you gained there for an advantage at Acquisitions Incorporated. Either way, you're now bringing your talents to the company, ready to put your skills to use.\n• Skill Proficiencies: History, Investigation\n• Tool Proficiencies: One type of artisan's tools\n• Languages: Any one of your choice\n• Equipment: One set of artisan's tools, a ledger from your previous employer containing a small piece of useful information, a set of fine clothes, and a belt pouch containing 10 gp\nSource: Acquisitions Incorporated p. 51"
    },
    {
      "name": "Feature: Inside Informant",
      "text": "You have connections to your previous employer or other groups you dealt with during your previous employment. You can communicate with your contacts, gaining information at the DM's discretion.\n"
    },
    {
      "name": "Suggested Characteristics",
      "text": "If you were happy with your previous internship, the parting of ways might have been amicable. If not, it might have involved armed guards removing you from the premises. If you were passed over at your previous position, it might have left you a blend of seething rage, practiced nonchalance, and keen knowledge of where the bodies are buried (perhaps literally).\nd8 | Personality Trait\n1 | My previous employer didn't respect me, and now I'll do whatever I can to gain respect.\n2 | The job is important, but the relationships I forge with my coworkers are even more so.\n3 | The job is everything to me. Who needs relaxation, hobbies, and a social life?\n4 | I know I'm not the best and brightest, but if I put my best self forward, I can overcome anything.\n5 | My former boss was an idiot. So was my boss before that. And before that. I'm sure those were all coincidences.\n6 | This company is so much better than my previous one. It will always be the best until they stop paying me.\n7 | I know this dagger belongs to the company, but I'm sure they won't miss it. Or this flask. Or this armor.\n8 | It's only a matter of time before I'll be upper management. I just have to kiss up to my superiors and kick down those beneath me.\n\nd6 | Ideal\n1 | Advancement. Money and power can be gained more easily within an organization. I plan to gain as much as possible. (Evil)\n2 | Structure. Life goes much more smoothly when you follow the rules and work within a system. (Lawful)\n3 | Uncertainty. The more chaos that swirls around me, the more opportunities I can find to profit. (Chaotic)\n4 | Justice. I can't stand people being treated unjustly. I do whatever it takes to stop injustice and those who flout the law. (Lawful)\n5 | Pleasure. What's the use of working hard and making money if you can't enjoy the finer things in life? (Any)\n6 | Power. Money is fine, but real power means never having to say you're sorry. (Evil)\n\nd6 | Bond\n1 | I have a family member in need. I consider them in everything I do.\n2 | My peers keep me grounded.\n3 | My past mistakes cost someone else dearly. I have to rectify that.\n4 | A childhood mentor put me on my current path. If I succeed, I want to repay that mentor in some way.\n5 | I value an oath of loyalty I took to a group of friends over everything else in my life.\n6 | Although I don't get along well with people, my pet means the world to me.\n\nd6 | Flaw\n1 | I know what's best. Trust me.\n2 | Flaw? I have no flaws. I'm perfect.\n3 | My loyalties are... fluid.\n4 | If anything goes wrong, it must be someone else's fault. Let me explain that in detail.\n5 | There's right and there's wrong, and there's no gray area in between.\n6 | Our superiors might not like what you're doing. I'm going to have to put that in my report.\n\n"
    }
  ]
}