{
  "name": "Simic Scientist",
  "proficiency": "Arcana, Medicine",
  "trait": [
    {
      "name": "Description",
      "text": "Imagine a perfect world: one in which nature and civilization exist in harmony, adapted to each other; one in which life is shaped to match its environment and the environment is shaped to match life. That's the world you have been trying to grow in the laboratories of the Simic Combine. Nature is all about adaptation, evolution, and balance—but for it to keep up with the pace of advancing civilization, nature needs some help from biomancers and terraformers. If, along the way, you happen to create super-soldiers and mutant monsters that can bolster the combine's defenses against the schemes and ambitions of the other guilds, so much the better.\n• Skill Proficiencies: Arcana, Medicine\n• Languages: Two of your choice\n• Equipment: A Simic insignia, a set of common clothes, a book of research notes, an ink pen, a Ink (1-ounce bottle), a oil (flask) (made from blubber), a acid (vial) (derived from digestive juices), a vial of fish scales, a vial of seaweed, a vial of jellyfish stingers, a glass bottle of unidentified slime, and a belt pouch containing 10 gp (Azorius 1-zino coins)\nSource: Guildmasters' Guide to Ravnica p. 93"
    },
    {
      "name": "Clades and Projects",
      "text": "As a Simic researcher, you are part of a clade—a diverse group of individuals combining disparate talents in pursuit of a common goal—or a researcher on a specialized, short-term project focused on addressing an immediate need. You can roll a d6 or choose from the options in the Research Options table to determine your area of research.\nResearch Options\nd6 | Clade/Project\n1 | Hull Clade, focused on protection and durability\n2 | Fin Clade, focused on movement\n3 | Gyre Clade, focused on cyclical patterns and metamagic\n4 | Guardian Project, focused on creating guard monsters and super soldiers\n5 | Crypsis Project, focused on intelligence and counterintelligence\n6 | Independent research in a new area\n\n"
    },
    {
      "name": "Feature: Researcher",
      "text": "When you attempt to learn or recall a magical or scientific fact, if you don't know that information, you know where and from whom you can obtain it. Usually, this information comes from a Simic laboratory, or sometimes from an Izzet facility, a library, a university, or an independent scholar or other learned person or creature. Knowing where the information can be found doesn't automatically enable you to learn it; you might need to offer bribes, favors, or other incentives to induce people to reveal their secrets.\nYour DM might rule that the knowledge you seek is secreted away in an inaccessible place, or that it simply can't be found. Unearthing the deepest secrets of the multiverse can require an adventure or even a whole campaign.\n"
    },
    {
      "name": "Simic Guild Spells",
      "text": "Prerequisite: Spellcasting or Pact Magic class feature\nFor you, the spells on the Simic Guild Spells table are added to the spell list of your spellcasting class. (If you are a multiclass character with multiple spell lists, these spells are added to all of them.)\nSimic Guild Spells\nSpell Level | Spells\nCantrip | acid splash, druidcraft\n1st | detect poison and disease, expeditious retreat, jump\n2nd | alter self, enhance ability, enlarge/reduce\n3rd | gaseous form, water breathing, wind wall\n4th | freedom of movement, polymorph\n5th | creation\n\nWhen your magic causes physical alterations in yourself or others, the result often displays the characteristics of fish, amphibians, or other water-dwelling creatures. Blue-green eddies of magical energy sometimes accompany your spellcasting, forming spirals that reflect the mathematical perfection of nature.\n"
    },
    {
      "name": "Suggested Characteristics",
      "text": "The bizarre science of the Simic Combine attracts a certain type of personality and encompasses a set of beliefs about the nature of life. Simic members' bonds and flaws derive from their scientific research—including their creation of new life forms, which they can become very attached to.\nPersonality Traits\nd8 | Personality Trait\n1 | I can't wait to see what I become next!\n2 | I am convinced that everything inclines toward constant improvement.\n3 | I'm eager to explain every detail of my most intricate experiments and theories to anyone who shows the least bit of interest.\n4 | I assume that everyone needs even the most basic concepts explained to them.\n5 | I describe everything that happens as if it were going into my research notes (and it often is).\n6 | I am insatiably curious about the seemingly infinite forms and adaptations of life.\n7 | I can't resist prying into anything forbidden, since it must be terribly interesting.\n8 | I employ a highly technical vocabulary to avoid imprecision and ambiguity in my communication.\n\nIdeals\nd6 | Ideal\n1 | Guild. My guild is all that really matters. (Any)\n2 | Change. All life is meant to progress toward perfection, and our work is to hurry it along—no matter what must be upended along the way. (Chaotic)\n3 | Knowledge. Understanding the world is more important than what you do with your knowledge. (Neutral)\n4 | Greater Good. I want to reshape the world into higher forms of life so that all can enjoy evolution. (Good)\n5 | Logic. It's foolish to let emotions and principles interfere with the conclusions of logic. (Lawful)\n6 | Superiority. My vast intellect and strength are directed toward increasing my sway over others. (Evil)\n\nBonds\nd6 | Bond\n1 | I helped create a krasis that I love like a pet and would carry with me everywhere... except it's the size of a building, and it might eat me.\n2 | In my laboratory, I discovered something that I think could eliminate half the life on Ravnica.\n3 | The other researchers in my clade are my family—a big, eccentric family including members and parts of many species.\n4 | The laboratory where I did my research contains everything that is precious to me.\n5 | I will get revenge on the shortsighted fool who killed my precious krasis creation.\n6 | Everything I do is an attempt to impress someone I love.\n\nFlaws\nd6 | Flaw\n1 | I have a rather embarrassing mutation that I do everything I can to keep hidden.\n2 | I'm more interested in taking notes on monstrous anatomy than in fighting monsters.\n3 | Every social situation I'm in seems to lead to my asking rude personal questions.\n4 | I'm supremely confident in my ability to adapt to any situation and handle any danger.\n5 | I'll take any risk to earn recognition for my scientific brilliance.\n6 | I have a tendency to take shortcuts in my research and any other tasks I have to complete.\n\n"
    },
    {
      "name": "Contacts",
      "text": "The fluid nature of clades, whose rosters span different laboratories and change as researchers discover new interests, creates abundant connections among the Simic. The guild members live in watery sinkholes called zonots, and their isolation shelters them from much contact with outsiders. Nonetheless, a fair number of Simic members are former members of other guilds.\nRoll twice on the Simic Contacts table (for an ally and a rival) and once on the Non-Simic Contacts table.\nSimic Contacts\nd8 | Contact\n1 | My research builds on my parents' work and takes it in interesting new directions.\n2 | If a serious problem confounds me, I can count on my mentor to provide clarity of thought.\n3 | A former laboratory colleague went on to work on the Guardian Project.\n4 | A former colleague has ventured into fields of research that are possibly immoral and almost certainly illegal.\n5 | A former lover is now the supervisor of a prominent clade.\n6 | My sibling has become an almost unrecognizable mutant.\n7 | An old friend has retreated into a secluded life as an ascetic deepsage, devoted to contemplating philosophical principles.\n8 | My former clade supervisor is now engaged in field research studying some of the largest beasts and monsters on Ravnica.\n\nNon-Simic Contacts\nd10 | Contact\n1 | My older sibling is upset that I didn't follow them into the Azorius.\n2 | A Boros sergeant is always asking questions about my work, but I suspect they're genuinely curious.\n3 | A friend in my clade thinks I don't know they're a Dimir agent.\n4 | I helped a Golgari spore druid with the fertilization and growth of their fungus field.\n5 | I can't fathom what could have made my childhood friend run off and join the Gruul.\n6 | I love comparing notes with my friend in the Izzet, though our fields of research are very different.\n7 | I borrowed a lot of money from an Orzhov syndic to help finance my research.\n8 | A Rakdos ringmaster has taken an interest in my research which, come to think of it, might make a nice sideshow act.\n9 | I left the Selesnya—and a lover—behind when I joined the Simic.\n10 | Roll an additional Simic contact; you can decide if the contact is an ally or a rival.\n\n"
    },
    {
      "name": "How Do I Fit In?",
      "text": "As a Simic adventurer, your mission likely aligns with the Adaptationist philosophy; the disagreements and tensions among the guilds will soon erupt into open conflict, and your guild needs your help to ensure that the Simic survive. That help might come in the form of defending against Golgari incursions into Simic zonots or shielding Simic research from Azorius intrusion. It could also involve more subtle, diplomatic work to maintain balance among the guilds, or subterfuge aimed at undermining another guild's grab for power.\nSelf-improvement is also an important part of your mission. Anything you can do to make yourself more capable—whether learning a new spell or adopting a new hybridizing mutation—gives the Simic a stronger weapon in its arsenal. The combine must change to survive, and that means individual members of the guild must grow and adapt as well.\n"
    }
  ]
}