{
  "name": "Elf (Zendikar) (Mul Daya Nation)",
  "size": "M",
  "speed": "30",
  "ability": "Wis 2, Str 1",
  "proficiency": "Perception",
  "spellAbility": "Wisdom",
  "trait": [
    {
      "name": "Description",
      "text": "Source: Plane Shift: Zendikar p. 19"
    },
    {
      "name": "Mul Daya Magic",
      "text": "You know the chill touch cantrip. When you reach 3rd level, you can cast the hex spell once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the darkness spell once with this trait and regain the ability to do so when you finish a long rest. Wisdom is your spellcasting ability for these spells.\n"
    },
    {
      "name": "Sunlight Sensitivity",
      "text": "You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight.\n"
    },
    {
      "name": "Elf Weapon Training",
      "text": "You have proficiency with the longsword, shortsword, shortbow, and longbow.\n"
    },
    {
      "name": "Age",
      "text": "Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old.\n"
    },
    {
      "name": "Alignment",
      "text": "Elves love freedom, variety, and self-expression, so they lean strongly toward the gentler aspects of chaos. They value and protect others' freedom as well as their own, and they are more often good than not.\n"
    },
    {
      "name": "Size",
      "text": "Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium.\n"
    },
    {
      "name": "Superior Darkvision",
      "text": "Your Darkvision has a radius of 120 feet.\n"
    },
    {
      "name": "Keen Senses",
      "text": "You have proficiency in the Perception skill.\n"
    },
    {
      "name": "Fey Ancestry",
      "text": "You have advantage on saving throws against being charmed, and magic can't put you to sleep.\n"
    },
    {
      "name": "Languages",
      "text": "You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires.\n"
    }
  ]
}