{
  "name": "Gnome (Forest)",
  "size": "S",
  "speed": "25",
  "ability": "Int 2, Dex 1",
  "spellAbility": "Intelligence",
  "trait": [
    {
      "name": "Description",
      "text": "Source: Player's Handbook p. 37"
    },
    {
      "name": "Natural Illusionist",
      "text": "You know the minor illusion cantrip. Intelligence is your spellcasting ability for it.\n"
    },
    {
      "name": "Speak with Small Beasts",
      "text": "Through sounds and gestures, you can communicate simple ideas with Small or smaller beasts. Forest gnomes love animals and often keep squirrels, badgers, rabbits, moles, woodpeckers, and other creatures as beloved pets.\n"
    },
    {
      "name": "Age",
      "text": "Gnomes mature at the same rate humans do, and most are expected to settle down into an adult life by around age 40. They can live 350 to almost 500 years.\n"
    },
    {
      "name": "Alignment",
      "text": "Gnomes are most often good. Those who tend toward law are sages, engineers, researchers, scholars, investigators, or inventors. Those who tend toward chaos are minstrels, tricksters, wanderers, or fanciful jewelers. Gnomes are good-hearted, and even the tricksters among them are more playful than vicious.\n"
    },
    {
      "name": "Size",
      "text": "Gnomes are between 3 and 4 feet tall and average about 40 pounds. Your size is Small.\n"
    },
    {
      "name": "Darkvision",
      "text": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n"
    },
    {
      "name": "Gnome Cunning",
      "text": "You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic.\n"
    },
    {
      "name": "Languages",
      "text": "You can speak, read, and write Common and Gnomish. The Gnomish language, which uses the Dwarvish script, is renowned for its technical treatises and its catalogs of knowledge about the natural world.\n"
    }
  ]
}