{
  "name": "Kalashtar (UA Races of Eberron)",
  "size": "M",
  "speed": "30",
  "ability": "Cha 1, Wis 1",
  "trait": [
    {
      "name": "Description",
      "text": "Source: Unearthed Arcana: Races Of Eberron p. 3"
    },
    {
      "name": "Age",
      "text": "Kalashtar (UA Races of Eberron) develop physically at the same rate as humans do and have similar lifespans.\n"
    },
    {
      "name": "Alignment",
      "text": "The noble spirit tied to a Kalashtar (UA Races of Eberron) drives it toward lawful and good behavior. Most Kalashtar (UA Races of Eberron) combine self-discipline with compassion for all sentient beings, but some Kalashtar (UA Races of Eberron) resist the virtuous influence of their spirit.\n"
    },
    {
      "name": "Size",
      "text": "Kalashtar (UA Races of Eberron) are similar in build to humans, though they are typically a few inches taller. Your size is Medium.\n"
    },
    {
      "name": "Dual Mind",
      "text": "When you make a Wisdom saving throw, you can use your reaction to gain advantage on the roll. You can use this trait immediately before or after you roll, but before any of the roll's effects occur.\n"
    },
    {
      "name": "Mental Discipline",
      "text": "You have resistance to psychic damage.\n"
    },
    {
      "name": "Mind Link",
      "text": "You can speak telepathically to any creature you can see within 60 feet of you. You don't need to share a language with the creature for it to understand your telepathic messages, but the creature must be able to understand at least one language or be telepathic itself.\nAs a bonus action when you're speaking telepathically to a creature, you can give that creature the ability to speak telepathically to you until the start of your next turn. To use this ability, the creature must be within 60 feet of you and able to see you.\n"
    },
    {
      "name": "Psychic Glamour",
      "text": "Choose one of the following skills: Insight, Intimidation, Performance, or Persuasion. You have advantage on all ability checks you make with that skill.\n"
    },
    {
      "name": "Severed from Dreams",
      "text": "Kalashtar (UA Races of Eberron) sleep, but they don't connect to the plane of dreams as other creatures do. Instead, their minds draw from the memories of their otherworldly spirit while they sleep. As such, you are immune to spells and other magical effects that require you to dream, like the dream spell, but not to spells and effects that put you to sleep, like the sleep spell.\n"
    },
    {
      "name": "Languages",
      "text": "You can speak, read, and write Common, Quori, and one other language of your choice.\n"
    }
  ]
}