{
  "name": "Acererak",
  "size": "M",
  "type": "undead",
  "alignment": "Neutral Evil",
  "ac": "21 (natural armor)",
  "hp": "285 (30d8+150)",
  "speed": "walk 30 ft.",
  "str": "13",
  "dex": "16",
  "con": "20",
  "int": "27",
  "wis": "21",
  "cha": "20",
  "save": "Con +12, Int +15, Wis +12",
  "skill": "Arcana +22, History +22, Insight +12, Perception +12",
  "passive": "22",
  "languages": "Abyssal, Common, Draconic, Dwarvish, Elvish, Giant, Infernal, Primordial, Undercommon",
  "cr": "23",
  "resist": "cold, lightning",
  "immune": "necrotic, poison; bludgeoning, piercing, slashing from nonmagical attacks",
  "conditionImmune": "blinded, charmed, deafened, exhaustion, frightened, paralyzed, petrified, poisoned, stunned",
  "senses": "truesight 120 ft.",
  "trait": [
    {
      "name": "Special Equipment",
      "text": [
        "Acererak carries the Staff of the Forgotten One. He wears a Talisman of the Sphere and has a Sphere of Annihilation under his control."
      ]
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "text": [
        "If Acererak fails a saving throw, he can choose to succeed instead."
      ]
    },
    {
      "name": "Rejuvenation",
      "text": [
        "Acererak's body turns to dust when he drops to 0 hit points, and his equipment is left behind. Acererak gains a new body after 1d10 days, regaining all his hit points and becoming active again. The new body appears within 5 feet of Acererak's phylactery, the location of which is hidden."
      ]
    },
    {
      "name": "Turn Resistance",
      "text": [
        "Acererak has advantage on saving throws against any effect that turns undead."
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "Acererak is a 20th-level spellcaster. His spellcasting ability is Intelligence (spell save DC 23, +15 to hit with spell attacks). Acererak has the following wizard spells prepared:",
        "Cantrips (at will): mage hand, ray of frost, shocking grasp",
        "• 1st level (0 slots): ray of sickness, shield",
        "• 2nd level (0 slots): arcane lock, knock",
        "• 3rd level (0 slots): animate dead, counterspell",
        "• 4th level (3 slots): blight, ice storm, phantasmal killer",
        "• 5th level (3 slots): cloudkill, hold monster, wall of force",
        "• 6th level (3 slots): chain lightning, circle of death, disintegrate",
        "• 7th level (3 slots): finger of death, plane shift, teleport",
        "• 8th level (2 slots): maze, mind blank",
        "• 9th level (2 slots): power word kill, time stop"
      ]
    }
  ],
  "action": [
    {
      "name": "Paralyzing Touch",
      "text": [
        "Melee Spell Attack: +15 to hit, reach 5 ft., one creature. 10 (3d6) cold damage, and the target must succeed on a DC 20 Constitution saving throw or be paralyzed for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
      ],
      "attack": [
        "Paralyzing Touch|+15|3d6"
      ]
    },
    {
      "name": "Staff (+3 Quarterstaff)",
      "text": [
        "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. 7 (1d6 + 4) bludgeoning damage plus 10 (3d6) necrotic damage, or 8 (1d8 + 4) bludgeoning damage plus 10 (3d6) necrotic damage when used with two hands."
      ],
      "attack": [
        "Staff (+3 Quarterstaff)|+11|1d6+4"
      ]
    },
    {
      "name": "Invoke Curse",
      "text": [
        "While holding the Staff of the Forgotten One, Acererak expends 1 charge from it and targets one creature he can see within 60 feet of him. The target must succeed on a DC 23 Constitution saving throw or be cursed. Until the curse is ended, the target can't regain hit points and has vulnerability to necrotic damage. Greater restoration, remove curse, or similar magic ends the curse on the target."
      ]
    }
  ],
  "legendary": [
    {
      "text": [
        "Acererak can take 5 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. Acererak regains spent legendary actions at the start of its turn."
      ]
    },
    {
      "name": "At-Will Spell",
      "text": [
        "Acererak casts one of his at-will spells."
      ]
    },
    {
      "name": "Melee Attack",
      "text": [
        "Acererak uses Paralyzing Touch or makes one melee attack with his staff."
      ]
    },
    {
      "name": "Frightening Gaze (Costs 2 Actions)",
      "text": [
        "Acererak fixes his gaze on one creature he can see within 10 feet of him. The target must succeed on a DC 20 Wisdom saving throw against this magic or become frightened for 1 minute. The frightened target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a target's saving throw is successful or the effect ends for it, the target its immune to Acererak's gaze for the next 24 hours."
      ]
    },
    {
      "name": "Talisman of the Sphere (Costs 2 Actions)",
      "text": [
        "Acererak uses his Talisman of the Sphere to move the Sphere of Annihilation under his control up to 90 feet."
      ]
    },
    {
      "name": "Disrupt Life (Costs 3 Actions)",
      "text": [
        "Each creature within 20 feet of Acererak must make a DC 20 Constitution saving throw against this magic, taking 42 (12d6) necrotic damage on a failed save, or half as much damage on a successful one."
      ]
    }
  ],
  "slots": [
    "0, 0, 0, 3, 3, 3, 3, 2, 2"
  ],
  "spells": "mage hand, ray of frost, shocking grasp, ray of sickness, shield, arcane lock, knock, animate dead, counterspell, blight, ice storm, phantasmal killer, cloudkill, hold monster, wall of force, chain lightning, circle of death, disintegrate, finger of death, plane shift, teleport, maze, mind blank, power word kill, time stop",
  "description": "Acererak is an archlich who travels between worlds and is known to take sick pleasure in devouring the souls of adventurers, whom he lures into trap-ridden dungeons where they suffer horrible deaths. One such dungeon lies under the lost city of Omu. This dungeon is called the Tomb of the Nine Gods, for Acererak slew nine false gods and sealed them within it. More recently, he built a necromantic device called the Soulmonger, then hid it in the heart of the tomb.\nAcererak's Traits. Ideal. \"Why be a god when I can be a creator of gods?\"\nBond. \"I build dungeons to trap and slay powerful adventurers. Their deaths and souls are my nourishment.\"\nFlaw. \"I underestimate the resolve of my enemies.\"\nSource: Tomb of Annihilation p. 209"
}