{
  "name": "Ahu-nixta",
  "size": "L",
  "type": "aberration",
  "alignment": "Neutral Evil",
  "ac": "14 (Clockwork Armor)",
  "hp": "67 (9d10+18)",
  "speed": "walk 30 ft., fly 30 ft., swim 30 ft.",
  "str": "17",
  "dex": "15",
  "con": "14",
  "int": "19",
  "wis": "13",
  "cha": "10",
  "skill": "Perception +3",
  "passive": "13",
  "languages": "Deep Speech",
  "cr": "3",
  "immune": "poison, psychic",
  "conditionImmune": "charmed, exhaustion, frightened, paralyzed, petrified, poisoned, prone",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Clockwork Encasement",
      "text": [
        "The creature within the machine is a somewhat shapeless mass, both protected and given concrete manipulators by its armor. The clockwork armor has a variety of manipulators that the ahu-nixta can use to attack or to interact with objects outside of the armor. When the ahu-nixta is reduced to 0 hp, its clockwork armor breaks and the ahunixta exits it. Once out of its armor, the creature s pulpy mass no longer receives the benefits of the listed Damage or Condition Immunities, except for psychic and prone.",
        "Without its clockwork armor, the ahu-nixta has the following statistics. AC 12, hp 37 (5d10 + 10), Strength 9 (-1), and all its modes of travel are reduced to 20 feet. In addition, it has no attack actions, though it can still cast its spells. The ahu-nixta s body can form eyes, mouths, and grabbing appendages. Its grabbing appendages can pick up objects and manipulate them, but the appendages can t be used for combat. The ahu-nixta s extra appendages can open and close glass-covered viewing ports in the clockwork armor, requiring no action, so it can see and interact with objects outside the armor.",
        "The ahu-nixta can exit or enter its clockwork armor as a bonus action."
      ]
    },
    {
      "name": "Immutable Form",
      "text": [
        "The clockwork armor of the ahu-nixta is immune to any spell or effect that would alter its form, as is the creature that controls it as long as the ahu-nixta remains within the armor."
      ]
    },
    {
      "name": "Innate Spellcasting",
      "text": [
        "The ahu-nixta's innate spellcasting ability is Intelligence (spell save DC 14, +6 to hit with spell attacks). It can innately cast the following spells, requiring no material components:",
        "At will: fear, fire bolt (2d10), telekinesis"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The ahu-nixta makes three melee attacks. It can cast one at will spell in place of two melee attacks."
      ]
    },
    {
      "name": "Whirring Blades",
      "text": [
        "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 8 (2d4 + 3) slashing damage."
      ],
      "attack": [
        "Whirring Blades|5|2d4+3"
      ]
    },
    {
      "name": "Pronged Scepter",
      "text": [
        "Melee Weapon Attack: +5 to hit, reach 10 ft., one target. 6 (1d6 + 3) piercing damage."
      ],
      "attack": [
        "Pronged Scepter|5|1d6+3"
      ]
    },
    {
      "name": "Bashing Rod",
      "text": [
        "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 8 (1d10 + 3) bludgeoning damage."
      ],
      "attack": [
        "Bashing Rod|5|1d10+3"
      ]
    }
  ],
  "spells": "fear, fire bolt, telekinesis",
  "description": "Source: CCodex (3pp) p. 11"
}