{
  "name": "Ahuizotl",
  "size": "S",
  "type": "monstrosity",
  "alignment": "Unaligned",
  "ac": "14 (natural armor)",
  "hp": "71 (13d6+26)",
  "speed": "walk 30 ft., swim 30 ft.",
  "str": "16",
  "dex": "15",
  "con": "14",
  "int": "6",
  "wis": "12",
  "cha": "6",
  "skill": "Perception +3",
  "passive": "13",
  "cr": "2",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Amphibious",
      "text": [
        "The ahuizotl can breathe air and water."
      ]
    },
    {
      "name": "Spiky Coat",
      "text": [
        "A creature that touches the ahuizotl or hits it with a melee attack while within 5 feet of it must succeed on a DC 14 Dexterity saving throw or take 4 (1d8) piercing damage."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The ahuizotl can use its Tail Grab. It then makes two attacks. one with its bite and one with its claw."
      ]
    },
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 6 (1d6 + 3) piercing damage."
      ],
      "attack": [
        "Bite|5|1d6+3"
      ]
    },
    {
      "name": "Claw",
      "text": [
        "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 6 (1d6 + 3) slashing damage."
      ],
      "attack": [
        "Claw|5|1d6+3"
      ]
    },
    {
      "name": "Tail Grab",
      "text": [
        "The ahuizotl grabs a creature or item. If the target is a Medium or smaller creature, it must succeed on a DC 14 Strength saving throw or be grappled (escape DC 14). The ahuizotl can then move up to its speed as a bonus action. The grappled creature must succeed on a DC 14 Strength saving throw or be pulled along 5 feet behind the ahuizotl. A creature being dragged by the ahuizotl makes attack rolls and Dexterity saving throws with disadvantage.",
        "If the target is an object or weapon being held by another creature, that creature must succeed on a DC 14 Strength saving throw, or the ahuizotl pulls the object away from the creature.",
        "After stealing an object or weapon, the ahuizotl can move up to its speed as a bonus action. The ahuizotl can only grapple one creature or hold one weapon or object at a time. If holding a weapon, it can use its Tail Grab action to make one attack with the weapon with no proficiency bonus"
      ]
    }
  ],
  "description": "Source: CCodex (3pp) p. 10",
  "environment": "underwater"
}