{
  "name": "Alkilith",
  "size": "M",
  "type": "fiend (demon)",
  "alignment": "Chaotic Evil",
  "ac": "17 (natural armor)",
  "hp": "157 (15d8+90)",
  "speed": "walk 40 ft.",
  "str": "12",
  "dex": "19",
  "con": "22",
  "int": "6",
  "wis": "11",
  "cha": "7",
  "save": "Dex +8, Con +10",
  "skill": "Stealth +8",
  "passive": "10",
  "languages": "understands Abyssal but can't speak",
  "cr": "11",
  "resist": "acid, cold, fire, lightning; bludgeoning, piercing, slashing from nonmagical attacks",
  "immune": "poison",
  "conditionImmune": "charmed, frightened, poisoned",
  "senses": "darkvision 120 ft.",
  "trait": [
    {
      "name": "Amorphous",
      "text": [
        "The alkilith can move through a space as narrow as 1 inch wide without squeezing."
      ]
    },
    {
      "name": "False Appearance",
      "text": [
        "While the alkilith is motionless, it is indistinguishable from an ordinary slime or fungus."
      ]
    },
    {
      "name": "Foment Madness",
      "text": [
        "Any creature that isn't a demon that starts its turn within 30 feet of the alkilith must succeed on a DC 18 Wisdom saving throw, or it hears a faint buzzing in its head for a moment and has disadvantage on its next attack roll, saving throw, or ability check.",
        "If the saving throw against Foment Madness fails by 5 or more, the creature is instead subjected to the confusion spell for 1 minute (no concentration required by the alkilith). While under the effect of that confusion, the creature is immune to Foment Madness."
      ]
    },
    {
      "name": "Magic Resistance",
      "text": [
        "The alkilith has advantage on saving throws against spells and other magical effects."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The alkilith makes three tentacle attacks."
      ]
    },
    {
      "name": "Tentacle",
      "text": [
        "Melee Weapon Attack: +8 to hit, reach 15 ft., one target. 18 (4d6 + 4) acid damage."
      ],
      "attack": [
        "Tentacle|+8|4d6+4"
      ]
    }
  ],
  "description": "Alkilith. An alkilith is easily mistaken for some kind of foul fungal growth that appears on doorways, windows, and other portals. These dripping infestations conceal the demonic nature of the alkilith, making what should be a dire warning appear strange but otherwise innocuous. Wherever alkiliths take root, they weaken the fabric of reality, creating a portal through which even nastier demons can invade.\nSymptoms of Doom. The appearance of an alkilith in the world heralds a great wrongness and an imminent catastrophe. An alkilith searches for an aperture such as a window or a door around which it can take root, stretching its body around the opening and anchoring itself with a sticky secretion. If left undisturbed, the opening becomes attuned to the Abyss and eventually becomes a portal to that plane (see \"Planar Portals\" in chapter 2 of the Dungeon Master's Guide).\nSpawn of Juiblex. Alkiliths spring from the cast-off bits of Juiblex's hideous, shuddering body, then gradually become self-aware and set out to find their way onto the Material Plane. Since most cultists consider them too risky for summoning—they can, after all, create portals to the Abyss—alkiliths must find other escape routes out of their native plane.\nSource: Mordenkainen's Tome of Foes p. 130, Essentials Kit: Dragon of Icespire Peak, Essentials Kit: Sleeping Dragon's Wake",
  "environment": "underdark, urban"
}