{
  "name": "Ankou Soul Seeker",
  "size": "L",
  "type": "dragon",
  "alignment": "Neutral",
  "ac": "15 (natural armor)",
  "hp": "171 (18d10+72)",
  "speed": "walk 40 ft., fly 80 ft.",
  "str": "17",
  "dex": "10",
  "con": "19",
  "int": "13",
  "wis": "14",
  "cha": "16",
  "save": "Dex +3, Con +7, Wis +5, Cha +5",
  "skill": "Perception +8, Persuasion +6, Stealth +3",
  "passive": "18",
  "languages": "All",
  "cr": "8",
  "immune": "cold, necrotic, poison",
  "conditionImmune": "charmed, exhaustion, frightened, poisoned",
  "senses": "truesight 60 ft.",
  "trait": [
    {
      "name": "Aura Of Necromancy's Bane",
      "text": [
        "When an undead creature starts its turn within 30 feet of the ankou, the undead must make a DC 15 Constitution saving throw, taking 7 (2d6) radiant damage on a failed save, or half as much damage on a successful one."
      ]
    },
    {
      "name": "Cloak Of Shadows",
      "text": [
        "As a bonus action while in dim light or darkness, the ankou becomes invisible. The cloak of shadows ends when the ankou chooses to end it as a bonus action, when the ankou dies, or if the ankou ends its turn in bright light."
      ]
    },
    {
      "name": "Death Ascended",
      "text": [
        "The ankou has the celestial type in addition to the dragon type."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The ankou makes three attacks. one with its bite and two with its claws."
      ]
    },
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 10 ft., one target. 14 (2d10 + 3) piercing damage plus 4 (1d8) cold damage."
      ],
      "attack": [
        "Bite|6|2d10+3"
      ]
    },
    {
      "name": "Claw",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 10 (2d6 + 3) slashing damage"
      ],
      "attack": [
        "Claw|6|2d6+3"
      ]
    },
    {
      "name": "Reaper's Breath (Recharge 56)",
      "text": [
        "The ankou exhales cold fire in a 30-foot line that is 5 feet wide. Each creature in that area must make a DC 15 Dexterity saving throw, taking 44 (8d10) cold damage on a failed save, or half as much damage on a successful one. Undead creatures automatically fail the saving throw and treat all damage dealt by this breath weapon as radiant instead of cold."
      ]
    },
    {
      "name": "Change Shape",
      "text": [
        "The ankou magically polymorphs into any beast, humanoid, or undead creature it has seen before that has a challenge rating no higher than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (the ankou's choice). Its statistics, other than its size, are the same in each form and it doesn't gain any class features or legendary actions of the new form."
      ]
    },
    {
      "name": "Usher of Souls",
      "text": [
        "The ankou can transport itself and up to eight creatures in contact with it to another plane of existence. This works like the plane shift spell, except dead or incorporeal creatures can be transported and don't have to be willing. The ankou can't use this ability to banish an unwilling creature."
      ]
    }
  ],
  "description": "Source: CCodex (3pp)"
}