{
  "name": "Aurinax",
  "size": "H",
  "type": "dragon",
  "alignment": "Lawful Good",
  "ac": "19 (natural armor)",
  "hp": "256 (19d12+133)",
  "speed": "walk 40 ft., fly 80 ft., swim 40 ft.",
  "str": "27",
  "dex": "14",
  "con": "25",
  "int": "16",
  "wis": "15",
  "cha": "24",
  "save": "Dex +8, Con +13, Wis +8, Cha +13",
  "skill": "Insight +8, Perception +14, Persuasion +13, Stealth +8",
  "passive": "24",
  "languages": "Common, Draconic",
  "cr": "17",
  "immune": "fire",
  "senses": "blindsight 60 ft., darkvision 120 ft.",
  "trait": [
    {
      "name": "Amphibious",
      "text": [
        "Aurinax can breathe air and water."
      ]
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "text": [
        "If Aurinax fails a saving throw, it can choose to succeed instead."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "Aurinax can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."
      ]
    },
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +14 to hit, reach 10 ft., one target. 19 (2d10 + 8) piercing damage."
      ],
      "attack": [
        "Bite|+14|2d10+8"
      ]
    },
    {
      "name": "Claw",
      "text": [
        "Melee Weapon Attack: +14 to hit, reach 5 ft., one target. 15 (2d6 + 8) slashing damage."
      ],
      "attack": [
        "Claw|+14|2d6+8"
      ]
    },
    {
      "name": "Tail",
      "text": [
        "Melee Weapon Attack: +14 to hit, reach 15 ft., one target. 17 (2d8 + 8) bludgeoning damage."
      ],
      "attack": [
        "Tail|+14|2d8+8"
      ]
    },
    {
      "name": "Frightful Presence",
      "text": [
        "Each creature of Aurinax's choice that is within 120 feet of Aurinax and aware of it must succeed on a DC 21 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to Aurinax's Frightful Presence for the next 24 hours."
      ]
    },
    {
      "name": "Breath Weapons (Recharge 5-6)",
      "text": [
        "Aurinax uses one of the following breath weapons.",
        "• Fire Breath. Aurinax exhales fire in a 60-foot cone. Each creature in that area must make a DC 21 Dexterity saving throw, taking 66 (12d10) fire damage on a failed save, or half as much damage on a successful one.",
        "• Weakening Breath. Aurinax exhales gas in a 60-foot cone. Each creature in that area must succeed on a DC 21 Strength saving throw or have disadvantage on Strength-based attack rolls, Strength checks, and Strength saving throws for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
      ],
      "attack": [
        "Breath Weapons (Recharge 5-6)||12d10"
      ]
    },
    {
      "name": "Change Shape",
      "text": [
        "Aurinax magically polymorphs into a humanoid or beast that has a challenge rating no higher than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (Aurinax's choice).",
        "In a new form, Aurinax retains its alignment, hit points, Hit Dice, ability to speak, proficiencies, Legendary Resistance, lair actions, and Intelligence, Wisdom, and Charisma scores, as well as this action. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form."
      ]
    }
  ],
  "legendary": [
    {
      "text": [
        "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn."
      ]
    },
    {
      "name": "Detect",
      "text": [
        "Aurinax makes a Wisdom (Perception) check."
      ]
    },
    {
      "name": "Tail Attack",
      "text": [
        "Aurinax makes a tail attack."
      ]
    },
    {
      "name": "Wing Attack (Costs 2 Actions)",
      "text": [
        "Aurinax beats its wings. Each creature within 10 feet of Aurinax must succeed on a DC 22 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. Aurinax can then fly up to half its flying speed."
      ]
    },
    {
      "name": "Lair Actions"
    },
    {
      "text": [
        "On initiative count 20 (losing initiative ties), the dragon takes a lair action to cause one of the following effects; the dragon can't use the same effect two rounds in a row:",
        "• The dragon glimpses the future, so it has advantage on attack rolls, ability checks, and saving throws until initiative count 20 on the next round.",
        "• One creature the dragon can see within 120 feet of it must succeed on a DC 15 Charisma saving throw or be banished to a dream plane, a different plane of existence the dragon has imagined into being. To escape, the creature must use its action to make a Charisma check contested by the dragon's. If the creature wins, it escapes the dream plane. Otherwise, the effect ends on initiative count 20 on the next round. When the effect ends, the creature reappears in the space it left or in the nearest unoccupied space if that one is occupied."
      ]
    },
    {
      "name": "Regional Effects"
    },
    {
      "text": [
        "The region containing a legendary gold dragon's lair is warped by the dragon's magic, which creates one or more of the following effects:",
        "• Whenever a creature that can understand a language sleeps or enters a state of trance or reverie within 6 miles of the dragon's lair, the dragon can establish telepathic contact with that creature and converse with it in its dreams. The creature remembers its conversation with the dragon upon waking.",
        "• Banks of beautiful, opalescent mist manifest within 6 miles of the dragon's lair. The mist doesn't obscure anything. It assumes haunting forms when evil creatures are near the dragon or other non-evil creatures in the mist, warning such creatures of the danger.",
        "• Gems and pearls within 1 mile of the dragon's lair sparkle and gleam, shedding dim light in a 5-foot radius.",
        "If the dragon dies, these effects end immediately."
      ]
    }
  ],
  "description": "\nSource: Waterdeep: Dragon Heist p. 194",
  "environment": "grassland, forest"
}