{
  "name": "Babau",
  "size": "M",
  "type": "fiend (demon)",
  "alignment": "Chaotic Evil",
  "ac": "16 (natural armor)",
  "hp": "82 (11d8+33)",
  "speed": "walk 40 ft.",
  "str": "19",
  "dex": "16",
  "con": "16",
  "int": "11",
  "wis": "12",
  "cha": "13",
  "skill": "Perception +5, Stealth +5",
  "passive": "15",
  "languages": "Abyssal",
  "cr": "4",
  "resist": "cold, fire, lightning; bludgeoning, piercing, slashing from nonmagical attacks",
  "immune": "poison",
  "conditionImmune": "poisoned",
  "senses": "darkvision 120 ft.",
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The babau makes two melee attacks. It can also use Weakening Gaze before or after making these attacks."
      ]
    },
    {
      "name": "Claw",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 8 (1d8 + 4) slashing damage."
      ],
      "attack": [
        "Claw|+6|1d8+4"
      ]
    },
    {
      "name": "Spear",
      "text": [
        "Melee or Ranged Weapon Attack: +6 to hit, reach 5 ft. or range 20/60 ft., one target. 7 (1d6 + 4) piercing damage, or 8 (1d8 + 4) piercing damage when used with two hands to make a melee attack."
      ],
      "attack": [
        "Spear|+6|1d6+4"
      ]
    },
    {
      "name": "Weakening Gaze",
      "text": [
        "The babau targets one creature that it can see within 20 feet of it. The target must make a DC 13 Constitution saving throw. On a failed save, the target deals only half damage with weapon attacks that use Strength for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
      ]
    }
  ],
  "trait": [
    {
      "name": "Innate Spellcasting",
      "text": [
        "The babau's innate spellcasting ability is Wisdom (spell save DC 11). The babau can innately cast the following spells, requiring no material components:",
        "At will: darkness, dispel magic, fear, heat metal, levitate"
      ]
    }
  ],
  "spells": "darkness, dispel magic, fear, heat metal, levitate",
  "description": "Demon lords create lesser demons for the purpose of spreading chaos and terror throughout the multiverse.\nBabau. Demons and devils clash endlessly for control of the Lower Planes. One of these battles pitted the legions of the archdevil Glasya against the screaming hordes of the demon lord Graz'zt. It is said that Glasya wounded Graz'zt with her sword, and the first babaus arose where his blood struck the ground. Their sudden appearance helped rout Glasya and secured Graz'zt's place as one of the preeminent demon lords of the Abyss.\nA babau demon possesses the cunning of a devil and the bloodthirstiness of a demon. It has leathery black skin pulled tight over its gaunt frame, and a curved horn protruding from the back of its elongated skull. A babau's baleful glare can weaken a creature.\nSource: Volo's Guide to Monsters p. 136",
  "environment": "underdark, urban"
}