{
  "name": "Balhannoth",
  "size": "L",
  "type": "aberration",
  "alignment": "Chaotic Evil",
  "ac": "17 (natural armor)",
  "hp": "114 (12d10+48)",
  "speed": "walk 25 ft., climb 25 ft.",
  "str": "17",
  "dex": "8",
  "con": "18",
  "int": "6",
  "wis": "15",
  "cha": "8",
  "save": "Con +8",
  "skill": "Perception +6",
  "passive": "16",
  "languages": "understands Deep Speech, telepathy 1 mile",
  "cr": "11",
  "conditionImmune": "blinded",
  "senses": "blindsight 500 ft. (blind beyond this radius)",
  "trait": [
    {
      "name": "Legendary Resistance (2/Day)",
      "text": [
        "If the balhannoth fails a saving throw, it can choose to succeed instead."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The balhannoth makes a bite attack and up to two tentacle attacks, or it makes up to four tentacle attacks."
      ]
    },
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. 25 (4d10 + 3) piercing damage."
      ],
      "attack": [
        "Bite|+7|4d10+3"
      ]
    },
    {
      "name": "Tentacle",
      "text": [
        "Melee Weapon Attack: +7 to hit, reach 10 ft., one target. 10 (2d6 + 3) bludgeoning damage, and the target is grappled (escape DC 15) and is moved up to 5 feet toward the balhannoth. Until this grapple ends, the target is restrained, and the balhannoth can't use this tentacle against other targets. The balhannoth has four tentacles."
      ],
      "attack": [
        "Tentacle|+7|2d6+3"
      ]
    }
  ],
  "legendary": [
    {
      "text": [
        "The aberration can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The aberration regains spent legendary actions at the start of its turn."
      ]
    },
    {
      "name": "Bite Attack",
      "text": [
        "The balhannoth makes one bite attack against one creature it has grappled."
      ]
    },
    {
      "name": "Teleport",
      "text": [
        "The balhannoth magically teleports, along with any equipment it is wearing or carrying and any creatures it has grappled, up to 60 feet to an unoccupied space it can see."
      ]
    },
    {
      "name": "Vanish",
      "text": [
        "The balhannoth magically becomes invisible for up to 10 minutes or until immediately after it makes an attack roll."
      ]
    },
    {
      "name": "Lair Actions"
    },
    {
      "text": [
        "When fighting inside its lair, a balhannoth can use lair actions. On initiative count 20 (losing initiative ties), a balhannoth can take one lair action to cause one of the following effects; the balhannoth can't use the same lair action two rounds in a row:",
        "• The balhannoth warps reality around it in an area up to 500 feet square. After 10 minutes, the terrain in the area reshapes to assume the appearance of a location sought by one intelligent creature whose mind the balhannoth has read (see Regional Effects below). The transformation affects nonliving material only and can't create anything with moving parts or magical properties. Any object created in this area is, upon close inspection, revealed as a fake. Books are filled with empty pages, golden items are obvious counterfeits, and so on. The transformation lasts until the balhannoth dies or uses this lair action again.",
        "• The balhannoth targets one creature within 500 feet of it. The target must succeed on a DC 16 Wisdom saving throw or the target, along with whatever it is wearing and carrying, teleports to an unoccupied space of the balhannoth's choice within 60 feet of it.",
        "• The balhannoth targets one creature within 500 feet of it. The target must succeed on a DC 16 Wisdom saving throw or the balhannoth becomes invisible to that creature for 1 minute. This effect ends if the balhannoth attacks the target."
      ]
    },
    {
      "name": "Regional Effects"
    },
    {
      "text": [
        "A region containing a balhannoth's lair becomes warped by the creature's unnatural presence, which creates one or more of the following effects:",
        "• Creatures within 1 mile of the balhannoth's lair experience a sensation of being close to whatever they desire most. The sensation grows stronger the closer the creatures come to the balhannoth's lair.",
        "• The balhannoth can sense the strongest desires of any humanoid within 1 mile of it and learns whether those desires involve a place: a safe location to rest, a temple, home, or somewhere else.",
        "If the balhannoth dies, these effects end immediately."
      ]
    }
  ],
  "description": "\nThere are no virtues in the Shadowfell. Thanks to the balhannoth, even hope is punished with death.\n — Mordenkainen\n\nBalhannoth. Native to the Shadowfell, the vicious, predatory balhannoth alters reality in its lair to make the place appear inviting to travelers. Once they step inside, the balhannoth springs its trap.\nFalse Hope. Thanks to a limited form of telepathy, a balhannoth can sense the desires of other creatures and identify images of places where they expect those desires to be met. The balhannoth then warps reality around it, remaking its environment so that it matches the appearance of the place the creature seeks.\nThe balhannoth never quite gets all the details right, and plenty of incongruities might give away the deception, but the imitation is good enough to fool desperate creatures into stumbling into the monster's clutches.\nMalevolent Entities. A balhannoth thrives on fear and despair, taking pleasure in the horror its victims experience. It terrorizes its prey by using its reality—warping powers to mask its presence until it can snatch the target. Then it teleports away to feed on its victims.\nUseful Slaves. Drow hunting parties and other denizens of the Underdark sometimes venture into the Shadowfell to capture balhannoths. They install the creatures as guardians, protecting passages from enemy intruders and cutting off avenues of retreat or watching over slaves.\nA Balhannoth's Lair\nIn the Shadowfell, balhannoths make their lairs near places inhabited by creatures they hunt. They typically haunt well-traveled roads and paths, snatching people who come along. A balhannoth that has been captured and exploited by drow might lair in caves near Underdark passages and guard the ways in and out of a drow enclave.\nSource: Mordenkainen's Tome of Foes p. 119",
  "environment": "coastal, mountain, underdark"
}