{
  "name": "Baphomet",
  "size": "H",
  "type": "fiend (demon)",
  "alignment": "Chaotic Evil",
  "ac": "22 (natural armor)",
  "hp": "275 (19d12+152)",
  "speed": "walk 40 ft.",
  "str": "30",
  "dex": "14",
  "con": "26",
  "int": "18",
  "wis": "24",
  "cha": "16",
  "save": "Dex +9, Con +15, Wis +14",
  "skill": "Intimidation +17, Perception +14",
  "passive": "24",
  "languages": "all, telepathy 120 ft.",
  "cr": "23",
  "resist": "cold, fire, lightning",
  "immune": "poison; bludgeoning, piercing, slashing from nonmagical attacks",
  "conditionImmune": "charmed, exhaustion, frightened, poisoned",
  "senses": "truesight 120 ft.",
  "trait": [
    {
      "name": "Charge",
      "text": [
        "If Baphomet moves at least 10 feet straight toward a target and then hits it with a gore attack on the same turn, the target takes an extra 16 (3d10) piercing damage. If the target is a creature, it must succeed on a DC 25 Strength saving throw or be pushed up to 10 feet away and knocked prone."
      ]
    },
    {
      "name": "Labyrinthine Recall",
      "text": [
        "Baphomet can perfectly recall any path he has traveled, and he is immune to the maze spell."
      ]
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "text": [
        "If Baphomet fails a saving throw, he can choose to succeed instead."
      ]
    },
    {
      "name": "Magic Resistance",
      "text": [
        "Baphomet has advantage on saving throws against spells and other magical effects."
      ]
    },
    {
      "name": "Magic Weapons",
      "text": [
        "Baphomet's weapon attacks are magical."
      ]
    },
    {
      "name": "Reckless",
      "text": [
        "At the start of his turn, Baphomet can gain advantage on all melee weapon attack rolls during that turn, but attack rolls against him have advantage until the start of his next turn."
      ]
    },
    {
      "name": "Innate Spellcasting",
      "text": [
        "Baphomet's spellcasting ability is Charisma (spell save DC 18). He can innately cast the following spells, requiring no material components:",
        "At will: detect magic",
        "1/day: teleport",
        "3/day each: dispel magic, dominate beast, hunter's mark, maze, wall of stone"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "Baphomet makes three attacks: one with Heartcleaver, one with his bite, and one with his gore attack."
      ]
    },
    {
      "name": "Heartcleaver",
      "text": [
        "Melee Weapon Attack: +17 to hit, reach 15 ft., one target. 21 (2d10 + 10) slashing damage."
      ],
      "attack": [
        "Heartcleaver|+17|2d10+10"
      ]
    },
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +17 to hit, reach 10 ft., one target. 19 (2d8 + 10) piercing damage."
      ],
      "attack": [
        "Bite|+17|2d8+10"
      ]
    },
    {
      "name": "Gore",
      "text": [
        "Melee Weapon Attack: +17 to hit, reach 10 ft., one target. 17 (2d6 + 10) piercing damage."
      ],
      "attack": [
        "Gore|+17|2d6+10"
      ]
    },
    {
      "name": "Frightful Presence",
      "text": [
        "Each creature of Baphomet's choice within 120 feet of him and aware of him must succeed on a DC 18 Wisdom saving throw or become frightened for 1 minute. A frightened creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. These later saves have disadvantage if Baphomet is within line of sight of the creature.",
        "If a creature succeeds on any of these saves or the effect ends on it, the creature is immune to Baphomet's Frightful Presence for the next 24 hours."
      ]
    }
  ],
  "legendary": [
    {
      "text": [
        "Baphomet can take 2 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. Baphomet regains spent legendary actions at the start of its turn."
      ]
    },
    {
      "name": "Heartcleaver Attack",
      "text": [
        "Baphomet makes a melee attack with Heartcleaver."
      ]
    },
    {
      "name": "Charge (Costs 2 Actions)",
      "text": [
        "Baphomet moves up to his speed, then makes a gore attack."
      ]
    },
    {
      "name": "Lair Actions"
    },
    {
      "text": [
        "On initiative count 20 (losing initiative ties), Baphomet can take a lair action to cause one of the following magical effects; he can't use the same effect two rounds in a row:",
        "• Baphomet seals one doorway or other entryway within the lair. The opening must be unoccupied. It is filled with solid stone for 1 minute or until Baphomet creates this effect again.",
        "• Baphomet chooses a room within the lair that is no larger in any dimension than 100 feet. Until the next initiative count 20, gravity is reversed within that room. Any creatures or objects in the room when this happens fall in the direction of the new pull of gravity, unless they have some means of remaining aloft. Baphomet can ignore the gravity reversal if he's in the room, although he likes to use this action to land on a ceiling to attack targets flying near it.",
        "• Baphomet casts mirage arcane, affecting a room within the lair that is no larger in any dimension than 100 feet. The effect ends on the next initiative count 20."
      ]
    },
    {
      "name": "Regional Effects"
    },
    {
      "text": [
        "The region containing Baphomet's lair is warped by his magic, creating one or more of the following effects:",
        "• Plant life within 1 mile of the lair grows thick and forms walls of trees, hedges, and other flora in the form of small mazes.",
        "• Beasts within 1 mile of the lair become frightened and disoriented, as though constantly under threat of being hunted, and might lash out or panic even when no visible threat is nearby.",
        "• If a humanoid spends at least 1 hour within 1 mile of the lair, that creature must succeed on a DC 18 Wisdom saving throw or descend into a madness determined by the Madness of Baphomet table. A creature that succeeds on this saving throw can't be affected by this regional effect again for 24 hours.",
        "If Baphomet dies, these effects fade over the course of 1d10 days.",
        "If a creature goes mad in Baphomet's lair or within line of sight of the demon lord, roll on the Madness of Baphomet table to determine the nature of the madness, which is a character flaw that lasts until cured. See the Dungeon Master's Guide for more on madness.",
        "Madness of Baphomet",
        "d100 | Flaw (lasts until cured)",
        "01–20 | \"My anger consumes me. I can't be reasoned with when my rage has been stoked.\"",
        "21–40 | \"I degenerate into beastly behavior, seeming more like a wild animal than a thinking being.\"",
        "41–60 | \"The world is my hunting ground. Others are my prey.\"",
        "61–80 | \"Hate comes easily to me and explodes into rage.\"",
        "81–00 | \"I see those who oppose me not as people, but as beasts meant to be preyed upon.\"",
        ""
      ],
      "name": "Regional Effect: Madness of Baphomet"
    }
  ],
  "spells": "detect magic, teleport, dispel magic, dominate beast, hunter's mark, maze, wall of stone",
  "description": "Baphomet. Civilization is weakness and savagery is strength in the credo of Baphomet, the Horned King and the Prince of Beasts. He rules over minotaurs and others with savage hearts. He is worshiped by those who want to break the confines of civility and unleash their bestial natures, for Baphomet envisions a world without restraint, where creatures live out their most savage desires.\nCults devoted to Baphomet use mazes and complex knots as their emblems, creating secret places to indulge themselves, including labyrinths of the sort their master favors. Bloodstained crowns and weapons of iron and brass decorate their profane altars.\nOver time, Baphomet's cultists become tainted by his influence, gaining bloodshot eyes and coarse, thickening hair. Small horns eventually sprout from the forehead. In time, a devoted cultist might transform entirely into a minotaur—considered the greatest gift of the Prince of Beasts.\nBaphomet appears as a great, black-furred minotaur, 20 feet tall with six iron horns. An infernal light burns in his red eyes. Although he is filled with bestial blood lust, there lies within him a cruel and cunning intellect devoted to subverting all of civilization.\nBaphomet wields a great glaive called Heartcleaver. He sometimes casts this deadly weapon aside so that he can charge his enemies and gore them with his horns, trampling them into the earth and rending them with his teeth like a beast.\nBaphomet's Lair\nBaphomet's lair is his palace, the Lyktion, which is on the layer of the Abyss called the Endless Maze. Nestled within the twisting passages of the plane-wide labyrinth, the Lyktion is immaculately maintained and surrounded by a moat constructed in the fashion of a three-dimensional maze. The palace itself is a towering structure whose interior is as labyrinthine as the plane on which it resides, populated by minotaur, goristro, and quasit.\nSource: Mordenkainen's Tome of Foes p. 143, Out of the Abyss p. 235, Baldur's Gate: Descent Into Avernus"
}