{
  "name": "Black Knight Commander",
  "size": "M",
  "type": "humanoid (Any Race),tome of Beasts",
  "alignment": "lawful evil",
  "ac": "18 (plate)",
  "hp": "78 (12d8+24)",
  "speed": "30 ft.",
  "str": "18",
  "dex": "10",
  "con": "14",
  "int": "12",
  "wis": "13",
  "cha": "15",
  "save": "Str +7, Wis +4, Cha +5",
  "skill": "Animal Handling +4, Athletics +7, Intimidation +5",
  "passive": "11",
  "languages": " any two languages",
  "cr": "5",
  "trait": [
    {
      "name": "Charge",
      "text": [
        "If the black knight commander is mounted and moves at least 30 feet in a straight line toward a target and then hits it with a melee attack on the same turn, the target takes an extra 10 (3d6) damage."
      ]
    },
    {
      "name": "Hateful Aura",
      "text": [
        "The black knight commander and allies within 10 feet of the commander add its Charisma modifier to weapon damage rolls (included in damage below)."
      ]
    },
    {
      "name": "Magic Weapons",
      "text": [
        "The black knight commander's weapon attacks are made with magical (+1) weapons."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The black knight commander makes two melee attacks."
      ]
    },
    {
      "name": "Mace",
      "text": [
        "Melee Weapon Attack: +8 to hit, reach 5 ft, one target. Hit: 8 (1d6 + 5) bludgeoning damage."
      ],
      "attack": [
        "Mace|8|1d6+5"
      ]
    },
    {
      "name": "Lance",
      "text": [
        "Melee Weapon Attack: +8 to hit, reach 10 ft., one target. Hit: 11 (1d12 + 5) piercing damage."
      ],
      "attack": [
        "Lance|8|1d12+5"
      ]
    },
    {
      "name": "Frightful Charge (Recharges after a Short or Long Rest)",
      "text": [
        "The black knight commander lets loose a terrifying cry and makes one melee attack at the end of a charge. Whether the attack hits or misses, all enemies within 15 feet of the target and aware of the black knight commander's presence must succeed on a DC 13 Wisdom saving throw or become frightened for 1 minute. A frightened creature repeats the saving throw at the end of each of its turns, ending the effect on itself on a success."
      ]
    }
  ]
}