{
  "name": "Black Earth Priest",
  "size": "M",
  "type": "humanoid (human)",
  "alignment": "Neutral Evil",
  "ac": "17 (splint armor)",
  "hp": "45 (7d8+14)",
  "speed": "walk 30 ft.",
  "str": "15",
  "dex": "11",
  "con": "14",
  "int": "12",
  "wis": "10",
  "cha": "16",
  "skill": "Intimidation +5, Religion +3, Persuasion +5",
  "passive": "10",
  "languages": "Common, Terran",
  "cr": "3",
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The priest makes two melee attacks."
      ]
    },
    {
      "name": "Glaive",
      "text": [
        "Melee Weapon Attack: +4 to hit, reach 10 ft., one target. 7 (1d10 + 2) slashing damage."
      ],
      "attack": [
        "Glaive|+4|1d10+2"
      ]
    }
  ],
  "reaction": [
    {
      "name": "Unyielding",
      "text": [
        "When the priest is subjected to an effect that would move it, knock it prone, or both, it can use its reaction to be neither moved nor knocked prone."
      ]
    }
  ],
  "trait": [
    {
      "name": "Spellcasting",
      "text": [
        "The priest is a 5th-level spellcaster. Its spellcasting ability is Charisma (spell save DC 13, +5 to hit with spell attacks). It knows the following sorcerer spells:",
        "Cantrips (at will): acid splash, blade ward, light, mending, mold earth",
        "• 1st level (4 slots): earth tremor, expeditious retreat, shield",
        "• 2nd level (3 slots): shatter, spider climb",
        "• 3rd level (2 slots): slow"
      ]
    }
  ],
  "slots": [
    "4, 3, 2"
  ],
  "spells": "acid splash, blade ward, light, mending, mold earth, earth tremor, expeditious retreat, shield, shatter, spider climb, slow",
  "description": "The priests of the Black Earth are the drivers and organizers of Ogremoch's cult. They are the true believers, seeing Ogremoch as a divine force, and they have developed a twisted dogma to explain how the evil of elemental earth is destined to remake the world and rule over all. The Black Earth priests form a cabal of leaders whose fanaticism and magical power serve as the backbone of the cult. Individuals of unusual power hold higher rank in the cult, but the priests provide the cult leader with his or her authority over the rest of Ogremoch's followers.\nSource: Princes of the Apocalypse p. 195"
}