{
  "name": "Blood Ooze",
  "size": "L",
  "type": "ooze",
  "alignment": "Unaligned",
  "ac": "8",
  "hp": "76 (8d10+32)",
  "speed": "walk 20 ft., climb 20 ft.",
  "str": "16",
  "dex": "6",
  "con": "18",
  "int": "1",
  "wis": "8",
  "cha": "2",
  "passive": "9",
  "cr": "6",
  "immune": "acid, fire, necrotic, slashing",
  "conditionImmune": "blinded, charmed, deafened, exhaustion, frightened, prone",
  "senses": "blindsight 60 ft. (blind beyond this radius)",
  "trait": [
    {
      "name": "Amorphous",
      "text": [
        "The ooze can move through a space as narrow as 1 inch wide without squeezing."
      ]
    },
    {
      "name": "Blood Drain",
      "text": [
        "A creature that touches the ooze or hits it with a melee attack while within 5 feet of it takes 5 (1d10) necrotic damage and the ooze gains temporary hp equal to that amount as it drains blood from the victim. It can add temporary hp gained from this trait to temporary hp gained from its pseudopod attack and Overflow reaction. Its temporary hp can't exceed half its maximum hp. If the ooze takes radiant damage, this trait doesn't function at the start of the ooze's next turn, although it retains any temporary hp it previously gained."
      ]
    },
    {
      "name": "Spider Climb",
      "text": [
        "The ooze can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
      ]
    }
  ],
  "action": [
    {
      "name": "Pseudopod",
      "text": [
        "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 6 (1d6 + 3) bludgeoning damage plus 16 (3d10) necrotic damage. The ooze gains temporary hp equal to the necrotic damage taken."
      ],
      "attack": [
        "Pseudopod|5|1d6+3"
      ]
    }
  ],
  "reaction": [
    {
      "name": "Overflow",
      "text": [
        "When the blood ooze is hit with a melee attack, it can drain blood from the attacker. The attacker must make a DC 15 Constitution saving throw, taking 11 (2d10) necrotic damage on a failed save, or half as much damage on a successful one. The ooze gains temporary hp equal to the necrotic damage taken."
      ]
    }
  ],
  "description": "Source: CCodex (3pp)"
}