{
  "name": "Bone Knight",
  "size": "M",
  "type": "humanoid (any race)",
  "alignment": "Any Non-Good Alignment",
  "ac": "20 (bonecraft armor)",
  "hp": "84 (13d8+26)",
  "speed": "walk 30 ft.",
  "str": "18",
  "dex": "13",
  "con": "14",
  "int": "12",
  "wis": "14",
  "cha": "16",
  "save": "Wis +5, Cha +6",
  "skill": "Athletics +7, Deception +6, Intimidation +6",
  "passive": "12",
  "languages": "any one language (usually Common)",
  "cr": "5",
  "resist": "necrotic, poison",
  "trait": [
    {
      "name": "Commander of Bones",
      "text": [
        "As a bonus action, the knight can target one skeleton or zombie it can see within 30 feet of it. The target must make a DC 14 Wisdom saving throw. On a failed save, the target must obey the knight's commands until the knight dies or until the knight releases it as a bonus action. The knight can command up to twelve undead at a time this way."
      ]
    },
    {
      "name": "Master of the Pallid Banner",
      "text": [
        "While within 60 feet of the knight, any undead ally of the knight has advantage on saving throws against any effect that turns undead."
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "The knight is an 8th-level spellcaster. Its spellcasting ability is Charisma (spell save DC 14, +6 to hit with spell attacks). It has the following paladin spells prepared:",
        "• 1st level (4 slots): command, compelled duel, hellish rebuke, wrathful smite",
        "• 2nd level (3 slots): branding smite, crown of madness, darkness, find steed, magic weapon"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The knight attacks twice with one of its weapons."
      ]
    },
    {
      "name": "Greatsword",
      "text": [
        "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. 11 (2d6 + 4) slashing damage."
      ],
      "attack": [
        "Greatsword|+7|2d6+4"
      ]
    },
    {
      "name": "Longbow",
      "text": [
        "Ranged Weapon Attack: +4 to hit, range 150/600 ft., one target. 5 (1d8 + 1) piercing damage."
      ],
      "attack": [
        "Longbow|+4|1d8+1"
      ]
    }
  ],
  "slots": [
    "4, 3"
  ],
  "spells": "command, compelled duel, hellish rebuke, wrathful smite, branding smite, crown of madness, darkness, find steed, magic weapon",
  "description": "Bone knights are the champions of the Order of the Emerald Claw. Clad in distinctive bonecraft armor—heavy armor adorned with the bones of fallen enemies—these fearsome warriors command squads of undead soldiers as they pursue the sinister goals of Lady Illmarrow.\nKarrnathi Patriots. Early in the Last War, Karrnath turned to the necromancers of the Blood of Vol to bolster the nation's army with undead forces. The skeletons and zombies created by the necromancers were mindless creatures that required guidance. The first bone knights were appointed to provide this control.\nDevoted paladins of the Blood of Vol were fused into suits of bonecraft armor, whose magic focused their divine gifts, allowing them to command units of mindless undead. Bonecraft armor can't be removed without killing the knight who wears it, and when donning it, each bone knight understood that their former life was over.\nThe Fall of the Emerald Claw. During the Last War, many bone knights took service with the Order of the Emerald Claw, helping that name strike fear into the enemies of Karrnath. In the last decade, King Kaius III of Karrnath has done much to ensure a peaceful end to the Last War. Under the terms of the Treaty of Thronehold, Kaius sealed most of Karrnath's undead in deep vaults, and the Order of the Emerald Claw was disbanded. A few bone knights remained in service to the crown, but most were cast aside—still bound to their bonecraft armor and still convinced of Karrnathi supremacy. These bone knights felt that Kaius had betrayed both them and their nation, leading their once-proud order to find a new purpose in the service of Lady Illmarrow.\nSource: Eberron: Rising from the Last War p. 316"
}