{
  "name": "Bronze Golem",
  "size": "L",
  "type": "construct (golem)",
  "alignment": "Unaligned",
  "ac": "13 (natural armor)",
  "hp": "57 (6d10+24)",
  "speed": "walk 30 ft.",
  "str": "17",
  "dex": "6",
  "con": "18",
  "int": "1",
  "wis": "10",
  "cha": "1",
  "skill": "Perception +4",
  "passive": "14",
  "languages": "Understands the languages of its creator but can't speak",
  "cr": "3",
  "resist": "fire; bludgeoning, piercing, slashing from nonmagical weapons",
  "immune": "poison, psychic",
  "conditionImmune": "charmed, exhaustion, frightened, paralyzed, petrified, poisoned",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Boiling Body",
      "text": [
        "The golem's body is hot to the touch, thanks to the boiler inside its chest. A creature that touches the golem or hits it with a melee attack while within 5 feet of it takes 5 (1d10) fire damage."
      ]
    },
    {
      "name": "Immutable Form",
      "text": [
        "The golem is immune to any spell or effect that would alter its form."
      ]
    },
    {
      "name": "Magic Resistance",
      "text": [
        "The golem has advantage on saving throws against spells and other magical effects."
      ]
    },
    {
      "name": "Magic Weapons",
      "text": [
        "The golem's weapon attacks are magical."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The golem makes two slam attacks."
      ]
    },
    {
      "name": "Slam",
      "text": [
        "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 7 (1d8 + 3) bludgeoning damage and, if the target is a Medium or smaller creature, it is grappled (escape DC 13). The golem can only grapple one creature at a time."
      ],
      "attack": [
        "Slam|5|1d8+3"
      ]
    },
    {
      "name": "Brazen Bull",
      "text": [
        "The golem makes a slam attack against a target it is grappling as it opens a plate in its chest and exposes its arcane boiler. If the attack hits, the target is forced into the golem's boiler, and the grapple ends. While inside the boiler, the target is blinded and restrained, it has total cover against attacks and other effects outside the boiler, and it takes 14 (4d6) fire damage at the start of each of its turns. To escape, it or another creature must succeed on a DC 13 Strength (Athletics) check to open the boiler, freeing the target, which falls prone in a space within 5 feet of the golem. A bronze golem can only have one creature in its boiler at a time."
      ]
    }
  ],
  "description": "Source: CCodex (3pp)"
}