{
  "name": "Burney the Barber",
  "size": "G",
  "type": "dragon",
  "alignment": "Chaotic Good",
  "ac": "21 (natural armor)",
  "hp": "350 (20d20+140)",
  "speed": "walk 40 ft., climb 40 ft., fly 80 ft.",
  "str": "27",
  "dex": "12",
  "con": "25",
  "int": "20",
  "wis": "17",
  "cha": "19",
  "save": "Dex +8, Con +14, Wis +10, Cha +11",
  "skill": "Deception +11, Perception +17, Stealth +8",
  "passive": "27",
  "languages": "Common, Draconic",
  "cr": "21",
  "immune": "acid",
  "senses": "blindsight 60 ft., darkvision 120 ft.",
  "trait": [
    {
      "name": "Legendary Resistance (3/Day)",
      "text": [
        "If Burney fails a saving throw, it can choose to succeed instead."
      ]
    },
    {
      "name": "Healer",
      "text": [
        "Burney has the benefits of the healer feat as well as proficiency with both the healer's kit and the herbalism kit."
      ]
    },
    {
      "name": "Bahamut's Blessings",
      "text": [
        "Burney has received several blessings in her service to Bahamut:",
        "• Unless Burney decided otherwise, once any creature less powerful than a deity has taken three steps from her, they can no longer remember her or having interacted with her specifically.",
        "• Burney is under the effect of a permanent mind blank spell, and cannot be detected by magical or mundane means unless she wishes it. In exchange for this blessing, Burney can take no direct action against the denizens of the Nine Hells, though she can certainly enlist the help of those who can.",
        "• Burney always knows the location of the Wandering Emporium and can transport herself there as though by a word of recall spell. This explains why Burney simply seems to appear amid the fully deployed marketplace each morning it is active to provide service and tell stories.",
        "• Once each day, when Burney so desires, she can instantly transport herself to the court of Bahamut via a powerful blessing akin to the plane shift spell."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "Burney can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."
      ]
    },
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +15 to hit, reach 15 ft., one target. 19 (2d10 + 8) piercing damage."
      ],
      "attack": [
        "Bite|+15|2d10+8"
      ]
    },
    {
      "name": "Claw",
      "text": [
        "Melee Weapon Attack: +15 to hit, reach 10 ft., one target. 15 (2d6 + 8) slashing damage."
      ],
      "attack": [
        "Claw|+15|2d6+8"
      ]
    },
    {
      "name": "Tail",
      "text": [
        "Melee Weapon Attack: +15 to hit, reach 20 ft., one target. 17 (2d8 + 8) bludgeoning damage."
      ],
      "attack": [
        "Tail|+15|2d8+8"
      ]
    },
    {
      "name": "Frightful Presence",
      "text": [
        "Each creature of Burney's choice that is within 120 feet of Burney and aware of it must succeed on a DC 19 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to Burney's Frightful Presence for the next 24 hours."
      ]
    },
    {
      "name": "Breath Weapons (Recharge 5-6)",
      "text": [
        "Burney uses one of the following breath weapons.",
        "• Acid Breath. Burney exhales acid in a 90-foot line that is 10 feet wide. Each creature in that line must make a DC 22 Dexterity saving throw, taking 63 (14d8) acid damage on a failed save, or half as much damage on a successful one.",
        "• Slowing Breath. Burney exhales gas in a 90-foot cone. Each creature in that area must succeed on a DC 22 Constitution saving throw. On a failed save, the creature can't use reactions, its speed is halved, and it can't make more than one attack on its turn. In addition, the creature can use either an action or a bonus action on its turn, but not both. These effects last for 1 minute. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself with a successful save."
      ],
      "attack": [
        "Breath Weapons (Recharge 5-6)||14d8"
      ]
    },
    {
      "name": "Change Shape",
      "text": [
        "Burney magically polymorphs into a humanoid or beast that has a challenge rating no higher than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (Burney's choice).",
        "In a new form, Burney retains its alignment, hit points, Hit Dice, ability to speak, proficiencies, Legendary Resistance, lair actions, and Intelligence, Wisdom, and Charisma scores, as well as this action. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form."
      ]
    }
  ],
  "legendary": [
    {
      "text": [
        "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn."
      ]
    },
    {
      "name": "Detect",
      "text": [
        "Burney makes a Wisdom (Perception) check."
      ]
    },
    {
      "name": "Tail Attack",
      "text": [
        "Burney makes a tail attack."
      ]
    },
    {
      "name": "Wing Attack (Costs 2 Actions)",
      "text": [
        "Burney beats its wings. Each creature within 15 feet of Burney must succeed on a DC 23 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. Burney can then fly up to half its flying speed."
      ]
    },
    {
      "name": "Lair Actions"
    },
    {
      "text": [
        "On initiative count 20 (losing initiative ties), the dragon takes a lair action to cause one of the following effects:",
        "• The dragon chooses a point on the ground that it can see within 120 feet of it. Stone spikes sprout from the ground in a 20-foot radius centered on that point. The effect is otherwise identical to the spike growth spell and lasts until the dragon uses this lair action again or until the dragon dies.",
        "• The dragon chooses a 10-foot-square area on the ground that it can see within 120 feet of it. The ground in that area turns into 3-foot-deep mud. Each creature on the ground in that area when the mud appears must succeed on a DC 15 Dexterity saving throw or sink into the mud and become restrained. A creature can take an action to attempt a DC 15 Strength check, freeing itself or another creature within its reach and ending the restrained condition on a success. Moving 1 foot in the mud costs 2 feet of movement. On initiative count 20 on the next round, the mud hardens, and the Strength DC to work free increases to 20."
      ]
    },
    {
      "name": "Regional Effects"
    },
    {
      "text": [
        "The region containing a legendary copper dragon's lair is warped by the dragon's magic, which creates one or more of the following effects:",
        "• Magic carvings of the dragon's smiling visage can be seen worked into stone terrain and objects within 6 miles of the dragon's lair.",
        "• Tiny beasts such as rodents and birds that are normally unable to speak gain the magical ability to speak and understand Draconic while within 1 mile of the dragon's lair. These creatures speak well of the dragon, but can't divulge its whereabouts.",
        "• Intelligent creatures within 1 mile of the dragon's lair are prone to fits of giggling. Even serious matters suddenly seem amusing.",
        "If the dragon dies, the magic carvings fade over the course of 1d10 days. The other effects end immediately."
      ]
    }
  ],
  "description": "\nSource: Baldur's Gate: Descent Into Avernus p. 129",
  "environment": "hill"
}