{
  "name": "Cadaver Collector",
  "size": "L",
  "type": "construct",
  "alignment": "Lawful Evil",
  "ac": "17 (natural armor)",
  "hp": "189 (18d10+90)",
  "speed": "walk 30 ft.",
  "str": "21",
  "dex": "14",
  "con": "20",
  "int": "5",
  "wis": "11",
  "cha": "8",
  "passive": "10",
  "languages": "understands all languages but can't speak",
  "cr": "14",
  "immune": "necrotic, poison, psychic; bludgeoning, piercing, slashing from nonmagical attacks that aren't adamantine",
  "conditionImmune": "charmed, exhaustion, frightened, paralyzed, petrified, poisoned",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Magic Resistance",
      "text": [
        "The cadaver collector has advantage on saving throws against spells and other magical effects."
      ]
    },
    {
      "name": "Summon Specters (Recharges after a Short or Long Rest)",
      "text": [
        "As a bonus action, the cadaver collector calls up the enslaved spirits of those it has slain; 1d6 specter (without Sunlight Sensitivity) arise in unoccupied spaces within 15 feet of the cadaver collector. The specters act right after the cadaver collector on the same initiative count and fight until they're destroyed. They disappear when the cadaver collector is destroyed."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The cadaver collector makes two slam attacks."
      ]
    },
    {
      "name": "Slam",
      "text": [
        "Melee Weapon Attack: +10 to hit, reach 5 ft., one target. 18 (3d8 + 5) bludgeoning damage plus 16 (3d10) necrotic damage."
      ],
      "attack": [
        "Slam|+10|3d8+5"
      ]
    },
    {
      "name": "Paralyzing Breath (Recharge 5-6)",
      "text": [
        "The cadaver collector releases paralyzing gas in a 30-foot cone. Each creature in that area must make a successful DC 18 Constitution saving throw or be paralyzed for 1 minute. A paralyzed creature repeats the saving throw at the end of each of its turns, ending the effect on itself with a success."
      ]
    }
  ],
  "description": "\nCadaver collectors cannot summon specters of those they have not slain, nor will slain specters return to one. Starve it of victims, and then do not attack until you can be sure you'll destroy it. Meteor swarm works well.\n — Mordenkainen\n\nCadaver Collector. The ancient war machines known as cadaver collectors lumber aimlessly across the blasted plains of Acheron until they are called upon by a necromancer, hobgoblin general, or other evil warlord to bolster the ranks of a conquering army. These fearsome constructs obey their summoners until being dismissed back to Acheron, but if a summoner comes to a bad end, a cadaver collector might wander the Material Plane for centuries, collecting corpses while searching for a way to return home.\nSweeping the Dead. Cadaver collectors respond to a summons from a mortal only when they are called to the scene of a great battle—either where one is in progress, where one is imminent, or where one once took place. They encase themselves in the armor and weapons of fallen warriors and impale the corpses of those warriors on the lances and other weapons embedded in their salvaged armor.\nConjured Berserkers. Corpses that accumulate on the construct's shell aren't just grisly battle trophies. A cadaver collector can summon the spirits of these cadavers to join battle with its enemies and to paralyze more creatures for eventual impalement. Although these specters are individually weak, a cadaver collector can call up an almost endless supply of them, if given time.\nConstructed Nature. A cadaver collector doesn't require air, food, drink, or sleep.\nSource: Mordenkainen's Tome of Foes p. 122",
  "environment": "grassland"
}