{
  "name": "Cauldronborn",
  "size": "S",
  "type": "construct",
  "alignment": "Unaligned",
  "ac": "13 (natural armor)",
  "hp": "13 (3d6+3)",
  "speed": "walk 20 ft.",
  "str": "14",
  "dex": "7",
  "con": "12",
  "int": "3",
  "wis": "1",
  "cha": "6",
  "passive": "5",
  "cr": "2",
  "resist": "piercing, slashing from nonmagical weapons that aren't adamantine",
  "immune": "poison",
  "conditionImmune": "charmed, exhaustion, frightened, paralyzed, petrified, poisoned",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Consumption",
      "text": [
        "As a bonus action, a cauldronborn can consume one potion within 5 feet of it that is not being worn or carried.",
        "Along with the potion's effect, the cauldronborn's hp maximum increases by 3 (1d6) and it gains the same number of hp."
      ]
    },
    {
      "name": "Detect Elixir",
      "text": [
        "The cauldronborn can pinpoint the location of potions and magic items within 60 feet of it. Outside of 60 feet, it can sense the general direction of potions within 1 mile of it."
      ]
    },
    {
      "name": "Regeneration",
      "text": [
        "The cauldronborn regains 2 hp at the start of its turn if it has at least 1 hp."
      ]
    },
    {
      "name": "Sprint",
      "text": [
        "The cauldronborn triples its speed until the end of its turn when moving toward a potion it has detected."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The cauldronborn makes two slam attacks."
      ]
    },
    {
      "name": "Slam",
      "text": [
        "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 7 (2d4 + 2) bludgeoning damage."
      ],
      "attack": [
        "Slam|4|2d4+2"
      ]
    },
    {
      "name": "Call Potion (Recharge 5-6)",
      "text": [
        "The cauldronborn releases a hungry screech, magically reaching out to nearby potions. All potions within 10 feet of the cauldronborn magically move toward the cauldronborn by rolling out of backpacks, hopping off of belts, unburying themselves, etc. A creature wearing or carrying a potion must succeed on a DC 13 Dexterity saving throw or its potion moves to within 5 feet of the cauldronborn. The target must make a separate saving throw for each potion it is attempting to keep in its possession."
      ]
    }
  ],
  "description": "Source: CCodex (3pp)"
}