{
  "name": "Cloud Giant Smiling One",
  "size": "H",
  "type": "giant (cloud giant)",
  "alignment": "Chaotic Neutral",
  "ac": "15 (natural armor)",
  "hp": "262 (21d12+128)",
  "speed": "walk 40 ft.",
  "str": "26",
  "dex": "12",
  "con": "22",
  "int": "15",
  "wis": "16",
  "cha": "17",
  "save": "Con +10, Int +6, Wis +7",
  "skill": "Deception +11, Insight +7, Perception +7, Sleight of hand +9",
  "passive": "17",
  "languages": "Common, Giant",
  "cr": "11",
  "trait": [
    {
      "name": "Keen Smell",
      "text": [
        "The giant has advantage on Wisdom (Perception) checks that rely on smell."
      ]
    },
    {
      "name": "Innate Spellcasting",
      "text": [
        "The giant's innate spellcasting ability is Charisma (spell save DC 15). It can innately cast the following spells, requiring no material components:",
        "At will: detect magic, fog cloud, light",
        "3/day each: feather fall, fly, misty step, telekinesis",
        "1/day each: control weather, gaseous form"
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "The giant is a 5th-level spellcaster. Its spellcasting ability is Charisma (spell save DC 15, +7 to hit with spell attacks). The giant has the following bard spells prepared:",
        "Cantrips (at will): minor illusion, prestidigitation, vicious mockery",
        "• 1st level (4 slots): cure wounds, disguise self, silent image, Tasha's hideous laughter",
        "• 2nd level (3 slots): invisibility, suggestion",
        "• 3rd level (2 slots): major image, tongues"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The giant makes two attacks with its morningstar."
      ]
    },
    {
      "name": "Morningstar",
      "text": [
        "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. 21 (3d8 + 8) bludgeoning damage. The attack deals an extra 14 (4d6) damage if the giant has advantage on the attack roll."
      ],
      "attack": [
        "Morningstar|+12|3d8+8"
      ]
    },
    {
      "name": "Rock",
      "text": [
        "Ranged Weapon Attack: +12 to hit, range 60/240 ft., one target. 30 (4d10 + 8) bludgeoning damage. The attack deals an extra 14 (4d6) damage if the giant has advantage on the attack roll."
      ],
      "attack": [
        "Rock|+12|4d10+8"
      ]
    },
    {
      "name": "Change Shape",
      "text": [
        "The giant magically polymorphs into a beast or humanoid it has seen, or back into its true form. Any equipment the giant is wearing or carrying is absorbed by the new form. Its statistics, other than its size, are the same in each form. It reverts to its true form if it dies."
      ]
    }
  ],
  "slots": [
    "4, 3, 2"
  ],
  "spells": "detect magic, fog cloud, light, feather fall, fly, misty step, telekinesis, control weather, gaseous form, minor illusion, prestidigitation, vicious mockery, cure wounds, disguise self, silent image, Tasha's hideous laughter, invisibility, suggestion, major image, tongues",
  "description": "Cloud giants aren't, on the whole, religious. They tolerate many conflicting ideas about their patron deity, Memnor. The smiling ones strain that tolerance.\nSmiling ones are cloud giants who honor and emulate Memnor's craftiness and deceit above all else. They are tricksters supreme who use sleight of hand, deception, misdirection, and magic in their pursuit of wealth. They also possess a flair for unpredictability and a wicked sense of humor.\nWhile cloud giants expect a certain amount of trickery and deceit in their dealings with others of their kind, smiling ones overstep the bounds of decorum with their behavior, doing and saying things that nobler cloud giants consider beneath the dignity of their kind.\nMysterious Masks.  Smiling ones take their name from the strange two-faced masks they wear. The smiling half of the face often looks more like a smirk or a triumphant sneer than a pleasant grin. The frowning half represents the displeasure smiling ones feel about their place in the ordning-second to the storm giants. The masks serve as symbols of their devotion, but they also conceal their wearers' true facial expressions.\nSource: Volo's Guide to Monsters p. 146",
  "environment": "mountain"
}