{
  "name": "Count Thullen",
  "size": "H",
  "type": "giant",
  "alignment": "Neutral Good (50%) Neutral Evil (50%)",
  "ac": "14 (natural armor)",
  "hp": "200 (16d12+96)",
  "speed": "walk 40 ft.",
  "str": "27",
  "dex": "10",
  "con": "22",
  "int": "12",
  "wis": "16",
  "cha": "16",
  "save": "Con +10, Wis +7, Cha +7",
  "skill": "Insight +7, Perception +7",
  "passive": "17",
  "languages": "Common, Giant",
  "cr": "9",
  "trait": [
    {
      "name": "Keen Smell",
      "text": [
        "Thullen has advantage on Wisdom (Perception) checks that rely on smell."
      ]
    },
    {
      "name": "Innate Spellcasting",
      "text": [
        "Thullen's innate spellcasting ability is Charisma. It can innately cast the following spells, requiring no material components:",
        "At will: detect magic, fog cloud, light",
        "3/day each: feather fall, fly, misty step, telekinesis",
        "1/day each: control weather, gaseous form"
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "Thullen is a 9th-level spellcaster. His spellcasting ability is Wisdom (spell save DC 15, +7 to hit with spell attacks). He has the following druid spells prepared:",
        "Cantrips (at will): druidcraft, mending, produce flame",
        "• 1st level (4 slots): cure wounds, entangle, thunderwave",
        "• 2nd level (3 slots): animal messenger, barkskin, gust of wind",
        "• 3rd level (3 slots): call lightning, conjure animals, speak with plants",
        "• 4th level (3 slots): freedom of movement, grasping vine",
        "• 5th level (1 slots): conjure elemental"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "Thullen makes two morningstar attacks."
      ]
    },
    {
      "name": "Morningstar",
      "text": [
        "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. 21 (3d8 + 8) piercing damage."
      ],
      "attack": [
        "Morningstar|+12|3d8+8"
      ]
    },
    {
      "name": "Rock",
      "text": [
        "Ranged Weapon Attack: +12 to hit, range 60/240 ft., one target. 30 (4d10 + 8) bludgeoning damage."
      ],
      "attack": [
        "Rock|+12|4d10+8"
      ]
    },
    {
      "name": "Variant: New Giant Options",
      "text": [
        "Some adult cloud giants have the magical ability to create barriers of gale-force wind around themselves that can deflect incoming missiles. Others like to fling enemies through the air. These abilities are represented by the following action options.",
        "Fling. Thullen tries to throw a Small or Medium creature within 10 feet of it. The target must succeed on a DC 20 Dexterity saving throw or be hurled up to 60 feet horizontally in a direction of Thullen's choice and land prone, taking 4 (1d8) bludgeoning damage for every 10 feet it was thrown.",
        "Wind Aura. A magical aura of wind surrounds Thullen. The aura is a 10-foot-radius sphere that lasts as long as Thullen maintains concentration on it (as if concentrating on a spell). While the aura is in effect, Thullen gains a +2 bonus to its AC against ranged weapon attacks, and all open flames within the aura are extinguished unless they are magical."
      ]
    }
  ],
  "slots": [
    "4, 3, 3, 3, 1"
  ],
  "spells": "detect magic, fog cloud, light, feather fall, fly, misty step, telekinesis, control weather, gaseous form, druidcraft, mending, produce flame, cure wounds, entangle, thunderwave, animal messenger, barkskin, gust of wind, call lightning, conjure animals, speak with plants, freedom of movement, grasping vine, conjure elemental",
  "description": "\nSource: Storm King's Thunder p. 198",
  "environment": "mountain"
}