{
  "name": "Cyclops",
  "size": "H",
  "type": "giant",
  "alignment": "Chaotic Neutral",
  "ac": "14 (natural armor)",
  "hp": "138 (12d12+60)",
  "speed": "walk 30 ft.",
  "str": "22",
  "dex": "11",
  "con": "20",
  "int": "8",
  "wis": "6",
  "cha": "10",
  "passive": "8",
  "languages": "Giant",
  "cr": "6",
  "trait": [
    {
      "name": "Poor Depth Perception",
      "text": [
        "The cyclops has disadvantage on any attack roll against a target more than 30 feet away."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The cyclops makes two greatclub attacks."
      ]
    },
    {
      "name": "Greatclub",
      "text": [
        "Melee Weapon Attack: +9 to hit, reach 10 ft., one target. 19 (3d8 + 6) bludgeoning damage."
      ],
      "attack": [
        "Greatclub|+9|3d8+6"
      ]
    },
    {
      "name": "Rock",
      "text": [
        "Ranged Weapon Attack: +9 to hit, range 30/120 ft., one target. 28 (4d10 + 6) bludgeoning damage."
      ],
      "attack": [
        "Rock|+9|4d10+6"
      ]
    }
  ],
  "description": "Cyclopes are one-eyed giants that eke out a meager existence in wild lands. Isolationists by nature, they avoid contact with other races and try to drive away strangers in their territory.\nNonreligious. Legends claim that the cyclopes are the spawn of one of the gods of the giants, but these creatures pay little heed to any deities. They see little benefit in prayer and dislike ritual, which they perceive as complex and foreign. However, a cyclops that gains direct benefit from some site of divine power, or which is threatened by a supernatural force or creature, will pay homage as long as the benefit or threat remains.\nUnsophisticated. Though they are reasonably intelligent, cyclopes live simple, reclusive lives, keeping herds of animals for food. They prefer to dwell alone or in small family groups, lairing in caves, ruins, or rough structures of dry stone construction they build themselves. A cyclops keeps its herd animals with it at night, sealing the entrance to its home with boulders to let it serve double duty as a barn.\nA cyclops lairs within a day's journey of other cyclopes, so that they can meet to trade goods or seek mates. They craft weapons and tools of wood and stone, but will use metal when they can find it. Although cyclopes understand the Giant tongue, they write nothing and speak little, using grunts and gestures for their interactions with each other. Cyclopes don't use money for trade, but they value gold, shells, and other glittering and colorful objects as jewelry. A cyclops might wear a necklace strung with feathers and silver coins, but also with pewter goblets, cutlery, and other bits of ruined metal.\nUnwise. Cyclopes aren't great thinkers or strategists. Slow to learn and bound to their traditional ways, they find innovation difficult. Although they are a terrifying threat in combat due to their size and strength, they can often be tricked by clever foes. Cyclopes can be cowed and awed by obvious displays of magic. Rustics with little exposure to magic, they can be deceived into mistaking a warlock, cleric, or other caster for a powerful divine figure. However, their sense of pride causes them to react with vengeful, bloodthirsty violence once they learn that the individual they assumed was a \"god\" is a mere mortal.\nSource: Monster Manual p. 45, Rise of Tiamat, Tomb of Annihilation, Ghosts of Saltmarsh, Explorer's Guide to Wildemount, Mythic Odysseys of Theros",
  "environment": "underdark, mountain, grassland, hill, desert, coastal"
}