{
  "name": "Darkling Elder",
  "size": "M",
  "type": "fey",
  "alignment": "Chaotic Neutral",
  "ac": "15 (studded leather armor)",
  "hp": "27 (5d8+5)",
  "speed": "walk 30 ft.",
  "str": "13",
  "dex": "17",
  "con": "12",
  "int": "10",
  "wis": "14",
  "cha": "13",
  "skill": "Acrobatics +5, Deception +3, Perception +6, Stealth +7",
  "passive": "16",
  "languages": "Elvish, Sylvan",
  "cr": "2",
  "senses": "blindsight 30 ft., darkvision 120 ft.",
  "trait": [
    {
      "name": "Death Burn",
      "text": [
        "When the darkling elder dies, magical light flashes out from it in a 10-foot radius as its body and possessions, other than metal or magic objects, burn to ash. Any creature in that area must make a DC 11 Constitution saving throw. On a failure, the creature takes 7 (2d6) radiant damage and, if the creature can see the light, is blinded until the end of its next turn. If the saving throw is successful, the creature takes half the damage and isn't blinded."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The darkling elder makes two melee attacks."
      ]
    },
    {
      "name": "Shortsword",
      "text": [
        "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 6 (1d6 + 3) piercing damage. If the darkling elder had advantage on the attack roll, the attack deals as: extra 10 (3d6) piercing damage."
      ],
      "attack": [
        "Shortsword|+5|1d6+3"
      ]
    },
    {
      "name": "Darkness (Recharges after a Short or Long Rest)",
      "text": [
        "The darkling elder casts darkness without any components. Wisdom is its spellcasting ability."
      ]
    }
  ],
  "description": "Ancient legends speak of a seelie fey who betrayed the Summer Queen. His true name has been stricken from history, but the stories call him Dubh Catha (\"Dark Crow\" in Common). So great was the Summer Queen's wrath that she cursed every member of his house. Other fey refer to the descendants of Dubh Catha's house as the dubh sith-or, in Common, \"darklings.\" Darklings most often settle in secluded caverns and chambers beneath the towns of other species. From such enclaves, they quietly ply their trade as thieves and assassins.\nThe Killing Light.  The Summer Queen's curse causes a darkling's body to absorb light, and doing so wizens the creature, much like the effect of rapid aging. For this reason, darklings cover every part of their body with clothing when exposure to light is a risk. The light a darkling absorbs over the course of its lifetime explodes outward when the darkling dies, incinerating the creature and much of its possessions.\nLove of Art.  Despite their curse, darklings retain a fondness for the beauty of art. A darkling might risk taking a peek at a sunset or lighting a tiny candle to glimpse the colors in a painting or a jewel.\nElder Transformation.  A wise and respected darkling can qualify to undergo a ritual to become an elder. Other elders mark the supplicant with glowing tattoos, channeling some of the darkling's absorbed light away from its body. If the ritual succeeds, the darkling grows into a tall and fair form, like that of a gray-skinned elf. The darkling perishes if the ritual fails.\nSource: Volo's Guide to Monsters p. 134",
  "environment": "underdark, forest, swamp, urban"
}