{
  "name": "Dark Father",
  "size": "L",
  "type": "undead",
  "alignment": "Lawful Neutral",
  "ac": "18 (natural armor)",
  "hp": "65 (10d8+18)",
  "speed": "walk 40 ft., fly 20 ft.",
  "str": "6",
  "dex": "14",
  "con": "15",
  "int": "8",
  "wis": "14",
  "cha": "8",
  "skill": "Stealth +4",
  "passive": "12",
  "languages": "The languages it knew in life",
  "cr": "4",
  "resist": "bludgeoning, piercing, slashing from nonmagical weapons",
  "immune": "necrotic, poison",
  "conditionImmune": "exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Death Waits",
      "text": [
        "The dark father has disadvantage on melee attack rolls against any creature that has all of its hp."
      ]
    },
    {
      "name": "Incorporeal Movement",
      "text": [
        "The dark father can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."
      ]
    },
    {
      "name": "None May Stop Death",
      "text": [
        "When a creature within 30 feet of a dark father regains hp through any means other than resting, it must succeed on a DC 14 Constitution saving throw or take 3 (1d6) necrotic damage and have disadvantage on its next death saving throw."
      ]
    }
  ],
  "action": [
    {
      "name": "Life Drain",
      "text": [
        "Melee Spell Attack. +4 to hit, reach 5 ft., one creature. 14 (4d6) necrotic damage. The target must succeed on a DC 14 Constitution saving throw or its hp maximum is reduced by an amount equal to the damage taken. This reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hp maximum to 0."
      ],
      "attack": [
        "Life Drain|4|4d6"
      ]
    },
    {
      "name": "Final Curtain",
      "text": [
        "The dark father targets a corpse it can see within 30 feet that has been dead for no longer than 1 hour. A stream of dark energy flows between the corpse and the dark father. At the end of the dark father's next turn, the dark father absorbs the corpse and it vanishes completely. Any worn items or possessions are unaffected. A corpse destroyed in this manner can't be retrieved other than by a wish spell or similar magic."
      ]
    }
  ],
  "reaction": [
    {
      "name": "Banish Hope",
      "text": [
        "When a spell from the evocation or necromancy school is cast within 30 feet of the dark father, the dark father can counter the spell with a successful ability check. This works like the counterspell spell with a +5 spellcasting ability check, except the dark father must make the ability check no matter the level of the spell."
      ]
    }
  ],
  "description": "Source: CCodex (3pp)"
}