{
  "name": "Deformed Duergar",
  "size": "M",
  "type": "humanoid (dwarf)",
  "alignment": "Lawful Evil",
  "ac": "16 (scale mail, shield)",
  "hp": "40 (4d8+4)",
  "speed": "walk 25 ft.",
  "str": "14",
  "dex": "11",
  "con": "14",
  "int": "11",
  "wis": "10",
  "cha": "9",
  "passive": "10",
  "languages": "Dwarvish, Undercommon",
  "cr": "1",
  "resist": "poison",
  "senses": "darkvision 120 ft.",
  "trait": [
    {
      "name": "Third Arm",
      "text": [
        "The duergar can make an attack with its javelin as a bonus action."
      ]
    },
    {
      "name": "Merged Heads",
      "text": [
        "The duergar has advantage on Wisdom (Perception) checks and on saving throws against being charmed, frightened, stunned, and knocked unconscious."
      ]
    },
    {
      "name": "Duergar Resilience",
      "text": [
        "The duergar has advantage on saving throws against poison, spells, and illusions, as well as to resist being charmed or paralyzed."
      ]
    },
    {
      "name": "Sunlight Sensitivity",
      "text": [
        "While in sunlight, the duergar has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
      ]
    }
  ],
  "action": [
    {
      "name": "Enlarge (Recharges after a Short or Long Rest)",
      "text": [
        "For 1 minute, the duergar magically increases in size, along with anything it is wearing or carrying. While enlarged, the duergar is Large, doubles its damage dice on Strength-based weapon attacks (included in the attacks), and makes Strength checks and Strength saving throws with advantage. If the duergar lacks the room to become Large, it attains the maximum size possible in the space available."
      ]
    },
    {
      "name": "War Pick",
      "text": [
        "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 6 (1d8 + 2) piercing damage, or 11 (2d8 + 2) piercing damage while enlarged."
      ],
      "attack": [
        "War Pick|+4|1d8+2"
      ]
    },
    {
      "name": "Javelin",
      "text": [
        "Melee or Ranged Weapon Attack: +4 to hit, reach 5 ft. or range 30/120 ft., one target. 5 (1d6 + 2) piercing damage, or 9 (2d6 + 2) piercing damage while enlarged."
      ],
      "attack": [
        "Javelin|+4|1d6+2"
      ]
    },
    {
      "name": "Invisibility (Recharges after a Short or Long Rest)",
      "text": [
        "The duergar magically turns invisible until it attacks, casts a spell, or uses its Enlarge, or until its concentration is broken, up to 1 hour (as if concentrating on a spell). Any equipment the duergar wears or carries is invisible with it."
      ]
    }
  ],
  "description": "\nSource: Waterdeep: Dungeon of the Mad Mage p. 180",
  "environment": "underdark"
}