{
  "name": "Doomspeaker (Midgard Version)",
  "size": "M",
  "type": "humanoid (any race)",
  "alignment": "Chaotic Evil",
  "ac": "15 (shield)",
  "hp": "78 (12d8+24)",
  "speed": "walk 30 ft.",
  "str": "12",
  "dex": "17",
  "con": "15",
  "int": "10",
  "wis": "12",
  "cha": "18",
  "save": "Con +5, Wis +4",
  "skill": "Religion +6",
  "passive": "11",
  "cr": "6",
  "resist": "necrotic",
  "trait": [
    {
      "name": "Aura Of The Funeral Feast",
      "text": [
        "The doomspeaker gains 10 (3d6) temporary hp whenever a creature dies within 10 feet of it."
      ]
    },
    {
      "name": "Pervasive Unholy Smite",
      "text": [
        "Whenever the doomspeaker deals damage with a melee weapon attack, the target takes an extra 9 (2d8) necrotic damage (included in the attack). This damage increases to 13 (3d8) if the target is a celestial, a good-aligned dragon, or a fey."
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "The doomspeaker (midgard version) is a 12th-level spellcaster. Its spellcasting ability is Charisma (spell save DC 15, +7 to hit with spell attacks). The doomspeaker (midgard version) has the following Paladin spells prepared:",
        "• 1st level (4 slots): bane, bloody smite*, doom of the cracked shield*, memento mori*",
        "• 2nd level (3 slots): bloodshot*, caustic blood*, magic weapon",
        "• 3rd level (0 slots): blood armor*, conjure undead*, dispel magic"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The doomspeaker makes two shortsword attacks."
      ]
    },
    {
      "name": "Shortsword",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 6 (1d6 + 3) piercing damage plus 9 (2d8) necrotic damage."
      ],
      "attack": [
        "Shortsword|6|1d6+3"
      ]
    },
    {
      "name": "Variant: Doomspeakers in Midgard",
      "text": [
        "In the Southlands, doomspeakers recruit many of the gnolls of the Sarkland Desert to their cause. The gnolls are drawn by the doomspeakers' strength and the thought of easy conquest. Doomspeakers have a hidden complex in the south that serves as their main base of operations and the resting place of the Book of Nine Dooms, a book containing magic that uses raw, violent emotion as fuel. They also maintain a presence on the Rothenian Plain, both in caves under Demon Mountain by permission of its Master and in the forests north of the plain. When using the Midgard setting, change the doomspeaker's spells to the following (see \"Fifth Edition Appendix\" in the Midgard Worldbook)",
        "1st level (4 slots): bane, bloody smite, doom of the cracked shield, memento mori\n2nd level (3 slots): bloodshot, caustic blood, magic weapon\n3rd level (3 slots): blood armor, conjure undead, dispel magic"
      ]
    }
  ],
  "slots": [
    "4, 3, 0"
  ],
  "spells": "bane, bloody smite, doom of the cracked shield, memento mori, bloodshot, caustic blood, magic weapon, blood armor, conjure undead, dispel magic",
  "description": "Source: CCodex (3pp) p. 399"
}