{
  "name": "Dream Squire",
  "size": "M",
  "type": "fey",
  "alignment": "Neutral",
  "ac": "15 (chain shirt)",
  "hp": "71 (13d8+13)",
  "speed": "walk 30 ft.",
  "str": "15",
  "dex": "14",
  "con": "12",
  "int": "10",
  "wis": "10",
  "cha": "8",
  "save": "Wis +2",
  "skill": "Athletics +4, Perception +2",
  "passive": "12",
  "languages": "Common",
  "cr": "2",
  "conditionImmune": "exhaustion",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Bound Devotion",
      "text": [
        "The dream squire has advantage on saving throws against being charmed or frightened. If an effect would cause the squire to take a harmful action against its master, it can immediately repeat the saving throw (if any), ending the effect on a success. The squire has disadvantage on attack rolls or ability checks made against its master."
      ]
    },
    {
      "name": "Master's Bond",
      "text": [
        "The dream squire is bound to serve another creature as its master. The squire obeys all the master's commands, and the master can communicate telepathically with the squire as long as they are on the same plane.",
        "A dispel evil and good spell's break enchantment option that targets a dream squire forces it to make a Wisdom saving throw.",
        "On a failure, the squire's bond with its master is broken, and it returns to its true form (use human guard statistics)."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The dream squire makes two melee attacks."
      ]
    },
    {
      "name": "Mace",
      "text": [
        "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit.",
        "5 (1d6 + 2) bludgeoning damage plus 3 (1d6) psychic damage."
      ]
    },
    {
      "name": "Light Crossbow",
      "text": [
        "Ranged Weapon Attack: +4 to hit, range 80/320 ft., one target. 6 (1d8 + 2) piercing damage plus 3 (1d6) psychic damage."
      ],
      "attack": [
        "Light Crossbow|4|1d8+2"
      ]
    }
  ],
  "reaction": [
    {
      "name": "For the Master",
      "text": [
        "When the dream squire's master is targeted by an attack or spell, the squire magically teleports to an unoccupied space within 5 feet of the master, and the attack or spell targets the squire instead. If the attack or spell deals damage, the dream squire takes half damage from it. To use this ability, the master and squire must be on the same plane."
      ]
    }
  ],
  "description": "Source: CCodex (3pp)"
}