{
  "name": "Drow Favored Consort",
  "size": "M",
  "type": "humanoid (elf)",
  "alignment": "Neutral Evil",
  "ac": "15 (18 with mage armor)",
  "hp": "225 (30d8+90)",
  "speed": "walk 30 ft.",
  "str": "15",
  "dex": "20",
  "con": "16",
  "int": "18",
  "wis": "15",
  "cha": "18",
  "save": "Dex +11, Con +9, Cha +10",
  "skill": "Acrobatics +11, Athletics +8, Perception +8, Stealth +11",
  "passive": "18",
  "languages": "Elvish, Undercommon",
  "cr": "18",
  "senses": "darkvision 120 ft.",
  "trait": [
    {
      "name": "Fey Ancestry",
      "text": [
        "The drow has advantage on saving throws against being charmed, and magic can't put the drow to sleep."
      ]
    },
    {
      "name": "Sunlight Sensitivity",
      "text": [
        "While in sunlight, the drow has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
      ]
    },
    {
      "name": "War Magic",
      "text": [
        "When the drow uses its action to cast a spell, it can make one weapon attack as a bonus action."
      ]
    },
    {
      "name": "Innate Spellcasting",
      "text": [
        "The drow's innate spellcasting ability is Charisma (spell save DC 18). It can innately cast the following spells, requiring no material components:",
        "At will: dancing lights",
        "1/day each: darkness, faerie fire, levitate (self only)"
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "The drow is a 11th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 18, +10 to hit with spell attacks). It has the following wizard spells prepared:",
        "Cantrips (at will): mage hand, message, poison spray, shocking grasp, ray of frost",
        "• 1st level (4 slots): burning hands, mage armor, magic missile, shield",
        "• 2nd level (3 slots): gust of wind, invisibility, misty step, shatter",
        "• 3rd level (3 slots): counterspell, fireball, haste",
        "• 4th level (3 slots): dimension door, Otiluke's resilient sphere",
        "• 5th level (2 slots): cone of cold",
        "• 6th level (1 slots): chain lightning"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The drow makes three scimitar attacks."
      ]
    },
    {
      "name": "Scimitar",
      "text": [
        "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. 8 (1d6 + 5) slashing damage plus 18 (4d8) poison damage. In addition, the target has disadvantage on the next saving throw it makes against a spell the drow casts before the end of the drow's next turn."
      ],
      "attack": [
        "Scimitar|+11|1d6+5"
      ]
    },
    {
      "name": "Hand Crossbow",
      "text": [
        "Ranged Weapon Attack: +11 to hit, range 30/120 ft., one target. 8 (1d6 + 5) piercing damage, and the target must succeed on a DC 13 Constitution saving throw or be poisoned for 1 hour. If the saving throw fails by 5 or more, the target is also unconscious while poisoned in this way. The target regains consciousness if it takes damage or if another creature takes an action to shake it."
      ],
      "attack": [
        "Hand Crossbow|+11|1d6+5"
      ]
    }
  ],
  "slots": "4, 3, 3, 3, 2, 1",
  "spells": "dancing lights, darkness, faerie fire, levitate, mage hand, message, poison spray, shocking grasp, ray of frost, burning hands, mage armor, magic missile, shield, gust of wind, invisibility, misty step, shatter, counterspell, fireball, haste, dimension door, Otiluke's resilient sphere, cone of cold, chain lightning",
  "description": "\nMany creatures enjoy torture, but the dark elves have made it into an exquisite art.\n — Mordenkainen\n\nDrow Favored Consort. Nearly all priestesses of Lolth, including the powerful matron mothers, take attractive drow as their consorts. Often these individuals serve no purpose beyond pleasure, breeding, or both, but sometimes consorts can gain the ear of their priestess and be relied on to provide useful advice. No position of consort is assured for long; priestesses are infamous for being fickle with their favor, which are they are especially glad to lavish on a consort who combines beauty with magical might.\nSource: Mordenkainen's Tome of Foes p. 183",
  "environment": "underdark"
}