{
  "name": "Drow Inquisitor",
  "size": "M",
  "type": "humanoid (elf)",
  "alignment": "Neutral Evil",
  "ac": "16 (breastplate)",
  "hp": "143 (22d8+44)",
  "speed": "walk 30 ft.",
  "str": "11",
  "dex": "15",
  "con": "14",
  "int": "16",
  "wis": "21",
  "cha": "20",
  "save": "Con +7, Wis +10, Cha +10",
  "skill": "Insight +10, Perception +10, Religion +8, Stealth +7",
  "passive": "20",
  "languages": "Elvish, Undercommon",
  "cr": "14",
  "conditionImmune": "frightened",
  "senses": "darkvision 120 ft.",
  "trait": [
    {
      "name": "Discern Lie",
      "text": [
        "The drow knows when she hears a creature speak a lie in a language she knows."
      ]
    },
    {
      "name": "Fey Ancestry",
      "text": [
        "The drow has advantage on saving throws against being charmed, and magic can't put the drow to sleep."
      ]
    },
    {
      "name": "Magic Resistance",
      "text": [
        "The drow has advantage on saving throws against spells and other magical effects."
      ]
    },
    {
      "name": "Sunlight Sensitivity",
      "text": [
        "While in sunlight, the drow has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
      ]
    },
    {
      "name": "Innate Spellcasting",
      "text": [
        "The drow's innate spellcasting ability is Charisma (spell save DC 18). She can innately cast the following spells, requiring no material components:",
        "At will: dancing lights, detect magic",
        "1/day each: clairvoyance, darkness, detect thoughts, dispel magic, faerie fire, levitate (self only), suggestion"
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "The drow is a 12th-level spellcaster. Her spellcasting ability is Wisdom (spell save DC 18, +10 to hit with spell attacks). She has the following cleric spells prepared:",
        "Cantrips (at will): guidance, message, poison spray, resistance, thaumaturgy",
        "• 1st level (4 slots): bane, cure wounds, inflict wounds",
        "• 2nd level (3 slots): blindness/deafness, silence, spiritual weapon",
        "• 3rd level (3 slots): bestow curse, dispel magic, magic circle",
        "• 4th level (3 slots): banishment, divination, freedom of movement",
        "• 5th level (2 slots): contagion, dispel evil and good, insect plague",
        "• 6th level (1 slots): harm, true seeing"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The drow makes three death lance attacks."
      ]
    },
    {
      "name": "Death Lance",
      "text": [
        "Melee Weapon Attack: +10 to hit, reach 5 ft., one target. 8 (1d6 + 5) piercing damage plus 18 (4d8) necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage it takes. This reduction lasts until the target finishes a long rest. The target dies if its hit point maximum is reduced to 0."
      ],
      "attack": [
        "Death Lance|+10|1d6+5"
      ]
    },
    {
      "name": "Variant: Demon Summoning",
      "text": [
        "Some drow inquisitors have an action that allows them to summon a demon.",
        "Summon Demon (1/Day). The drow attempts to magically summon a yochlol, with a 50 percent chance of success. If the attempt fails, the drow takes 5 (1d10) psychic damage. Otherwise, the summoned demon appears in an unoccupied space within 60 feet of its summoner, acts as an ally of its summoner, and can't summon other demons. It remains for 10 minutes, until it or its summoner dies, or until its summoner dismisses it as an action. (see notes for link)"
      ]
    }
  ],
  "slots": "4, 3, 3, 3, 2, 1",
  "spells": "dancing lights, detect magic, clairvoyance, darkness, detect thoughts, dispel magic, faerie fire, levitate, suggestion, guidance, message, poison spray, resistance, thaumaturgy, bane, cure wounds, inflict wounds, blindness/deafness, silence, spiritual weapon, bestow curse, dispel magic, magic circle, banishment, divination, freedom of movement, contagion, dispel evil and good, insect plague, harm, true seeing",
  "description": "\nDrow mages can be quite learned and skilled in magic. Some of them can even cast my spells.\n — Mordenkainen\n\nDrow Inquisitor. Drow expect treachery. After all, the Spider Queen encourages it. A certain amount of backstabbing and double-crossing can be managed, but too much can undermine an entire community. To keep some semblance of order and to root out traitors, drow priestesses employ inquisitors. Chosen from the ranks of the priesthood, these female drow possess authority equaled only by the matrons of the noble houses. Anyone they decide is at odds with the hierarchy faces torture and usually an excruciating death.\nSource: Mordenkainen's Tome of Foes p. 184",
  "environment": "underdark"
}