{
  "name": "Druid",
  "size": "M",
  "type": "humanoid (any race)",
  "alignment": "Any alignment",
  "ac": "11 (16 with barkskin)",
  "hp": "27 (5d8+5)",
  "speed": "walk 30 ft.",
  "str": "10",
  "dex": "12",
  "con": "13",
  "int": "12",
  "wis": "15",
  "cha": "11",
  "skill": "Medicine +4, Nature +3, Perception +4",
  "passive": "14",
  "languages": "Druidic plus any two languages",
  "cr": "2",
  "action": [
    {
      "name": "Quarterstaff",
      "text": [
        "Melee Weapon Attack: +2 to hit (+4 to hit with shillelagh), reach 5 ft., one target. 3 (1d6) bludgeoning damage, or 6 (1d8 + 2) bludgeoning damage with shillelagh or if wielded with two hands."
      ],
      "attack": [
        "Quarterstaff|+2|1d6"
      ]
    }
  ],
  "trait": [
    {
      "name": "Spellcasting",
      "text": [
        "The druid is a 4th-level spellcaster. Its spellcasting ability is Wisdom (spell save DC 12, +4 to hit with spell attacks). It has the following druid spells prepared:",
        "Cantrips (at will): druidcraft, produce flame, shillelagh",
        "• 1st level (4 slots): entangle, longstrider, speak with animals, thunderwave",
        "• 2nd level (3 slots): animal messenger, barkskin"
      ]
    }
  ],
  "slots": "4, 3",
  "spells": "druidcraft, produce flame, shillelagh, entangle, longstrider, speak with animals, thunderwave, animal messenger, barkskin",
  "description": "Druids dwell in forests and other secluded wilderness locations, where they protect the natural world from monsters and the encroachment of civilization. Some are tribal shamans who heal the sick, pray to animal spirits, and provide spiritual guidance.\nSource: Monster Manual p. 346, Curse of Strahd, Princes of the Apocalypse, Rise of Tiamat, Storm King's Thunder, Tomb of Annihilation, Ghosts of Saltmarsh, Essentials Kit: Dragon of Icespire Peak, Essentials Kit: Sleeping Dragon's Wake, Baldur's Gate: Descent Into Avernus, Explorer's Guide to Wildemount, Mythic Odysseys of Theros, Icewind Dale: Rime of the Frostmaiden"
}