{
  "name": "Dust Goblin Chieftain",
  "size": "S",
  "type": "humanoid (goblinoid)",
  "alignment": "Neutral Evil",
  "ac": "16 (studded leather armor)",
  "hp": "44 (8d6+16)",
  "speed": "walk 30 ft.",
  "str": "8",
  "dex": "18",
  "con": "15",
  "int": "14",
  "wis": "13",
  "cha": "13",
  "save": "Dex +7, Int +5",
  "skill": "Intimidation +3, Stealth +8, Survival +3",
  "passive": "11",
  "languages": "Common, Goblin",
  "cr": "3",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Alien Mind",
      "text": [
        "The dust goblin chieftain has advantage on saving throws against being charmed or frightened. In addition, it can use an action to read the surface thoughts of one creature within 30 feet.",
        "This works like the detect thoughts spell, except it can only read surface thoughts and there is no limit to the duration. The dust goblin chieftain can end this effect as a bonus action or by using an action to change the target."
      ]
    },
    {
      "name": "Cunning Action",
      "text": [
        "On each of its turns, the dust goblin chieftain can use a bonus action to take the Dash, Disengage, or Hide action."
      ]
    },
    {
      "name": "Sneak Attack (1/Turn)",
      "text": [
        "The dust goblin chieftain deals an extra 10 (3d6) damage when it hits a target with a weapon attack and has advantage on the attack roll, or when the target is within 5 feet of an ally of the dust goblin chieftain that isn't incapacitated and the chieftain doesn't have disadvantage on the attack roll."
      ]
    },
    {
      "name": "Twisted",
      "text": [
        "When the dust goblin chieftain attacks a creature from hiding, the target must succeed on a DC 13 Wisdom saving throw or be frightened until the end of its next turn."
      ]
    }
  ],
  "action": [
    {
      "name": "Shortsword",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 7 (1d6 + 4) piercing damage plus 4 (1d8) poison damage. The target must succeed on a DC 13 Constitution saving throw or be poisoned for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
      ],
      "attack": [
        "Shortsword|6|1d6+4"
      ]
    },
    {
      "name": "Light Crossbow",
      "text": [
        "Ranged Weapon Attack: +6 to hit, range 80/320 ft., one target. 8 (1d8 + 4) piercing damage plus 4 (1d8) poison damage. The target must succeed on a DC 13 Constitution saving throw or be poisoned for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
      ],
      "attack": [
        "Light Crossbow|6|1d8+4"
      ]
    }
  ],
  "reaction": [
    {
      "name": "Parry",
      "text": [
        "The dust goblin chieftain adds 2 to its AC against one melee attack that would hit it. To do so, the chieftain must see the attacker and be wielding a melee weapon."
      ]
    }
  ],
  "description": "Source: CCodex (3pp)",
  "environment": "badlands"
}