{
  "name": "Dvarapala",
  "size": "H",
  "type": "giant (as its patron deity)",
  "alignment": "Any alignment",
  "ac": "14 (natural armor)",
  "hp": "136 (13d12+52)",
  "speed": "walk 40 ft.",
  "str": "19",
  "dex": "8",
  "con": "18",
  "int": "10",
  "wis": "16",
  "cha": "9",
  "save": "Str +7, Con +7, Wis +6",
  "skill": "Perception +6, Religion +3",
  "passive": "16",
  "languages": "Common, telepathy 120 ft.",
  "cr": "5",
  "conditionImmune": "charmed, exhaustion, frightened",
  "senses": "darkvision 120 ft.",
  "trait": [
    {
      "name": "Divine Words",
      "text": [
        "In addition to Common, a dvarapala can speak one language associated with its patron deity. Abyssal (chaotic or neutral evil deities), Celestial (good deities), or Infernal (lawful evil deities). A dvarapala who serves a neutral deity knows a language that is most appropriate for service to its deity (such as Primordial for a neutral god of elementals or Sylvan for a neutral god of nature)."
      ]
    },
    {
      "name": "Keen Senses",
      "text": [
        "The dvarapala has advantage on Wisdom (Perception) checks that rely on sight, hearing, or smell."
      ]
    },
    {
      "name": "Magic Resistance",
      "text": [
        "The dvarapala has advantage on saving throws against spells and other magical effects. You Shall Not Pass! The dvarapala can make an opportunity attack when a hostile creature moves within its reach as well as when a hostile creature moves out of its reach. It gets one extra reaction that be used only for opportunity attacks."
      ]
    },
    {
      "name": "Innate Spellcasting",
      "text": [
        "The dvarapala's innate spellcasting ability is Wisdom (spell save DC 14). It can innately cast the following spells, requiring no material components:",
        "At will: sacred flame (2d8)",
        "3/day each: thunderwave",
        "1/day each: gust of wind, wind wall"
      ]
    }
  ],
  "action": [
    {
      "name": "Gada",
      "text": [
        "Melee Weapon Attack: +7 to hit, reach 10 ft., one target. 25 (6d6 + 4) bludgeoning damage and if the target is Large or smaller it must succeed on a DC 16 Strength saving throw or be pushed up to 15 feet away from the dvarapala."
      ],
      "attack": [
        "Gada|7|6d6+4"
      ]
    },
    {
      "name": "Javelin",
      "text": [
        "Melee or Ranged Weapon Attack: +7 to hit, reach 10 ft. or range 20/60 ft., one target. 14 (3d6 + 4) piercing damage."
      ],
      "attack": [
        "Javelin|7|3d6+4"
      ]
    },
    {
      "name": "Sweeping Strike (Recharge 4-6)",
      "text": [
        "The dvarapala targets one or more creatures it can see within 10 feet of it. Each target must make a DC 16 Strength saving throw, taking 24 (7d6) bludgeoning damage on a failed save, or half as much damage on a successful one. A creature who fails its save is pushed 5 feet away from the dvarapala."
      ]
    }
  ],
  "spells": "sacred flame, thunderwave, gust of wind, wind wall",
  "description": "Source: CCodex (3pp)"
}