{
  "name": "Ecstatic Bloom",
  "size": "H",
  "type": "celestial",
  "alignment": "Good Neutral",
  "ac": "15 (natural armor)",
  "hp": "171 (18d12+54)",
  "speed": "walk 10 ft.",
  "str": "10",
  "dex": "9",
  "con": "16",
  "int": "20",
  "wis": "19",
  "cha": "14",
  "save": "Int +9, Wis +9",
  "skill": "Insight +9, Perception +9",
  "passive": "19",
  "languages": "All, telepathy 120 ft.",
  "cr": "11",
  "immune": "radiant",
  "vulnerable": "fire",
  "conditionImmune": "charmed, frightened",
  "senses": "truesight 120 ft.",
  "trait": [
    {
      "name": "Aura Of Life",
      "text": [
        "When an undead creature starts its turn within 30 feet of the bloom, it must succeed on a DC 17 Wisdom saving throw or be turned until the end of its next turn."
      ]
    },
    {
      "name": "Blessed Regrowth",
      "text": [
        "At the start of each of the ecstatic bloom's turns, the bloom and each good-aligned creature, including the bloom, within 10 feet of it regains 4 (1d8) hp. If the bloom takes fire damage, this trait doesn't function at the start of the bloom's next turn. The ecstatic bloom dies only if it starts its turn with 0 hp and doesn't regain hp from this trait."
      ]
    },
    {
      "name": "Foster The Trees",
      "text": [
        "Alabaster trees within 60 feet of the ecstatic bloom have advantage on all saving throws."
      ]
    },
    {
      "name": "Like Calls To Like",
      "text": [
        "The ecstatic bloom knows if a creature within 120 feet of it is good-aligned or not."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The ecstatic bloom makes three gilded beam attacks."
      ]
    },
    {
      "name": "Gilded Beam",
      "text": [
        "Ranged Spell Attack: +9 to hit, range 150 ft., one target. 27 (6d8) radiant damage."
      ],
      "attack": [
        "Gilded Beam|9|6d8"
      ]
    },
    {
      "name": "Castigate (Recharges after a Short or Long Rest)",
      "text": [
        "The bloom summons a chorus of booming celestial voices that descend into the minds of nearby creatures. Each creature within 30 feet of the bloom must succeed on a DC 17 Wisdom saving throw or be stunned until the end of its next turn. Castigate only affects non-good-aligned creatures with an Intelligence of 5 or higher."
      ]
    }
  ],
  "description": "Source: CCodex (3pp) p. 303"
}