{
  "name": "Eku",
  "size": "M",
  "type": "celestial",
  "alignment": "Lawful Good",
  "ac": "19 (natural armor)",
  "hp": "97 (13d8+39)",
  "speed": "walk 30 ft., fly 90 ft.",
  "str": "16",
  "dex": "20",
  "con": "17",
  "int": "18",
  "wis": "20",
  "cha": "18",
  "save": "Con +5, Wis +7, Cha +6",
  "passive": "15",
  "languages": "all, telepathy 120 ft.",
  "cr": "4",
  "resist": "radiant",
  "immune": "psychic; bludgeoning, piercing, slashing from nonmagical attacks",
  "senses": "truesight 120 ft.",
  "trait": [
    {
      "name": "Magic Weapons",
      "text": [
        "Eku's weapon attacks are magical."
      ]
    },
    {
      "name": "Shielded Mind",
      "text": [
        "Eku is immune to scrying and to any effect that would sense its emotions, read its thoughts, or detect its location."
      ]
    },
    {
      "name": "Innate Spellcasting",
      "text": [
        "Eku's spellcasting ability is Charisma (spell save DC 14). It can innately cast the following spells, requiring only verbal components:",
        "At will: detect evil and good, detect magic, detect thoughts",
        "3/day each: bless, create food and water, cure wounds, lesser restoration, protection from poison, sanctuary, shield",
        "1/day each: dream, greater restoration, scrying"
      ]
    }
  ],
  "action": [
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +8 to hit, reach 5 ft., one creature. 8 (1d6 + 5) piercing damage, and the target must succeed on a DC 13 Constitution saving throw or be poisoned for 24 hours. Until this poison ends, the target is unconscious. Another creature can use an action to shake the target awake."
      ],
      "attack": [
        "Bite|+8|1d6+5"
      ]
    },
    {
      "name": "Constrict",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 10 ft., one Medium or smaller creature. 10 (2d6 + 3) bludgeoning damage, and the target is grappled (escape DC 15). Until this grapple ends, the target is restrained, and Eku can't constrict another target."
      ],
      "attack": [
        "Constrict|+6|2d6+3"
      ]
    },
    {
      "name": "Change Shape",
      "text": [
        "Eku magically polymorphs into a humanoid or beast that has a challenge rating equal to or less than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (Eku's choice).",
        "In a new form, Eku retains its game statistics and ability to speak, but its AC, movement modes, Strength, Dexterity, and other actions are replaced by those of the new form, and it gains any statistics and capabilities (except class features, legendary actions, and lair actions) that the new form has but that it lacks. If the new form has a bite attack, Eku can use its bite in that form."
      ]
    }
  ],
  "spells": "detect evil and good, detect magic, detect thoughts, bless, create food and water, cure wounds, lesser restoration, protection from poison, sanctuary, shield, dream, greater restoration, scrying",
  "description": "\nSource: Tomb of Annihilation p. 34",
  "environment": "grassland, forest, urban, desert"
}