{
  "name": "Elok Jaharwon",
  "size": "M",
  "type": "humanoid (human, shapechanger)",
  "alignment": "Neutral Evil",
  "ac": "10 (in humanoid form, 11 (natural armor) in boar or hybrid form)",
  "hp": "78 (12d8+24)",
  "speed": "walk 30 ft.",
  "str": "17",
  "dex": "10",
  "con": "15",
  "int": "10",
  "wis": "11",
  "cha": "8",
  "skill": "Perception +2",
  "passive": "12",
  "languages": "Common (can't speak in boar form)",
  "cr": "4",
  "immune": "bludgeoning, piercing, slashing from nonmagical attacks that aren't silvered",
  "trait": [
    {
      "name": "Shapechanger",
      "text": [
        "Elok can use its action to polymorph into a boar-humanoid hybrid or into a boar, or back into its true form, which is humanoid. Its statistics, other than its AC, are the same in each form. Any equipment it is wearing or carrying isn't transformed. It reverts to its true form if it dies."
      ]
    },
    {
      "name": "Charge (Boar or Hybrid Form Only)",
      "text": [
        "If Elok moves at least 15 feet straight toward a target and then hits it with its tusks on the same turn, the target takes an extra 7 (2d6) slashing damage. If the target is a creature, it must succeed on a DC 13 Strength saving throw or be knocked prone."
      ]
    },
    {
      "name": "Relentless (Recharges after a Short or Long Rest)",
      "text": [
        "If Elok takes 14 damage or less that would reduce it to 0 hit points, it is reduced to 1 hit point instead."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack (Humanoid or Hybrid Form Only)",
      "text": [
        "Elok makes two attacks, only one of which can be with its tusks."
      ]
    },
    {
      "name": "Maul (Humanoid or Hybrid Form Only)",
      "text": [
        "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 10 (2d6 + 3) bludgeoning damage."
      ],
      "attack": [
        "Maul (Humanoid or Hybrid Form Only)|+5|2d6+3"
      ]
    },
    {
      "name": "Tusks (Boar or Hybrid Form Only)",
      "text": [
        "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 10 (2d6 + 3) slashing damage. If the target is a humanoid, it must succeed on a DC 12 Constitution saving throw or be cursed with wereboar lycanthropy."
      ],
      "attack": [
        "Tusks (Boar or Hybrid Form Only)|+5|2d6+3"
      ]
    },
    {
      "name": "Variant: Nonhuman Lycanthropes",
      "text": [
        "The statistics presented in this section assume a base creature of human. However, you can also use the statistics to represent nonhuman lycanthropes, adding verisimilitude by allowing a nonhuman lycanthrope to retain one or more of its humanoid racial traits. For example, an elf werewolf might have the Fey Ancestry trait."
      ]
    }
  ],
  "description": "\nSource: Tomb of Annihilation p. 67",
  "environment": "grassland, forest, hill"
}