{
  "name": "Female Steeder",
  "size": "L",
  "type": "monstrosity",
  "alignment": "Unaligned",
  "ac": "14 (natural armor)",
  "hp": "30 (4d10+8)",
  "speed": "walk 30 ft., climb 30 ft.",
  "str": "15",
  "dex": "16",
  "con": "14",
  "int": "2",
  "wis": "10",
  "cha": "3",
  "skill": "Stealth +7, Perception +4",
  "passive": "14",
  "cr": "1",
  "senses": "darkvision 120 ft.",
  "trait": [
    {
      "name": "Spider Climb",
      "text": [
        "The steeder can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
      ]
    },
    {
      "name": "Extraordinary Leap",
      "text": [
        "The distance of the steeder's long jumps is tripled; every foot of its walking speed that it spends on the jump allows it to move 3 feet."
      ]
    }
  ],
  "action": [
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 7 (1d8 + 3) piercing damage plus 9 (2d8) poison damage."
      ],
      "attack": [
        "Bite|+5|1d8+3"
      ]
    },
    {
      "name": "Sticky Leg",
      "text": [
        "Melee Weapon Attack: +5 to hit, reach 5 ft., one Medium or smaller creature. The target is stuck to the steeder's leg and is grappled until it escapes (escape DC 12). The steeder can have only one creature grappled at a time."
      ]
    }
  ],
  "description": "\nSteeders resemble spiders as much as worgs resemble wolves. The creatures may appear similar, but steeders are more than mere vermin.\n — Mordenkainen\n\nSteeders. Giant hunting spiders, steeders prowl the depths of the Underdark. Most steeders are encountered in the company of duergar.\nFemale Dominance. Female steeders grow larger and stronger than males, and the female often devours the male after breeding. In captivity, males are used as draft animals, while females serve as steeds in battle.\nLone Predators. Steeders consider other steeders as enemies and attempt to tear apart perceived threats. Their duergar handlers must stable steeders separate from one another and place blinders on them when they're put to work to keep them from attacking each other.\nLow Cunning. Steeders are intelligent enough to learn simple hand signals and vocal commands, but even a domesticated steeder can turn against its handler. Training these beasts requires a rider to bond with the steeder, a process that begins shortly after the creature hatches. The rider stays with the steeder as it grows to full size, working throughout that time to channel the beast's predatory instincts.\nDeadly Hunters. Rather than spinning webs, steeders excrete a viscous substance from their legs. This goo allows them to creep along walls and ceilings and to grapple prey.\nSource: Mordenkainen's Tome of Foes p. 238, Out of the Abyss p. 231",
  "environment": "underdark"
}