{
  "name": "Fey Drake",
  "size": "S",
  "type": "dragon",
  "alignment": "Chaotic Neutral",
  "ac": "17 (natural armor)",
  "hp": "82 (15d6+30)",
  "speed": "walk 20 ft., fly 80 ft.",
  "str": "6",
  "dex": "20",
  "con": "15",
  "int": "15",
  "wis": "16",
  "cha": "18",
  "save": "Dex +8, Con +5, Wis +6",
  "skill": "Arcana +5, Deception +7, Perception +6, Stealth +8",
  "passive": "16",
  "languages": "Common, Draconic, Sylvan, telepathy 120 ft.",
  "cr": "6",
  "senses": "darkvision 120 ft.",
  "trait": [
    {
      "name": "Magic Resistance",
      "text": [
        "The fey drake has advantage on saving throws against spells and other magical effects."
      ]
    },
    {
      "name": "Superior Invisibility",
      "text": [
        "As a bonus action, the fey drake can magically turn invisible until its concentration ends (as if concentrating on a spell). Any equipment the drake wears or carries is invisible with it."
      ]
    },
    {
      "name": "Innate Spellcasting",
      "text": [
        "The fey drake's innate spellcasting ability is Charisma (spell save DC 15, +7 to hit with spell attacks). It can innately cast the following spells, requiring no material components:",
        "At will: charm person, color spray, grease",
        "3/day each: hypnotic pattern, locate creature, suggestion",
        "1/day each: dominate person, polymorph"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The fey drake makes three bite attacks."
      ]
    },
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit.",
        "10 (2d4 + 5) piercing damage, and the target must succeed on a DC 16 Constitution saving throw or be poisoned for 1 hour."
      ]
    },
    {
      "name": "Bewildering Breath (Recharge 5-6)",
      "text": [
        "The drake breaths a plume of purple gas in a 15-foot cone. Each creature in that area must succeed on a DC 16 Wisdom saving throw or be charmed for 1 minute. While charmed, the creature can't take bonus actions or reactions, and it makes all Intelligence, Wisdom, and Charisma skill checks and saving throws with disadvantage."
      ]
    }
  ],
  "spells": "charm person, color spray, grease, hypnotic pattern, locate creature, suggestion, dominate person, polymorph",
  "description": "Source: CCodex (3pp)"
}