{
  "name": "Flame-scourged Scion",
  "size": "H",
  "type": "aberration",
  "alignment": "Chaotic Evil",
  "ac": "16 (natural armor)",
  "hp": "125 (10d12+60)",
  "speed": "walk 30 ft.",
  "str": "19",
  "dex": "17",
  "con": "22",
  "int": "16",
  "wis": "6",
  "cha": "15",
  "save": "Con +10, Wis +2, Cha +6",
  "skill": "Insight +6, Perception +6",
  "passive": "16",
  "languages": "Common, Deep Speech, Sylvan",
  "cr": "9",
  "resist": "fire; slashing from nonmagical weapons",
  "conditionImmune": "grappled, paralyzed, restrained",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Burning Rage",
      "text": [
        "When a flame-scourged scion takes fire damage, it has advantage on its attack rolls until the end of its next turn. If it takes more than 5 fire damage, it has advantage on its attack rolls for 2 rounds."
      ]
    },
    {
      "name": "Firesight",
      "text": [
        "A flame-scourged scion can see through areas obscured by fire, smoke, and fog without penalty."
      ]
    },
    {
      "name": "Groundbreaker",
      "text": [
        "Difficult terrain caused by rocks, sand, or natural vegetation, living or dead, doesn't cost the flamescourged scion extra movement. Its speed can't be reduced by any effect."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The flame-scourged scion makes three tentacle attacks."
      ]
    },
    {
      "name": "Tentacle",
      "text": [
        "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. 15 (2d10 + 4) bludgeoning damage. If the target is a Large or smaller creature, it is grappled (escape DC 16). Until the grapple ends, the target is restrained, the flame-scourged scion can automatically hit the target with its tentacle, and it can't use the same tentacle on another target. The flame-scourged scion can grapple up to two creatures at one time."
      ],
      "attack": [
        "Tentacle|8|2d10+4"
      ]
    },
    {
      "name": "Embers (Recharge 6)",
      "text": [
        "The flame-scourged scion fills the area around itself with a cloud of burning embers. Each creature within 10 feet of the flame-scourged scion must make a DC 18 Constitution saving throw, taking 28 (8d6) fire damage on a failed save, or half as much damage on a successful one. The embers die out within moments."
      ]
    }
  ],
  "description": "Source: CCodex (3pp)",
  "environment": "badlands, forest"
}