{
  "name": "Flameskull",
  "size": "T",
  "type": "undead",
  "alignment": "Neutral Evil",
  "ac": "13",
  "hp": "40 (9d4+18)",
  "speed": "walk 0 ft., fly 40 ft.",
  "str": "1",
  "dex": "17",
  "con": "14",
  "int": "16",
  "wis": "10",
  "cha": "11",
  "skill": "Arcana +5, Perception +2",
  "passive": "12",
  "languages": "Common",
  "cr": "4",
  "resist": "lightning, necrotic, piercing",
  "immune": "cold, fire, poison",
  "conditionImmune": "charmed, frightened, paralyzed, poisoned, prone",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Illumination",
      "text": [
        "The flameskull sheds either dim light in a 15-foot radius, or bright light in a 15-foot radius and dim light for an additional 15 feet. It can switch between the options as an action."
      ]
    },
    {
      "name": "Magic Resistance",
      "text": [
        "The flameskull has advantage on saving throws against spells and other magical effects."
      ]
    },
    {
      "name": "Rejuvenation",
      "text": [
        "If the flameskull is destroyed, it regains all its hit points in 1 hour unless holy water is sprinkled on its remains or a dispel magic or remove curse spell is cast on them."
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "The flameskull is a 5th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 13, +5 to hit with spell attacks). It requires no somatic or material components to cast its spells. The flameskull has the following wizard spells prepared:",
        "Cantrips (at will): mage hand",
        "• 1st level (3 slots): magic missile, shield",
        "• 2nd level (2 slots): blur, flaming sphere",
        "• 3rd level (1 slots): fireball"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The flameskull uses Fire Ray twice."
      ]
    },
    {
      "name": "Fire Ray",
      "text": [
        "Ranged Spell Attack: +5 to hit, range 30 ft., one target. 10 (3d6) fire damage."
      ],
      "attack": [
        "Fire Ray|+5|3d6"
      ]
    }
  ],
  "slots": "3, 2, 1",
  "spells": "mage hand, magic missile, shield, blur, flaming sphere, fireball",
  "description": "Blazing green flames and mad, echoing laughter follow a disembodied skull as it patrols its demesne. When the undead flameskull discovers trespassers, it blasts the intruders with fiery rays from its eyes and dreadful spells called up from the dark recesses of its memory.\nDark spellcasters fashion flameskulls from the remains of dead wizards. When the ritual is complete, green flames erupt from the skull to complete its ghastly transformation.\nLegacy of Life. A flameskull only dimly recalls its former life. Though it might speak in its old voice and recount key events from its past, it is but an echo of its former self. However, its undead transformation grants it full access to the magic it wielded in life, letting it cast spells while ignoring the material and somatic components it can no longer employ.\nEternally Bound. Intelligent and vigilant, a flameskull serves its creator by protecting a hidden treasure hoard, a secret chamber, or a specific individual. A flameskull carries out the directives given to it when it was created, and it interprets those commands to the letter. A flameskull's master must craft its instructions with care to ensure that the creature carries out its tasks properly.\nWreathed in Flame.  The fire wreathing a flameskull burns continually, giving off bright light that the creature controls. It uses those flames as a weapon, focusing them to loose them as fiery rays from its eye sockets.\nEldritch Rejuvenation. A flameskull's shattered fragments reform unless they are splashed with holy water or subjected to a dispel magic or remove curse spell. If it can no longer fulfill its intended purpose, the re-formed flameskull is beholden to no one and becomes autonomous.\nUndead Nature. A flameskull doesn't require air, food, drink, or sleep\nSource: Monster Manual p. 134, Curse of Strahd, Lost Mine of Phandelver, Princes of the Apocalypse, Waterdeep: Dragon Heist, Waterdeep: Dungeon of the Mad Mage, Ghosts of Saltmarsh, Essentials Kit: Sleeping Dragon's Wake, Baldur's Gate: Descent Into Avernus, The Lost Dungeon of Rickedness: Big Rick Energy, Icewind Dale: Rime of the Frostmaiden, Tasha's Cauldron of Everything",
  "environment": "underdark"
}