{
  "name": "Fleshpod Hornet",
  "size": "L",
  "type": "beast",
  "alignment": "Unaligned",
  "ac": "14",
  "hp": "120 (16d10+32)",
  "speed": "walk 10 ft., fly 60 ft.",
  "str": "14",
  "dex": "18",
  "con": "15",
  "int": "3",
  "wis": "12",
  "cha": "6",
  "skill": "Perception +4",
  "passive": "14",
  "cr": "6",
  "trait": [
    {
      "name": "Flying Charge",
      "text": [
        "If the fleshpod hornet flies at least 20 feet straight toward a creature and then hits it with a slam attack on the same turn, that target must succeed on a DC 13 Strength saving throw or be knocked prone."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The fleshpod hornet makes two attacks. one with its slam and one with its stinger."
      ]
    },
    {
      "name": "Slam",
      "text": [
        "Melee Weapon Attack: +7 to hit, reach 5 ft., one creature. 13 (2d8 + 4) bludgeoning damage."
      ],
      "attack": [
        "Slam|7|2d8+4"
      ]
    },
    {
      "name": "Stinger",
      "text": [
        "Melee Weapon Attack: +7 to hit, reach 10 ft., one creature. 11 (2d6 + 4) piercing damage. The target must make a DC 13 Constitution saving throw, taking 21 (6d6) poison damage on a failed save, or half as much damage on a successful one. On a failed saving throw, the target is also infected with the eggs of the fleshpod hornet.",
        "The injected eggs form a circular lotus pod tumor, roughly half a foot in diameter, on the target within 1 minute of injection.",
        "While carrying this tumor, the target has disadvantage on skill checks and saving throws. Exactly 24 hours after the lotus pod appears, a young fleshpod hornet (use giant wasp statistics) erupts from the tumor, dealing does 33 (6d10) slashing damage to the target.",
        "The tumor can be excised with a DC 15 Wisdom (Medicine) check, causing 16 (3d10) slashing damage to the host. If it is cut out without the check, the patient must succeed on a DC 15 Constitution saving throw or take 22 (4d10) slashing damage."
      ],
      "attack": [
        "Stinger|7|2d6+4"
      ]
    }
  ],
  "description": "Source: CCodex (3pp)",
  "environment": "forest"
}