{
  "name": "Frost Giant Everlasting One",
  "size": "H",
  "type": "giant (frost giant)",
  "alignment": "Chaotic Evil",
  "ac": "15 (patchwork armor)",
  "hp": "189 (14d12+98)",
  "speed": "walk 40 ft.",
  "str": "25",
  "dex": "9",
  "con": "24",
  "int": "9",
  "wis": "10",
  "cha": "12",
  "save": "Str +11, Con +11, Wis +4",
  "skill": "Athletics +11, Perception +4",
  "passive": "14",
  "languages": "Giant",
  "cr": "12",
  "immune": "cold",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Extra Heads",
      "text": [
        "The giant has a 25 percent chance of having more than one head. If it has more than one, it has advantage on Wisdom (Perception) checks and on saving throws against being blinded, charmed, deafened, frightened, stunned, or knocked unconscious."
      ]
    },
    {
      "name": "Regeneration",
      "text": [
        "The giant regains 10 hit points at the start of its turn. If the giant takes acid or fire damage, this trait doesn't function at the start of its next turn. The giant dies only if it starts its turn with 0 hit points and doesn't regenerate."
      ]
    },
    {
      "name": "Vaprak's Rage (Recharges after a Short or Long Rest)",
      "text": [
        "As a bonus action, the giant can enter a rage at the start of its turn. The rage lasts for 1 minute or until the giant is incapacitated. While raging, the giant gains the following benefits:",
        "- The giant has advantage on Strength checks and Strength saving throws",
        "- When it makes a melee weapon attack, the giant gains a +4 bonus to the damage roll.",
        "- The giant has resistance to bludgeoning, piercing, and slashing damage."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The giant makes two attacks with its greataxe."
      ]
    },
    {
      "name": "Greataxe",
      "text": [
        "Melee Weapon Attack: +11 to hit, reach 10 ft., one target. 26 (3d12 + 7) slashing damage, or 30 (3d12 + 11) slashing damage while raging."
      ],
      "attack": [
        "Greataxe|+11|3d12+7"
      ]
    },
    {
      "name": "Rock",
      "text": [
        "Ranged Weapon Attack: +11 to hit, range 60/240 ft., one target. 29 (4d10 + 7) bludgeoning damage."
      ],
      "attack": [
        "Rock|+11|4d10+7"
      ]
    }
  ],
  "description": "To hold its place or rise within the ordning, a frost giant must routinely face mighty foes in single combat. Some seek out magic that will aid them, but enchanted objects can be taken or lost. True greatness relies on personal prowess. Faced with this truth, a frost giant might seek a supernatural gift from Vaprak the Destroyer.\nTroll Eater.  Frost giants mainly turn to Vaprak, a rapacious god of strength and hunger worshiped by ogres and trolls, out of desperation. Vaprak likes to tempt frost giants with dreams of glory followed by nightmares of bloody cannibalism. Those who don't shrink from such visions or report them to priests of Thrym receive more of the same. If a frost giant comes to relish these dreams and nightmares, as some do, Vaprak sets a troll upon a sacred quest to find the frost giant and meet it in secret. The troll offers up its own body to be devoured in Vaprak's name. Only the boldest and most determined frost giants can finish such a gory feast.\nVaprak's Blessing.  After devouring the troll sent by Vaprak, bones and all, a frost giant becomes an everlasting one, gaining tremendous strength, an ill temper, and a troll's regenerative ability. With these gifts, the frost giant can swiftly claim the title of jarl and easily fend off rivals for decades. However, if the frost giant doesn't give enough honor to Vaprak or fails to heed Vaprak's visions, injuries the frost giant sustains heal wrong, often resulting in discolored skin, warty scars, and vestigial body parts, such as extra digits, limbs, and even extra heads. The touch of Vaprak can no longer be hidden then, and the everlasting one is either killed or exiled by its clan. Sometimes small communities of everlasting ones gather and even reproduce, passing the \"blessing\" and worship of Vaprak from one generation to the next.\nSource: Volo's Guide to Monsters p. 148",
  "environment": "coastal, arctic"
}