{
  "name": "Galvanice Weird",
  "size": "M",
  "type": "elemental",
  "alignment": "Chaotic Neutral",
  "ac": "12 (natural armor)",
  "hp": "22 (3d8+9)",
  "speed": "walk 30 ft.",
  "str": "14",
  "dex": "10",
  "con": "17",
  "int": "3",
  "wis": "10",
  "cha": "5",
  "passive": "10",
  "cr": "1",
  "resist": "cold, lightning; bludgeoning, piercing, slashing from nonmagical attacks",
  "immune": "poison",
  "conditionImmune": "exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained, unconscious",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Death Burst",
      "text": [
        "When the galvanice weird dies, it explodes in a burst of ice and lightning. Each creature within 10 feet of the exploding weird must make a DC 13 Dexterity saving throw, taking 7 (2d6) lightning damage on a failed save, or half as much damage on a successful one."
      ]
    }
  ],
  "action": [
    {
      "name": "Slam",
      "text": [
        "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 5 (1d6 + 2) bludgeoning damage plus 5 (2d4) lightning damage. If the target is a creature, it must succeed on a DC 13 Constitution saving throw or lose the ability to use reactions until the start of the weird's next turn."
      ],
      "attack": [
        "Slam|+4|1d6+2"
      ]
    }
  ],
  "description": "Galvanice weirds seem to be the epitome of weird technology. Indeed, they serve willingly, with cheerful stupidity, as guardians and laborers in Izzet workshops. They combine a rigid body of elemental ice with a core of lightning that animates them. If a galvanice weird is destroyed, the ice shatters and lightning crackles outward in a dangerous explosion. Still, most Izzet researchers find that their usefulness outweighs this risk.\nIzzet Weirds. Weirds are the products of Izzet League experiments intended to combine two opposing elemental types in the hope of creating elementals that were more stable than the norm and easier to control. As commonly happens with Izzet experiments, the outcome was the exact opposite. Weirds are even wilder and more unpredictable than elementals of either of their component elements. Nevertheless, they can make potent guardian creatures and can be urged into fighting on behalf of their creators.\nElemental Nature. An Izzet weird doesn't require air, food, drink, or sleep.\nSource: Guildmasters' Guide to Ravnica p. 209"
}