{
  "name": "Garret Levistusson",
  "size": "M",
  "type": "humanoid",
  "alignment": "Chaotic Neutral",
  "ac": "14 (natural armor)",
  "hp": "44 (8d8+8)",
  "speed": "walk 30 ft.",
  "str": "11",
  "dex": "14",
  "con": "12",
  "int": "11",
  "wis": "12",
  "cha": "17",
  "skill": "Deception +7, Investigation +4, Performance +5, Persuasion +5",
  "passive": "11",
  "languages": "Abyssal, Common, Infernal, Thieves' cant",
  "cr": "2",
  "trait": [
    {
      "name": "Special Equipment",
      "text": [
        "Garret wears a Ring of Warmth (included in his statistics) and wields a Gambler's Blade longsword."
      ]
    },
    {
      "name": "Bardic Inspiration (3/Day)",
      "text": [
        "As a bonus action, Garret can give one chosen creature (other than him) a d6 inspiration die. The chosen creature must be within 60 feet of Garret and able to hear him. Once within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can use the inspiration die after the roll is made but before the DM says whether it succeeds or fails. Once the inspiration die is rolled, it is lost. A creature can have only one inspiration die at a time."
      ]
    },
    {
      "name": "Cunning Action",
      "text": [
        "On each of his turns, Garret can use a bonus action to take the Dash, Disengage, or Hide action."
      ]
    },
    {
      "name": "Sneak Attack (1/Turn)",
      "text": [
        "Garret deals an extra 7 (2d6) damage when he hits a target with a weapon attack and has advantage on the attack roll, or when the target is within 5 feet of an ally of Garret that isn't incapacitated and Garret doesn't have disadvantage on the attack roll."
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "Garret is a 2nd-level spellcaster. His spellcasting ability is Charisma (spell save DC 13, +5 to hit with spell attacks). He has the following bard spells prepared:",
        "Cantrips (at will): blade ward, vicious mockery",
        "• 1st level (3 slots): charm person, detect magic, disguise self, identify, Tasha's hideous laughter"
      ]
    }
  ],
  "action": [
    {
      "name": "Shortsword",
      "text": [
        "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 5 (1d6 + 2) piercing damage."
      ],
      "attack": [
        "Shortsword|+4|1d6+2"
      ]
    }
  ],
  "slots": [
    "3"
  ],
  "spells": "blade ward, vicious mockery, charm person, detect magic, disguise self, identify, Tasha's hideous laughter",
  "description": "\nSource: Lost Laboratory of Kwalish p. 41"
}