{
  "name": "Githyanki Supreme Commander",
  "size": "M",
  "type": "humanoid (gith)",
  "alignment": "Lawful Evil",
  "ac": "18 (plate armor)",
  "hp": "187 (22d8+88)",
  "speed": "walk 30 ft.",
  "str": "19",
  "dex": "17",
  "con": "18",
  "int": "16",
  "wis": "16",
  "cha": "18",
  "save": "Con +9, Int +8, Wis +8",
  "skill": "Insight +8, Intimidation +9, Perception +8",
  "passive": "18",
  "languages": "Gith",
  "cr": "14",
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The githyanki makes two greatsword attacks."
      ]
    },
    {
      "name": "Silver Greatsword",
      "text": [
        "Melee Weapon Attack: +12 to hit, reach 5 ft., one target. 14 (2d6 + 7) slashing damage plus 17 (5d6) psychic damage. On a critical hit against a target in an astral body (as with the astral projection spell), the githyanki can cut the silvery cord that tethers the target to its material body, instead of dealing damage."
      ],
      "attack": [
        "Silver Greatsword|+12|2d6+7"
      ]
    }
  ],
  "reaction": [
    {
      "name": "Parry",
      "text": "The githyanki adds 5 to its AC against one melee attack that would hit it. To do so, the githyanki must see the attacker and be wielding a melee weapon."
    }
  ],
  "legendary": [
    {
      "text": [
        "The humanoid (gith) can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The humanoid (gith) regains spent legendary actions at the start of its turn."
      ]
    },
    {
      "name": "Attack (2 Actions)",
      "text": [
        "The githyanki makes a greatsword attack."
      ]
    },
    {
      "name": "Command Ally",
      "text": [
        "The githyanki targets one ally it can see within 30 feet of it. If the target can see or hear the githyanki, the target can make one melee weapon attack using its reaction and has advantage on the attack roll."
      ]
    },
    {
      "name": "Teleport",
      "text": [
        "The githyanki magically teleports, along with any equipment it is wearing and carrying, to an unoccupied space it can see within 30 feet of it. It also becomes insubstantial until the start of its next turn. While insubstantial, it can move through other creatures and objects as if they were difficult terrain. If it ends its turn inside an object, it takes 16 (3d10) force damage and is moved to the nearest unoccupied space."
      ]
    }
  ],
  "trait": [
    {
      "name": "Innate Spellcasting (Psionics)",
      "text": [
        "The githyanki's innate spellcasting ability is Intelligence (spell save DC 16, +8 to hit with spell attacks). It can innately cast the following spells, requiring no components:",
        "At will: mage hand (the hand is invisible)",
        "3/day each: jump, levitate (self only), misty step, nondetection (self only)",
        "1/day each: Bigby's hand, mass suggestion, plane shift, telekinesis"
      ]
    }
  ],
  "spells": "mage hand, jump, levitate, misty step, nondetection, Bigby's hand, mass suggestion, plane shift, telekinesis",
  "description": "\nWhat would become of this multiverse if githyanki didn't guard the Astral Plane from the illithid menace? What would reality become if beings of thought ruled the plane of thought?\n — Mordenkainen\n\nGithyanki Supreme Commander. Supreme commanders lead the githyanki armies, each one commanding ten kith'raks, who in turn lead the rest of their forces. Most supreme commanders ride red dragons into battle.\nGith. The descendants of an ancient people—so old their original name has been lost—have turned against each other, becoming vicious enemies divided over mortality, purpose, and the machinations of their leaders. The bellicose githyanki terrorize the Astral Plane, raiding into other worlds to plunder the multiverse of its magic and riches. The githzerai live apart from the rest of the cosmos, content within the confines of their fortresses floating through the chaos of Limbo. Although the two groups of gith despise each other, their hatred for the mind flayers from whom they escaped endures, and both githyanki and githzerai are dedicated to hunting their ancestral foes.\nSource: Mordenkainen's Tome of Foes p. 206",
  "environment": "desert, mountain, urban"
}