{
  "name": "Hybrid Poisoner",
  "size": "M",
  "type": "humanoid (Simic hybrid)",
  "alignment": "Neutral Good",
  "ac": "14",
  "hp": "26 (4d8+8)",
  "speed": "walk 40 ft.",
  "str": "12",
  "dex": "19",
  "con": "14",
  "int": "12",
  "wis": "13",
  "cha": "12",
  "save": "Dex +6, Con +4",
  "skill": "Athletics +3, Perception +3, Stealth +6",
  "passive": "13",
  "languages": "Common plus any one language",
  "cr": "1",
  "immune": "poison",
  "conditionImmune": "poisoned",
  "senses": "darkvision 30 ft.",
  "trait": [
    {
      "name": "Assassinate",
      "text": [
        "During its first turn, the hybrid poisoner has advantage on attack rolls against any creature that hasn't taken a turn. Any hit the hybrid scores against a surprised creature is a critical hit."
      ]
    },
    {
      "name": "Poisonous Skin",
      "text": [
        "Any creature that touches the hybrid or hits it with a melee attack while within 5 feet of it takes 3 (1d6) poison damage."
      ]
    }
  ],
  "action": [
    {
      "name": "Toxic Touch",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 7 (2d6) bludgeoning damage, and the target must succeed on a DC 12 Constitution saving throw or become poisoned for 1 minute. At the end of each of the poisoned target's turns, it must repeat the save, taking 3 (1d6) poison damage on a failed save, or ending the effect on itself on a successful one."
      ],
      "attack": [
        "Toxic Touch|+6|2d6",
        "Toxic Touch||1d6"
      ]
    }
  ],
  "description": "Simic Hybrids. The Guardian Project is a consequence of increasing tension within the Simic Combine as the threat of interguild conflict looms. Believing that the Simic must be prepared to fight for their lives when that conflict comes to a head, biomancers have created soldiers to help defend the guild. These hybrids (also called guardians, after the name of the project) are created from human, vedalken, and elf guild members who volunteer to be transformed.\nSource: Guildmasters' Guide to Ravnica p. 217"
}