{
  "name": "Incinis",
  "size": "L",
  "type": "elemental",
  "alignment": "Neutral Evil",
  "ac": "17 (natural armor)",
  "hp": "171 (18d10+72)",
  "speed": "walk 40 ft.",
  "str": "12",
  "dex": "20",
  "con": "18",
  "int": "10",
  "wis": "16",
  "cha": "10",
  "passive": "13",
  "languages": "Common, Ignan",
  "cr": "10",
  "resist": "bludgeoning, piercing, slashing from nonmagical weapons",
  "immune": "fire, poison",
  "conditionImmune": "exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained, unconscious",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Magma Form",
      "text": [
        "The elemental can move through a space as narrow as 1 inch wide without squeezing. A creature that touches the elemental or hits it with a melee attack while within 5 feet of it takes 5 (1d10) fire damage and must succeed on a DC 16 Strength saving throw or the weapon becomes stuck in the elemental. If the weapon's wielder can't or won't let go of the weapon, the wielder is grappled while the weapon is stuck. While stuck, the weapon can't be used. Until the grapple ends, the wielder takes 5 (1d10) fire damage at the start of each of its turns. To end the grapple, the wielder can release the weapon or pull it free by taking an action to make a DC 16 Strength check and succeeding."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The incinis makes two magma fist attacks."
      ]
    },
    {
      "name": "Magma Fist",
      "text": [
        "Melee Weapon Attack: +9 to hit, reach 10 ft., one creature. 14 (2d8 + 5) bludgeoning damage and 9 (2d8) fire damage."
      ],
      "attack": [
        "Magma Fist|9|2d8+5"
      ]
    },
    {
      "name": "Wave of Magma (Recharge 5-6)",
      "text": [
        "The incinis transforms into a wave of magma, moving up to its speed in a straight line. Each creature in the path where the incinis moves must make a DC 17 Dexterity saving throw. On a failure, a target takes 21 (6d6) fire damage and, if it is a Large or smaller creature, it is pushed ahead of the incinis and knocked prone in an unoccupied space within 5 feet of where the incinis ends its movement. On a success, a target takes half the damage and is neither pushed nor knocked prone."
      ]
    }
  ],
  "description": "Source: CCodex (3pp)",
  "environment": "mountain"
}