{
  "name": "Jarlaxle Baenre",
  "size": "M",
  "type": "humanoid (elf)",
  "alignment": "Chaotic Neutral",
  "ac": "24 (+3 leather armor, Suave Defense)",
  "hp": "123 (19d8+38)",
  "speed": "walk 30 ft.",
  "str": "12",
  "dex": "22",
  "con": "14",
  "int": "20",
  "wis": "16",
  "cha": "19",
  "save": "Dex +11, Wis +8",
  "skill": "Acrobatics +11, Athletics +6, Deception +14, Perception +8, Sleight of hand +11, Stealth +16",
  "passive": "18",
  "languages": "Abyssal, Common, Draconic, Dwarvish, Elvish, Undercommon",
  "cr": "15",
  "senses": "darkvision 120 ft.",
  "trait": [
    {
      "name": "Special Equipment",
      "text": [
        "Jarlaxle wears +3 leather armor, a hat of disguise, a bracer of flying daggers, a cloak of invisibility, a knave's eye patch, and a ring of truth telling. He wields a +3 rapier and carries a portable hole and a wand of web. His hat is adorned with a feather of diatryma summoning."
      ]
    },
    {
      "name": "Evasion",
      "text": [
        "If he is subjected to an effect that allows him to make a Dexterity saving throw to take only half damage, Jarlaxle instead takes no damage if he succeeds on the saving throw, and only half damage if he fails. He can't use this trait if he's incapacitated."
      ]
    },
    {
      "name": "Fey Ancestry",
      "text": [
        "Jarlaxle has advantage on saving throws against being charmed, and magic can't put him to sleep."
      ]
    },
    {
      "name": "Legendary Resistance (1/Day)",
      "text": [
        "If Jarlaxle fails a saving throw, he can choose to succeed instead."
      ]
    },
    {
      "name": "Master Attuner",
      "text": [
        "Jarlaxle can attune to up to five magic items, and he can attune to magic items that normally require attunement by a sorcerer, warlock, or wizard."
      ]
    },
    {
      "name": "Sneak Attack (1/Turn)",
      "text": [
        "Jarlaxle deals an extra 24 (7d6) damage when he hits a target with a weapon attack and has advantage on the attack roll, or when the target is within 5 feet of an ally of Jarlaxle's that isn't incapacitated and Jarlaxle doesn't have disadvantage on the attack roll."
      ]
    },
    {
      "name": "Suave Defense",
      "text": [
        "While Jarlaxle is wearing light or no armor and wielding no shield, his AC includes his Charisma modifier."
      ]
    },
    {
      "name": "Sunlight Sensitivity",
      "text": [
        "When not wearing his knave's eye patch, Jarlaxle has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
      ]
    },
    {
      "name": "Innate Spellcasting",
      "text": [
        "Jarlaxle's innate spellcasting ability is Charisma (spell save DC 17, +9 to hit with spell attacks) He can innately cast the following spells, requiring no material components:",
        "At will: dancing lights",
        "1/day each: darkness, faerie fire, levitate (self only)"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "Jarlaxle makes three attacks with his +3 rapier or two attacks with daggers created by his bracer of flying daggers."
      ]
    },
    {
      "name": "+3 Rapier",
      "text": [
        "Melee Weapon Attack: +14 to hit, reach 5 ft., one target. 13 (1d8 + 9) piercing damage."
      ],
      "attack": [
        "+3 Rapier|+14|1d8+9"
      ]
    },
    {
      "name": "Flying Dagger",
      "text": [
        "Ranged Weapon Attack: +11 to hit, range 20/60 ft., one target. 8 (1d4 + 6) piercing damage."
      ],
      "attack": [
        "Flying Dagger|+11|1d4+6"
      ]
    }
  ],
  "legendary": [
    {
      "text": [
        "Jarlaxle can take 2 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. Jarlaxle regains spent legendary actions at the start of its turn."
      ]
    },
    {
      "name": "Quick Step",
      "text": [
        "Jarlaxle moves up to his speed without provoking opportunity attacks."
      ]
    },
    {
      "name": "Attack (Costs 2 Actions)",
      "text": [
        "Jarlaxle makes one attack with his +3 rapier or two attacks with daggers created by his bracer of flying daggers."
      ]
    }
  ],
  "spells": "dancing lights, darkness, faerie fire, levitate",
  "description": "Jarlaxle is a flamboyant, swashbuckling drow iconoclast. He leads a renegade drow faction called Bregan D'aerthe, made up of disenfranchised male drow, most of them culled from destroyed or disgraced houses. Gifted with a sharp mind, a sense of humor, puissant skill with a blade, and a wealth of useful magic items, Jarlaxle infiltrated the city of Luskan, brought a kind of order to its lawlessness, and declared himself its secret lord.\nJarlaxle likes to weave a tangled web of schemes that leave his enemies baffled-the latest of which is a plan to legitimize Luskan by making it a member of the Lords' Alliance. The city's unsavory reputation has thwarted all previous efforts, and the current leaders of the Lords' Alliance have voiced their opposition to Luskan's admittance. A few have flatly declared that the city will never be welcome in the alliance. Nonetheless, Jarlaxle aims to persuade Laeral Silverhand, the Open Lord of Waterdeep, to champion Luskan's cause-even if that means losing other alliance members in the process. Tying Luskan's fortunes to those of Waterdeep would increase Jarlaxle's political and economic power on the Sword Coast.\nJarlaxle has come to Waterdeep in the guise of an Illuskan human named Zardoz Zord. \"Captain Zord\" is the master of the Sea Maidens Faire, a carnival that travels up and down the Sword Coast in three ships: the Eyecatcher, the Heartbreaker, and the Hellraiser (all words that describe Jarlaxle). He spends most of his time aboard the Eyecatcher, his personal ship. The other two vessels carry members of the carnival and their parade wagons.\nJarlaxle has forged an alliance with Lantan (an island to the south), and has armed his Bregan D'aerthe lieutenants with Lantanese firearms that rely on magical smokepowder to function. He has also acquired a Lantanese submarine called the Scarlet Marpenoth. This underwater vessel is mounted below the Eyecatcher and kept out of sight. Jarlaxle plans on using the submarine to flee Waterdeep if his scheme unravels.\nJarlaxle's loyalties are to himself first and foremost, and to Bregan D'aerthe secondarily.\nSource: Waterdeep: Dragon Heist p. 206"
}