{
  "name": "Karakura",
  "size": "M",
  "type": "fiend (shapechanger)",
  "alignment": "Neutral Evil",
  "ac": "15 (natural armor)",
  "hp": "76 (17d8)",
  "speed": "walk 30 ft., fly 40 ft.",
  "str": "7",
  "dex": "18",
  "con": "11",
  "int": "15",
  "wis": "13",
  "cha": "20",
  "save": "Cha +8",
  "skill": "Deception +8, Perception +4, Persuasion +8, Stealth +7",
  "passive": "14",
  "languages": "Common, Abyssal, Infernal, telepathy 60 ft.",
  "cr": "5",
  "resist": "cold, fire, lightning; bludgeoning, piercing, slashing from nonmagical weapons",
  "immune": "poison",
  "vulnerable": "radiant",
  "conditionImmune": "poisoned",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Night Walkers",
      "text": [
        "The karakura can only exist on the Material Plane at night or underground. Spells or effects that count as sunlight cast the fiend back to the Plane of Shadow for 1d4 hours."
      ]
    },
    {
      "name": "Shapechanger",
      "text": [
        "The karakura can use its action to polymorph into a Small or Medium humanoid, or back into its true form.",
        "Other than its size, its statistics are the same in each form. Any equipment it is wearing or carrying isn't transformed. It reverts to its true form if it dies."
      ]
    },
    {
      "name": "Telepathic Bond",
      "text": [
        "The karakura can telepathically communicate with any creature it has charmed at any distance and across different planes."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The karakura makes three claw attacks and can use Charm or Shroud in Darkness, if it is available."
      ]
    },
    {
      "name": "Claw",
      "text": [
        "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. 7 (1d6 + 4) slashing damage."
      ],
      "attack": [
        "Claw|7|1d6+4"
      ]
    },
    {
      "name": "Charm",
      "text": [
        "One humanoid the karakura can see within 30 feet of it must succeed on a DC 15 Wisdom saving throw or be magically charmed until dawn. The charmed target obeys the fiend's commands. If the target suffers any harm or receives a suicidal command, it can repeat the saving throw to end the effect. If the target successfully saves, or if the effect on it ends, the target is immune to this karakura's Charm for the next 24 hours.",
        "The karakura can have only one target charmed at a time. If it charms another, the effect on the previous target ends."
      ]
    },
    {
      "name": "Shroud in Darkness (Recharge 5-6)",
      "text": [
        "Bands of shadow stretch out from the karakura and wrap around a target it can see within 30 feet. The target must succeed on a DC 15 Charisma saving throw or be translocated to the Plane of Shadow for 1 minute. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. When a target exits the shroud, it appears in an unoccupied space within 10 feet of the karakura.",
        "The karakura can have only one target in its shroud at a time.",
        "It can release a target as a bonus action.",
        "While in the Plane of Shadow, the target is bombarded with horrific images and sensations. Each round it remains in the Plane of Shadow, it must succeed on a DC 15 Charisma saving throw or gain one short-term madness. A target held in the shroud is released when the karakura dies."
      ]
    },
    {
      "name": "Shadow Walk",
      "text": [
        "The karakura can magically enter the Plane of Shadow from the Material Plane, or vice versa."
      ]
    }
  ],
  "description": "Source: CCodex (3pp) p. 235"
}