{
  "name": "Keelboat",
  "size": "G",
  "type": "vehicle (60 ft. x 20 ft.)",
  "alignment": "Unaligned",
  "ac": "15",
  "hp": "100",
  "speed": "3 miles per hour (72 miles per day)",
  "str": "16",
  "dex": "7",
  "con": "13",
  "int": "0",
  "wis": "0",
  "cha": "0",
  "immune": "poison, psychic",
  "conditionImmune": "blinded, charmed, deafened, exhaustion, frightened, incapacitated, paralyzed, petrified, poisoned, prone, stunned, unconscious",
  "trait": [
    {
      "name": "Hit Points",
      "text": [
        "100"
      ]
    },
    {
      "name": "Hull:",
      "text": [
        "Armor Class: 15",
        "Hit Points: 100 (damage threshold 10)"
      ]
    },
    {
      "name": "Control:",
      "text": [
        "Helm",
        "Armor Class: 12",
        "Hit Points: 50",
        "Move up to the speed of one of its movement components, with one 90-degree turn. If the helm is destroyed, the keelboat can't turn."
      ]
    },
    {
      "name": "Movement:",
      "text": [
        "Oars",
        "Armor Class: 12",
        "Hit Points: 100; -5 ft. speed per 25 damage taken"
      ]
    },
    {
      "name": "Movement:",
      "text": [
        "Sails",
        "Armor Class: 12",
        "Hit Points: 100; -5 ft. speed per 20 damage taken "
      ]
    }
  ],
  "action": [
    {
      "text": [
        "On its turn, the keelboat can take 2 actions, choosing from the options below. It can take only 1 action if it has only one crew. It can't take these actions if it has no crew.",
        "• Fire Ballista. The keelboat can fire its ballista (DMG, ch. 8).",
        "• Move. The keelboat can use its helm to move with its oars or sails."
      ]
    },
    {
      "name": "Weapons:",
      "text": [
        "Ballista",
        "Armor Class: 15",
        "Hit Points: 50",
        "Ranged Weapon Attack: +6 to hit, range 120/480 ft., one target. 16 (3d10) piercing damage.",
        "Keelboats typically include a ballista only when they are equipped for combat."
      ],
      "attack": [
        "Weapons:|+6|3d10"
      ]
    }
  ],
  "description": "Example Keelboat Crew\nA keelboat requires a single crew member to operate smoothly. If the characters are guests on a keelboat, the crew consists of a single captain who has the statistics of a bandit captain with proficiency with water vehicles.\nKeelboat Deck\nThe deck of the keelboat has the following features:\n• Ballista. A ballista (DMG, ch. 8) is mounted on the fore of the deck. Ten ballista arrows are stacked and secured nearby.\n• Oars. The deck of the ship holds twelve benches and four 15-foot-long oars. When the ship is rowed, crew members sit on these benches to work the oars.\n• Railing. The deck has a 3-foot-high rail around its perimeter that provides half cover for Medium creatures and three-quarters cover for Small creatures behind it.\nKeelboat Cabin\nThe keelboat cabin has the following features:\n• Footlockers. Beneath each bed is a footlocker. The footlockers are iron and have AC 19, 18 hit points, and immunity to poison and psychic damage.\n• Furnishings. Two beds and a desk with a chair stand at the aft of the cabin.\nSource: Ghosts of Saltmarsh p. 188"
}