{
  "name": "King Kobold",
  "size": "S",
  "type": "humanoid (kobold)",
  "alignment": "Lawful Neutral",
  "ac": "15 (18 with mage armor)",
  "hp": "112 (25d6+25)",
  "speed": "walk 30 ft.",
  "str": "8",
  "dex": "20",
  "con": "12",
  "int": "14",
  "wis": "14",
  "cha": "15",
  "save": "Dex +8, Int +5",
  "skill": "Deception +5, Insight +8, Intimidation +8, Persuasion +8",
  "passive": "12",
  "languages": "Common, Draconic",
  "cr": "6",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Cunning Action",
      "text": [
        "On each of its turns, the king kobold can use a bonus action to take the Dash, Disengage, or Hide action."
      ]
    },
    {
      "name": "Evasion",
      "text": [
        "If the king kobold is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, the king instead takes no damage if it succeeds on the saving throw, and only half damage if it fails."
      ]
    },
    {
      "name": "Pack Tactics",
      "text": [
        "The king has advantage on attack rolls against a creature if at least one of the king's allies is within 5 feet of the creature and the ally isn't incapacitated."
      ]
    },
    {
      "name": "Sneak Attack (1/Turn)",
      "text": [
        "The king kobold deals an extra 14 (4d6) damage when it hits a target with a weapon attack and has advantage on the attack roll, or when the target is within 5 feet of an ally of the king that isn't incapacitated and the king doesn't have disadvantage on the attack roll."
      ]
    },
    {
      "name": "Sunlight Sensitivity",
      "text": [
        "While in sunlight, the king has disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight."
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "The king kobold is a 4th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 13, +5 to hit with spell attacks). The king kobold has the following Wizard spells prepared:",
        "Cantrips (at will): fire bolt, mage hand, minor illusion, poison spray",
        "• 1st level (4 slots): alarm, grease, mage armor",
        "• 2nd level (3 slots): alter self, hold person, invisibility"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The king kobold makes two shortsword attacks."
      ]
    },
    {
      "name": "Shortsword",
      "text": [
        "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. 8 (1d6 + 5) piercing damage."
      ],
      "attack": [
        "Shortsword|8|1d6+5"
      ]
    },
    {
      "name": "Hand Crossbow",
      "text": [
        "Ranged Weapon Attack: +8 to hit, range 30/120 ft., one target. 8 (1d6 + 5) piercing damage."
      ],
      "attack": [
        "Hand Crossbow|8|1d6+5"
      ]
    }
  ],
  "reaction": [
    {
      "name": "Uncanny Dodge",
      "text": [
        "The king kobold halves the damage from one attack that hits it. To do so, it must see the attacker."
      ]
    }
  ],
  "slots": [
    "4, 3"
  ],
  "spells": "fire bolt, mage hand, minor illusion, poison spray, alarm, grease, mage armor, alter self, hold person, invisibility",
  "description": "Source: CCodex (3pp)"
}