{
  "name": "Leshy",
  "size": "M",
  "type": "monstrosity,tome of Beasts",
  "alignment": "chaotic neutral",
  "ac": "14 (natural armor)",
  "hp": "84 (13d8+26)",
  "speed": "30 ft.",
  "str": "16",
  "dex": "12",
  "con": "14",
  "int": "14",
  "wis": "15",
  "cha": "16",
  "skill": "Deception +5, Perception +4, Stealth +3, Survival +4",
  "senses": "darkvision 60 ft.",
  "passive": "14",
  "languages": " Common, Elvish, Sylvan",
  "cr": "1",
  "trait": [
    {
      "name": "Innate Spellcasting",
      "text": [
        "The leshy's innate spellcasting ability is Charisma (spell save DC 13). It can innately cast the following spells, requiring no material components:",
        "At will: animal friendship, pass without trace, speak with animals",
        "1/day each: entangle, plant growth, shillelagh, speak with plants, hideous laughter"
      ]
    },
    {
      "name": "Camouflage",
      "text": [
        "A leshy has advantage on Stealth checks if it is at least lightly obscured by foliage."
      ]
    },
    {
      "name": "Mimicry",
      "text": [
        "A leshy can mimic the calls and voices of any creature it has heard. To use this ability, the leshy makes a Charisma (Deception) check. Listeners who succeed on an opposed Wisdom (Insight) or Intelligence (Nature).DM's choice.realize that something is mimicking the sound. The leshy has advantage on the check if it's mimicking a general type of creature (a crow's call, a bear's roar) and not a specific individual's voice."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The leshy makes two club attacks."
      ]
    },
    {
      "name": "Change Size",
      "text": [
        "The leshy appears to change its size, becoming as tall as a massive oak (Gargantuan) or as short as a blade of grass (Tiny). The change is entirely illusory, so the leshy's statistics do not change."
      ]
    },
    {
      "name": "Club",
      "text": [
        "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) bludgeoning damage."
      ],
      "attack": [
        "Club|5|1d6+3"
      ]
    }
  ]
}