{
  "name": "Liara Portyr",
  "size": "M",
  "type": "humanoid (human)",
  "alignment": "Lawful Evil",
  "ac": "15 (studded leather armor, shield)",
  "hp": "84 (13d8+26)",
  "speed": "walk 30 ft.",
  "str": "16",
  "dex": "12",
  "con": "15",
  "int": "14",
  "wis": "14",
  "cha": "16",
  "save": "Con +4, Wis +4",
  "skill": "Athletics +5, Deception +5, Insight +4, Intimidation +5",
  "passive": "12",
  "languages": "Common, Draconic, Dwarvish",
  "cr": "4",
  "trait": [
    {
      "name": "Brave",
      "text": [
        "Liara has advantage on saving throws against being frightened."
      ]
    },
    {
      "name": "Flaming Fury",
      "text": [
        "Once per turn, when Liara hits a creature with a melee weapon, she can cause fire to magically erupt from her weapon and deal an extra 10 (3d6) fire damage to the target."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "Liara makes three melee attacks."
      ]
    },
    {
      "name": "Battleaxe",
      "text": [
        "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 7 (1d8 + 3) slashing damage, or 8 (1d10 + 3) slashing damage when used with two hands."
      ],
      "attack": [
        "Battleaxe|+5|1d8+3"
      ]
    },
    {
      "name": "Heavy Crossbow",
      "text": [
        "Ranged Weapon Attack: +3 to hit, range 100/400 ft., one target. 6 (1d10 + 1) piercing damage."
      ],
      "attack": [
        "Heavy Crossbow|+3|1d10+1"
      ]
    }
  ],
  "description": "As the commander of Fort Beluarian, Liara spends most of her time worrying about the security of her stronghold while cutting deals with pirates. In general, she has no problem with adventurers and will do her utmost to help them deal with the myriad threats lurking in the jungle.\nLiara comes from an influential family in Baldur's Gate and has held her post for the past three years. To her, the assignment feels like a test of mettle, but to many of her subordinates, Fort Beluarian feels like banishment. Liara's spies in Port Nyanzaru furnish her with ship manifests and departure schedules that she passes along to the pirates of Jahaka Anchorage, in exchange for promises to never attack ships flying the flag of Baldur's Gate. Liara also receives a cut of the pirates' profits, some of which go toward keeping her garrison happy.\nLiara Portyr's Traits. Ideal. \"One must respect the chain of command. You follow my orders, or you die.\"\nBond. \"I have sworn to hold and protect Fort Beluarian in the name of Grand Duke Ulder Ravengard of Baldur's Gate. The fort will not fall on my watch!\"\nFlaw. \"It's a ghoul-eat-you world out here. I have no pity for those who can't defend themselves.\"\nSource: Tomb of Annihilation p. 227, Baldur's Gate: Descent Into Avernus"
}