{
  "name": "Living Blade of Disaster",
  "size": "S",
  "type": "construct",
  "alignment": "Chaotic Evil",
  "ac": "14 (natural armor)",
  "hp": "67 (9d6+36)",
  "speed": "walk 0 ft., fly 30 ft.",
  "str": "10",
  "dex": "16",
  "con": "19",
  "int": "6",
  "wis": "10",
  "cha": "3",
  "passive": "10",
  "cr": "8",
  "immune": "poison; bludgeoning, piercing, slashing from nonmagical attacks",
  "conditionImmune": "blinded, deafened, exhaustion, grappled, paralyzed, petrified, poisoned, restrained, unconscious",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Magic Resistance",
      "text": [
        "The living spell has advantage on saving throws against spells and other magical effects."
      ]
    },
    {
      "name": "Unfettered",
      "text": [
        "The living spell can move through any barrier, even a wall of magical force."
      ]
    },
    {
      "name": "Unusual Nature",
      "text": [
        "The living spell doesn't require air, food, drink, or sleep."
      ]
    }
  ],
  "action": [
    {
      "name": "Force Blade",
      "text": [
        "Melee Spell Attack: +6 to hit, reach 5 ft., one target. 26 (4d12) force damage, unless the living spell rolled an 18 or higher on the d20 for the attack, in which case the attack is a critical hit that deals 78 (12d12) force damage instead."
      ],
      "attack": [
        "Force Blade|+6|4d12"
      ]
    }
  ],
  "reaction": [
    {
      "name": "Preemptive Strike",
      "text": [
        "The living spell makes a melee attack against a creature that starts its turn within 5 feet of the living spell."
      ]
    }
  ],
  "description": "A living blade of disaster is a blade of disaster spell (see appendix D) with a wicked will of its own. It looks like a floating, black planar rift in the shape of a sword. Like a demon, it craves destruction.\nAreas of wild magic and sites that have been ravaged by powerful eldritch forces can give rise to spell effects that become living beings. These so-called living spells haunt the places where they were created, subsisting on ambient magical energy.\nSource: Icewind Dale: Rime of the Frostmaiden p. 299"
}