{
  "name": "Mountain Giant",
  "size": "G",
  "type": "giant",
  "alignment": "Neutral Evil",
  "ac": "20 (natural armor)",
  "hp": "313 (12d20+114)",
  "speed": "walk 50 ft.",
  "str": "26",
  "dex": "10",
  "con": "22",
  "int": "14",
  "wis": "20",
  "cha": "10",
  "save": "Con +13, Int +9, Wis +12, Cha +7",
  "skill": "Athletics +15, Perception +12",
  "passive": "22",
  "languages": "Common, Giant, Terran",
  "cr": "21",
  "immune": "cold, fire, lightning, thunder, bludgeoning",
  "conditionImmune": "charmed, frightened, paralyzed, petrified, stunned",
  "senses": "tremorsense 120 ft.",
  "trait": [
    {
      "name": "Legendary Resistance (2/Day)",
      "text": [
        "If the mountain giant fails a saving throw, it can choose to succeed instead."
      ]
    },
    {
      "name": "Magic Resistance",
      "text": [
        "A mountain giant has advantage on saving throws against spells and other magical effects."
      ]
    },
    {
      "name": "Mountain Master",
      "text": [
        "The mountain giant can move and shape the terrain around it. This trait works like the move earth spell, except it has no duration, and the giant can manipulate any stone, natural or worked."
      ]
    },
    {
      "name": "Siege Monster",
      "text": [
        "The mountain giant deals triple damage to objects and structures with its melee and ranged weapon attacks."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The mountain giant makes two slam attacks."
      ]
    },
    {
      "name": "Slam",
      "text": [
        "Melee Weapon Attack: +15 to hit, reach 20 ft., one target. 21 (2d12 + 8) bludgeoning damage."
      ],
      "attack": [
        "Slam|15|2d12+8"
      ]
    },
    {
      "name": "Boulder",
      "text": [
        "Ranged Weapon Attack: +15 to hit, range 100/400 ft., one target. 40 (5d12 + 8) bludgeoning damage."
      ],
      "attack": [
        "Boulder|15|5d12+8"
      ]
    },
    {
      "name": "Boulder Spray (Recharge 5-6)",
      "text": [
        "The mountain giant unleashes a barrage of boulders in a 60-foot cone. Each creature in that area must make a DC 22 Dexterity saving throw. On a failure, a creature takes 58 (9d12) bludgeoning damage and is knocked prone and restrained. On a success, the creature takes half the damage and isn't knocked prone or restrained. A target, including the restrained creature can take an action to make a DC 20 Strength (Athletics) or Dexterity (Acrobatics) check, freeing the restrained creature on a success."
      ]
    }
  ],
  "legendary": [
    {
      "text": [
        "The giant can take 4 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The giant regains spent legendary actions at the start of its turn."
      ]
    },
    {
      "name": "Options",
      "text": [
        "A mountain giant can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The mountain giant regains spent legendary actions at the start of its turn."
      ]
    },
    {
      "name": "Grasping Soil",
      "text": [
        "The mountain giant commands the earth itself to assist in the fight. The giant chooses three creatures it can see within 60 feet. Each target must succeed on a DC 21 Dexterity saving throw or be restrained until the start of its next turn."
      ]
    },
    {
      "name": "Roar (Costs 2 Actions)",
      "text": [
        "The mountain giant emits a tremendous growl. Each creature within 20 feet of the giant must make a DC 21 Constitution saving throw. On a failure, a creature takes 21 (6d6) thunder damage and is knocked prone.",
        "On a success, a creature takes half the damage and isn't knocked prone."
      ]
    },
    {
      "name": "Spawn Elemental (Costs 3 Actions)",
      "text": [
        "rA piece of the mountain giant's body tears away in the form of an earth elemental. The earth elemental acts on the same initiative count as the mountain giant, obeying the mountain giant's commands and fighting until destroyed. The mountain giant can have no more than five earth elementals under its control at one time."
      ]
    }
  ],
  "description": "Source: CCodex (3pp)"
}