{
  "name": "Mud Mephit",
  "size": "S",
  "type": "elemental",
  "alignment": "Neutral Evil",
  "ac": "11",
  "hp": "27 (6d6+6)",
  "speed": "walk 20 ft., fly 20 ft., swim 20 ft.",
  "str": "8",
  "dex": "12",
  "con": "12",
  "int": "9",
  "wis": "11",
  "cha": "7",
  "skill": "Stealth +3",
  "passive": "10",
  "languages": "Aquan, Terran",
  "cr": "1/4",
  "immune": "poison",
  "conditionImmune": "poisoned",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Death Burst",
      "text": [
        "When the mephit dies, it explodes in a burst of sticky mud. Each Medium or smaller creature within 5 feet of it must succeed on a DC 11 Dexterity saving throw or be restrained until the end of the creature's next turn."
      ]
    },
    {
      "name": "False Appearance",
      "text": [
        "While the mephit remains motionless, it is indistinguishable from an ordinary mound of mud."
      ]
    }
  ],
  "action": [
    {
      "name": "Fists",
      "text": [
        "Melee Weapon Attack: +3 to hit, reach 5 ft., one creature. 4 (1d6 + 1) bludgeoning damage."
      ],
      "attack": [
        "Fists|+3|1d6+1"
      ]
    },
    {
      "name": "Mud Breath (Recharge 6)",
      "text": [
        "The mephit belches viscid mud onto one creature within 5 feet of it. If the target is Medium or smaller, it must succeed on a DC 11 Dexterity saving throw or be restrained for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
      ]
    },
    {
      "name": "Variant: Summon Mephits (1/Day)",
      "text": [
        "The mephit has a 25 chance of summoning 1d4 mephits of its kind. A summoned mephit appears in an unoccupied space within 60 feet of its summoner, acts as an ally of its summoner, and can't summon other mephits. It remains for 1 minute, until it or its summoner dies, or until its summoner dismisses it as an action."
      ]
    }
  ],
  "description": "Elemental Nature. A mephit doesn't require food, drink, or sleep.\nSource: Monster Manual p. 216, Princes of the Apocalypse, Tomb of Annihilation, Waterdeep: Dungeon of the Mad Mage, Ghosts of Saltmarsh",
  "environment": "swamp"
}