{
  "name": "Môrgæn",
  "size": "M",
  "type": "humanoid (elf)",
  "alignment": "Chaotic Neutral",
  "ac": "16 (studded leather armor)",
  "hp": "66 (12d8+12)",
  "speed": "walk 30 ft.",
  "str": "12",
  "dex": "18",
  "con": "12",
  "int": "12",
  "wis": "14",
  "cha": "10",
  "save": "Str +3, Dex +6",
  "skill": "Athletics +3, Insight +4, Nature +3, Perception +4, Stealth +6, Survival +4",
  "passive": "14",
  "languages": "Common, Draconic, Dwarvish, Giant, Goblin",
  "cr": "4",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Fey Ancestry",
      "text": [
        "Môrgæn has advantage on saving throws against being charmed, and magic can't put her to sleep."
      ]
    },
    {
      "name": "Innate Spellcasting",
      "text": [
        "Môrgæn's spellcasting ability is Intelligence. She can innately cast the following spells, requiring no material components:",
        "At will: mage hand"
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "Môrgæn is a 9th-level spellcaster. Her spellcasting ability is Wisdom (spell save DC 12, +4 to hit with spell attacks). She has the following ranger spells prepared:",
        "• 1st level (4 slots): alarm, animal friendship, hunter's mark",
        "• 2nd level (3 slots): pass without trace, spike growth",
        "• 3rd level (2 slots): conjure animals"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "Môrgæn makes three attacks with her scimitars or her longbow."
      ]
    },
    {
      "name": "Scimitars",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 7 (1d6 + 4) slashing damage."
      ],
      "attack": [
        "Scimitars|+6|1d6+4"
      ]
    },
    {
      "name": "Longbow",
      "text": [
        "Ranged Weapon Attack: +6 to hit, range 150/600 ft., one target. 8 (1d8 + 4) piercing damage."
      ],
      "attack": [
        "Longbow|+6|1d8+4"
      ]
    }
  ],
  "slots": [
    "4, 3, 2"
  ],
  "spells": "mage hand, alarm, animal friendship, hunter's mark, pass without trace, spike growth, conjure animals",
  "description": "\nIf I had wanted to kill, I would have killed.\n\nThe ranger Môrgæn is a renowned tracker and hunter, able to pinpoint-target foes at any range, then vanish into the woods with no one the wiser. Her legendary ability with the longbow and the custom arrows she crafts instills fear into the hearts of her many enemies-and more than a few of her coworkers. Famously, she is the only member of Acquisitions Incorporated known to be paid in advance, lest a missed invoice lead to dire repercussions.\nA child of the forest, Môrgæn defends the natural world with singular ferocity and an impressive rate of sustained fire. Her core philosophy is that one should shoot first and then ask no questions later. Because what's the point of asking questions when the person you've shot first is already dead? Still, when the situation calls for it, this protector of the woodlands is equally at home on missions of subterfuge and social interaction in the big city, provided her well-known love of ale, wine, and other intoxicants doesn't get the better of her.\nSource: Acquisitions Incorporated p. 199"
}