{
  "name": "Nachzehrer",
  "size": "M",
  "type": "undead",
  "alignment": "Chaotic Evil",
  "ac": "15 (natural armor)",
  "hp": "136 (16d8+64)",
  "speed": "walk 30 ft., burrow 15 ft.",
  "str": "20",
  "dex": "12",
  "con": "18",
  "int": "10",
  "wis": "15",
  "cha": "9",
  "skill": "Stealth +7",
  "passive": "12",
  "languages": "The languages it knew in life",
  "cr": "8",
  "immune": "necrotic, poison",
  "conditionImmune": "charmed, exhaustion, frightened, poisoned",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Grave Pox",
      "text": [
        "A creature infected with grave pox becomes vulnerable to necrotic damage and gains one level of exhaustion that can't be removed until the disease is cured. Additionally, the creature cannot reduce its exhaustion by finishing a long rest.",
        "The infected creature is highly contagious. Each creature that touches it, or that is within 10 feet of it when it finishes a long rest, must succeed on a DC 12 Constitution saving throw or also contract grave pox.",
        "When an infected creature finishes a long rest, it must succeed on a DC 16 Constitution saving throw or gain one level of exhaustion. As the disease progresses, the infected creature becomes weaker and develops painful green pustules all over its skin. A creature that succeeds on two saving throws against the disease recovers from it. The cured creature is no longer vulnerable to necrotic damage and can remove exhaustion levels as normal."
      ]
    },
    {
      "name": "Weakening Shadow",
      "text": [
        "A creature other than a construct or undead has disadvantage on attack rolls, saving throws, and ability checks based on Strength while within 5 feet of the nachzehrer."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The nachzehrer makes three attacks. two with its fists and one with its bite."
      ]
    },
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +8 to hit, reach 5 ft., one creature. 7 (1d4 + 5) piercing damage plus 13 (3d8) necrotic damage.",
        "The target's hp maximum is reduced by an amount equal to the necrotic damage taken, and the nachzehrer regains hp equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hp maximum to 0.",
        "The target must succeed on a DC 16 Constitution saving throw or become infected with the grave pox disease (see the Grave Pox trait)."
      ],
      "attack": [
        "Bite|8|1d4+5"
      ]
    },
    {
      "name": "Fist",
      "text": [
        "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. 12 (2d6 + 5) bludgeoning damage."
      ],
      "attack": [
        "Fist|8|2d6+5"
      ]
    }
  ],
  "description": "Source: CCodex (3pp)"
}