{
  "name": "Naxene Drathkala",
  "size": "M",
  "type": "humanoid (Turamihuman)",
  "alignment": "Neutral Good",
  "ac": "10 (13 with mage armor)",
  "hp": "27 (6d8)",
  "speed": "walk 30 ft.",
  "str": "8",
  "dex": "11",
  "con": "11",
  "int": "17",
  "wis": "12",
  "cha": "11",
  "skill": "Arcana +5, History +5",
  "passive": "11",
  "languages": "Common, Draconic, Dwarvish, Elvish",
  "cr": "0",
  "trait": [
    {
      "name": "Roleplaying Information",
      "text": [
        "Goldenfields' crops are vital Waterdeep's survival, which is why the Watchful Order of Magists and Protectors sent Naxene to make sure the temple-farm is adequately defended. At first she regarded the task as a punishment, but now she appreciates the peace and quiet.",
        "Ideal: \"There's no problem that can't be solved with magic.\"",
        "Bond: \"I have great respect for Lady Laeral Silverhand of Waterdeep. She and the Lords' Alliance are going to bring some much-needed order to this lawless land.\"",
        "Flaw: \"I'm too smart to be wrong about anything.\""
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "Naxene is a 6th level spellcaster. Her spellcasting ability is Intelligence (spell save DC 13; +5 to hit with spell attacks). She has the following wizard spells prepared:",
        "Cantrips (at will): fire bolt, light, mage hand, prestidigitation",
        "• 1st level (4 slots): mage armor, magic missile, shield",
        "• 2nd level (3 slots): misty step, suggestion",
        "• 3rd level (3 slots): fly, lightning bolt"
      ]
    }
  ],
  "action": [
    {
      "name": "Staff",
      "text": [
        "Melee Weapon Attack: +1 to hit, reach 5 ft., one creature. 2 (1d6 - 1) bludgeoning damage, or 3 (1d8 - 1) bludgeoning damage if used with two hands."
      ],
      "attack": [
        "Staff|+1|1d6-1"
      ]
    }
  ],
  "slots": [
    "4, 3, 3"
  ],
  "spells": "fire bolt, light, mage hand, prestidigitation, mage armor, magic missile, shield, misty step, suggestion, fly, lightning bolt",
  "description": "Goldenfields' crops are vital to Waterdeep's survival, which is why the Watchful Order of Magists and Protectors sent Naxene to make sure the temple-farm is adequately defended. At first she regarded the task as a punishment, but now she appreciates the peace and quiet.\nIdeal:\"There's no problem that can't be solved with magic.\"\nBond:\"I have great respect for Lady Laeral Silverhand of Waterdeep. She and the Lords' Alliance are going to bring some much-needed order to this lawless land.\"\nFlaw:\"I'm too smart to be wrong about anything.\"\nSource: Storm King's Thunder p. 252"
}