{
  "name": "Nergaliid",
  "size": "L",
  "type": "fiend (devil)",
  "alignment": "Lawful Evil",
  "ac": "12 (natural armor)",
  "hp": "42 (4d10+20)",
  "speed": "walk 30 ft.",
  "str": "18",
  "dex": "12",
  "con": "20",
  "int": "12",
  "wis": "10",
  "cha": "12",
  "skill": "Deception +5, Perception +2, Stealth +5",
  "passive": "12",
  "languages": "Common, Infernal",
  "cr": "3",
  "resist": "cold; bludgeoning, piercing, slashing from nonmagical attacks that aren't silvered",
  "immune": "fire, poison",
  "conditionImmune": "poisoned",
  "senses": "darkvision 120 ft.",
  "trait": [
    {
      "name": "Shadow Stealth",
      "text": [
        "While in dim light or darkness, the nergaliid can take the Hide action as a bonus action."
      ]
    },
    {
      "name": "Standing Leap",
      "text": [
        "The nergaliid's long jump is up to 30 feet and its high jump is up to 20 feet, with or without a running start."
      ]
    }
  ],
  "action": [
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one creature. 13 (2d8 + 4) piercing damage, and the target must succeed on a DC 15 Constitution saving throw or become poisoned for 1 minute. The poisoned creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
      ],
      "attack": [
        "Bite|+6|2d8+4"
      ]
    },
    {
      "name": "Tongue Lash",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 20 ft., one target. 10 (1d12 + 4) bludgeoning damage."
      ],
      "attack": [
        "Tongue Lash|+6|1d12+4"
      ]
    },
    {
      "name": "Siphon Life (Recharge 4-6)",
      "text": [
        "The nergaliid magically draws the life from a humanoid it can see within 40 feet of it. The target must make a DC 15 Wisdom saving throw. An incapacitated target fails the save automatically. On a failed save, the creature takes 10 (3d6) psychic damage, and the nergaliid gains temporary hit points equal to the damage taken. On a successful save, the target takes half as much damage, and the nergaliid doesn't gain temporary hit points. If this damage kills the target, its body rises at the end of the nergaliid's current turn as a husk zombie (see earlier in this chapter)."
      ],
      "attack": [
        "Siphon Life (Recharge 4-6)||3d6"
      ]
    }
  ],
  "description": "Corpulent, scaled, and utterly repulsive, these vicious devils stalk the dark edges of society away from prying eyes, subsisting on the life force of unsuspecting humanoids. Creatures that die to the nergaliid's feeding leave a corrupted undead corpse behind known as a husk zombie (see earlier in this chapter).\nThe nergaliid favors feeding on the life force of sleeping humanoids, feasting on the same prey nightly—so long as its victim remains unaware. This ensures a lasting source of nourishment, with the victim beset by terrible nightmares as long as the feeding continues. When a nergaliid is discovered, it tries to strike a deal with the one who uncovered it. It might offer material wealth in exchange for freedom and silence. Only when an accord seems unlikely does the nergaliid attack.\nSource: Explorer's Guide to Wildemount p. 296"
}