{
  "name": "Nerozar the Defeated",
  "size": "L",
  "type": "undead",
  "alignment": "Neutral Evil",
  "ac": "15 (natural armor)",
  "hp": "93 (11d10+33)",
  "speed": "walk 0 ft., fly 20 ft.",
  "str": "10",
  "dex": "8",
  "con": "16",
  "int": "3",
  "wis": "8",
  "cha": "5",
  "save": "Wis +2",
  "passive": "9",
  "languages": "understands Deep Speech and Undercommon but can't speak",
  "cr": "5",
  "immune": "poison",
  "conditionImmune": "poisoned, prone",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Undead Fortitude",
      "text": [
        "If damage reduces Nerozar to 0 hit points, it must make a Constitution saving throw with a DC of 5 + the damage taken, unless the damage is radiant or from a critical hit. On a success, Nerozar drops to 1 hit point instead."
      ]
    }
  ],
  "action": [
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 14 (4d6) piercing damage."
      ],
      "attack": [
        "Bite|+3|4d6"
      ]
    },
    {
      "name": "Eye Ray",
      "text": [
        "The zombie uses a random magical eye ray, choosing a target that it can see within 60 feet of it.",
        "1. Paralyzing Ray. The targeted creature must succeed on a DC 14 Constitution saving throw or be paralyzed for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
        "2. Fear Ray. The targeted creature must succeed on a DC 14 Wisdom saving throw or be frightened for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
        "3. Enervation Ray. The targeted creature must make a DC 14 Constitution saving throw, taking 36 (8d8) necrotic damage on a failed save, or half as much damage on a successful one.",
        "4. Telekinetic Ray. If the target is a creature, it must succeed on a DC 14 Strength saving throw, or the zombie moves it up to 30 feet in any direction. It is restrained by the ray's telekinetic grip until the start of the zombie's next turn or until the zombie is incapacitated. If the target is an object weighing 300 pounds or less that isn't being worn or carried, it is moved up to 30 feet in any direction. The zombie can also exert fine control on objects with this ray, such as manipulating a simple tool or opening a door or container."
      ],
      "attack": [
        "Eye Ray||8d8"
      ]
    }
  ],
  "description": "\nSource: Waterdeep: Dungeon of the Mad Mage p. 52",
  "environment": "underdark"
}