{
  "name": "Nightwalker",
  "size": "H",
  "type": "undead",
  "alignment": "Chaotic Evil",
  "ac": "14",
  "hp": "297 (22d12+154)",
  "speed": "walk 40 ft., fly 40 ft.",
  "str": "22",
  "dex": "19",
  "con": "24",
  "int": "6",
  "wis": "9",
  "cha": "8",
  "save": "Con +13",
  "passive": "9",
  "cr": "20",
  "resist": "acid, cold, fire, lightning, thunder; bludgeoning, piercing, slashing from nonmagical attacks",
  "immune": "necrotic, poison",
  "conditionImmune": "exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained",
  "senses": "darkvision 120 ft.",
  "trait": [
    {
      "name": "Annihilating Aura",
      "text": [
        "Any creature that starts its turn within 30 feet of the nightwalker must succeed on a DC 21 Constitution saving throw or take 14 (4d6) necrotic damage and grant the nightwalker advantage on attack rolls against it until the start of the creature's next turn. Undead are immune to this aura."
      ]
    },
    {
      "name": "Life Eater",
      "text": [
        "A creature reduced to 0 hit points from damage dealt by the nightwalker dies and can't be revived by any means short of a wish spell."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The nightwalker uses Enervating Focus twice, or it uses Enervating Focus and Finger of Doom, if available."
      ]
    },
    {
      "name": "Enervating Focus",
      "text": [
        "Melee Weapon Attack: +12 to hit, reach 15 ft., one target. 28 (5d8 + 6) necrotic damage. The target must succeed on a DC 21 Constitution saving throw or its hit point maximum is reduced by an amount equal to the necrotic damage taken. This reduction lasts until the target finishes a long rest."
      ],
      "attack": [
        "Enervating Focus|+12|5d8+6"
      ]
    },
    {
      "name": "Finger of Doom (Recharge 6)",
      "text": [
        "The nightwalker points at one creature it can see within 300 feet of it. The target must succeed on a DC 21 Wisdom saving throw or take 26 (4d12) necrotic damage and become frightened until the end of the nightwalker's next turn. While frightened in this way, the creature is also paralyzed. If a target's saving throw is successful, the target is immune to the nightwalker's Finger of Doom for the next 24 hours."
      ],
      "attack": [
        "Finger of Doom (Recharge 6)||4d12"
      ]
    }
  ],
  "description": "Nightwalker. The Negative Plane is a place of darkness and death, anathema to all living things. Yet there are those who would tap into its fell power, to use its energy for sinister ends. Most often, when such individuals approach the midnight realm, they find they are unequal to the task. Those not destroyed outright are sometimes drawn inside the plane and replaced by nightwalkers, terrifying undead creatures that devour all life they encounter.\nMighty Spawn. One can reach the Negative Plane from the Shadowfell, much in the same way that it is possible to step from the Material Plane into the Shadowfell in a place where the barrier between the planes is thin.\nStepping into the Negative Plane is tantamount to suicide, since the plane sucks the life and soul from such audacious creatures and annihilates them at once. Those few who survive the effort do so by sheer luck or by harnessing some rare form of magic that protects them against the hostile atmosphere. They soon discover, however, that they can't leave as easily as they arrived. For each creature that enters the plane, a nightwalker is released to take its place. In order for a trapped creature to escape, the released nightwalker must be lured back to the Negative Plane by offerings of life for it to devour. If the nightwalker is destroyed, the trapped creature has no hope of escape.\nBeings of Anti-Life. One can discern the nature of creatures trapped in the Negative Plane from the sites that nightwalkers frequent. Generally, a nightwalker on the Material Plane is attracted to elements of the world associated with the creature responsible for its creation. Such interest doesn't indicate a willingness to engage with the world; nightwalkers exist to make life extinct and never to serve living things.\nUndead Nature. A nightwalker doesn't require air, food, drink, or sleep.\nSource: Mordenkainen's Tome of Foes p. 216",
  "environment": "arctic, desert, swamp, underdark"
}