{
  "name": "Orc Claw of Luthic",
  "size": "M",
  "type": "humanoid (orc)",
  "alignment": "Chaotic Evil",
  "ac": "14 (hide armor)",
  "hp": "45 (6d8+18)",
  "speed": "walk 30 ft.",
  "str": "14",
  "dex": "15",
  "con": "16",
  "int": "10",
  "wis": "15",
  "cha": "11",
  "skill": "Intimidation +2, Medicine +4, Survival +4",
  "passive": "12",
  "languages": "Common, Orc",
  "cr": "2",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Aggressive",
      "text": [
        "As a bonus action, the orc can move up to its speed toward a hostile creature that it can see."
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "The orc is a 5th-level spellcaster. Its spellcasting ability is Wisdom (spell save DC 12, +4 to hit with spell attacks). The orc has the following cleric spells prepared:",
        "Cantrips (at will): guidance, mending, resistance, thaumaturgy",
        "• 1st level (4 slots): bane, cure wounds, guiding bolt",
        "• 2nd level (3 slots): augury, warding bond",
        "• 3rd level (2 slots): bestow curse, create food and water"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The orc makes two claw attacks, or four claw attacks if it has fewer than half of its hit points remaining."
      ]
    },
    {
      "name": "Claw",
      "text": [
        "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 6 (1d8 + 2) slashing damage."
      ],
      "attack": [
        "Claw|+4|1d8+2"
      ]
    }
  ],
  "slots": [
    "4, 3, 2"
  ],
  "spells": "guidance, mending, resistance, thaumaturgy, bane, cure wounds, guiding bolt, augury, warding bond, bestow curse, create food and water",
  "description": "To the common folk of the world, an orc is an orc. They know that any one of these savages can tear an ordinary person to pieces, so no further distinction is necessary.\nOrcs know better. Different groups of orcs exist within a tribe, the actions of each dictated by the deity they pay homage to. To complement the various kinds of warriors that spill forth to ravage the countryside, each tribe has members that remain deep inside the lair, seldom if ever seeing what lies outside the darkness of their den.\nIn addition, orcs have special relationships with two creatures that are sometimes found in their company: the aurochs, a great bull that serves as a mount for warriors that revere Bahgtru, and the tanarukk, a demon-orc crossbreed that is so depraved and destructive that even orcs seek to kill it. The aurochs is described in appendix A. The tanarukk is described below.\nOrc Claw of Luthic. Luthic is Gruumsh's wife and the paragon of maternity to all orcs. She is the Cave Mother, a fierce dweller in the darkness who raises new broods of orcs to be vicious and strong. Her symbol is the cave bear, and orc females raise such bears alongside orc whelps. Females particularly attracted to Luthic grow long nails and lacquer them, learning to use these claws as weapons much as Luthic uses her own.\nOrc females devoted to Luthic are in charge of fortifying and maintaining an orc stronghold. They help to guarantee the survival of the tribe, and most are skilled in the healing arts. The most powerful among Luthic's disciples are the claws of Luthic, which can use the Cave Mother's magic to heal, protect, and curse.\nSource: Volo's Guide to Monsters p. 183",
  "environment": "underdark, mountain"
}