{
  "name": "Orc Nurtured One of Yurtrus",
  "size": "M",
  "type": "humanoid (orc)",
  "alignment": "Chaotic Evil",
  "ac": "9",
  "hp": "30 (4d8+12)",
  "speed": "walk 30 ft.",
  "str": "15",
  "dex": "8",
  "con": "16",
  "int": "7",
  "wis": "11",
  "cha": "7",
  "passive": "10",
  "languages": "Common, Orc",
  "cr": "1/2",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Aggressive",
      "text": [
        "As a bonus action, the orc can move up to its speed toward a hostile creature that it can see."
      ]
    },
    {
      "name": "Corrupted Carrier",
      "text": [
        "When the orc is reduced to 0 hit points, it explodes, and any creature within 10 feet of it must make a DC 13 Constitution saving throw. On a failed save, the creature takes 14 (4d6) poison damage and becomes poisoned. On a success, the creature takes half as much damage and isn't poisoned. A creature poisoned by this effect can repeat the save at the end of each of its turn, ending the effect on itself on a success. While poisoned by this effect, a creature can't regain hit points."
      ]
    },
    {
      "name": "Nurtured One of Yurtrus",
      "text": [
        "The orc has advantage on saving throws against poison and disease."
      ]
    }
  ],
  "action": [
    {
      "name": "Claws",
      "text": [
        "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 4 (1d4 + 2) slashing damage plus 2 (1d4) necrotic damage."
      ],
      "attack": [
        "Claws|+4|1d4+2"
      ]
    },
    {
      "name": "Corrupted Vengeance",
      "text": [
        "The orc reduces itself to 0 hit points, triggering its Corrupted Carrier trait."
      ]
    }
  ],
  "description": "To the common folk of the world, an orc is an orc. They know that any one of these savages can tear an ordinary person to pieces, so no further distinction is necessary.\nOrcs know better. Different groups of orcs exist within a tribe, the actions of each dictated by the deity they pay homage to. To complement the various kinds of warriors that spill forth to ravage the countryside, each tribe has members that remain deep inside the lair, seldom if ever seeing what lies outside the darkness of their den.\nIn addition, orcs have special relationships with two creatures that are sometimes found in their company: the aurochs, a great bull that serves as a mount for warriors that revere Bahgtru, and the tanarukk, a demon-orc crossbreed that is so depraved and destructive that even orcs seek to kill it. The aurochs is described in appendix A. The tanarukk is described below.\nOrc Nurtured One of Yurtrus. When plague strikes a tribe, the hands of Yurtrus isolate the sick. The priests then minister to those who can be saved but not healed. The hands cultivate the sickness of these nurtured ones, turning them into instruments of defense and weapons of war. When orcs go to battle, a band of nurtured ones might charge in first-to give themselves up while softening up the enemy by spreading Yurtrus's vile blessing in its ranks.\nSource: Volo's Guide to Monsters p. 184",
  "environment": "underdark, mountain, grassland, forest, hill"
}