{
  "name": "Parzelon, King Of Secrets",
  "size": "H",
  "type": "fiend (devil)",
  "alignment": "Lawful Evil",
  "ac": "20 (natural armor)",
  "hp": "378 (28d12+196)",
  "speed": "walk 40 ft.",
  "str": "20",
  "dex": "18",
  "con": "24",
  "int": "26",
  "wis": "22",
  "cha": "18",
  "save": "Dex +12, Con +15, Wis +14, Cha +12",
  "skill": "Animal handling +14, Arcana +24, History +24, Intimidation +12, Investigation +16, Medicine +22, Perception +14, Persuasion +12, Religion +24",
  "passive": "24",
  "languages": "All, telepathy 120 ft.",
  "cr": "25",
  "resist": "cold, lightning, psychic",
  "immune": "fire, poison; bludgeoning, piercing, slashing from nonmagical weapons",
  "conditionImmune": "charmed, exhaustion, frightened, poisoned",
  "senses": "truesight 120 ft.",
  "trait": [
    {
      "name": "Fear Aura",
      "text": [
        "Any creature hostile to Parzelon that starts its turn within 20 feet of him must make a DC 20 Wisdom saving throw, unless Parzelon is incapacitated. On a failed save, the creature is frightened until the start of its next turn. If a creature's saving throw is successful, the creature is immune to Parzelon's Fear Aura for the next 24 hours."
      ]
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "text": [
        "If Parzelon fails a saving throw, he can choose to succeed instead."
      ]
    },
    {
      "name": "Magic Resistance",
      "text": [
        "Parzelon has advantage on saving throws against spells and other magical effects."
      ]
    },
    {
      "name": "Magic Weapons",
      "text": [
        "Parzelon's weapon attacks are magical."
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "The parzelon, king of secrets is a 20th-level spellcaster. Its spellcasting ability is (spell save DC 24, +16 to hit with spell attacks). He requires no material components to cast his spells. The parzelon, king of secrets has the following Wizard spells prepared:",
        "Cantrips (at will): fire bolt, minor illusion, prestidigitation, ray of frost, shocking grasp",
        "• 1st level (4 slots): charm person, detect magic, disguise self, magic missile, sleep",
        "• 2nd level (3 slots): darkness, hold person, locate object, suggestion",
        "• 3rd level (3 slots): bestow curse, clairvoyance, haste, lightning bolt",
        "• 4th level (3 slots): dimension door, greater invisibility, locate creature, phantasmal killer, polymorph",
        "• 5th level (3 slots): dominate person, scrying, telekinesis, wall of force",
        "• 6th level (2 slots): chain lightning, disintegrate",
        "• 7th level (2 slots): plane shift, prismatic spray",
        "• 8th level (1 slots): feeblemind",
        "• 9th level (1 slots): foresight"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "Parzelon makes two melee attacks."
      ]
    },
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +13 to hit, reach 5 ft., one target. Hit.",
        "14 (2d8 + 5) piercing damage plus 14 (4d6) necrotic damage."
      ]
    },
    {
      "name": "Serpentine Lash",
      "text": [
        "Melee Weapon Attack: +13 to hit, reach 10 ft., one target. 15 (4d4 + 5) piercing damage plus 21 (6d6) poison damage."
      ],
      "attack": [
        "Serpentine Lash|13|4d4+5"
      ]
    },
    {
      "name": "Summon Devil (1/Day)",
      "text": [
        "Parzelon summons 1d4 barbed devils or 1d4 spawn of Parzelon. A summoned devil appears in an unoccupied space within 60 feet of Parzelon, acts as an ally, and can't summon other devils. It remains for 1 minute, or until Parzelon dismisses it as an action."
      ]
    }
  ],
  "legendary": [
    {
      "text": [
        "The fiend (devil) can take 4 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The fiend (devil) regains spent legendary actions at the start of its turn."
      ]
    },
    {
      "name": "Options",
      "text": [
        "Parzelon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. Parzelon regains spent legendary actions at the start of his turn."
      ]
    },
    {
      "name": "Serpentine Lash",
      "text": [
        "Parzelon makes one serpentine lash attack."
      ]
    },
    {
      "name": "Spell (Costs 2 Actions)",
      "text": [
        "Parzelon casts one spell."
      ]
    },
    {
      "name": "Horn of Nessus (Costs 3 Actions)",
      "text": [
        "Parzelon blows his accursed, silver horn, which emits a sickening blast in a 30-foot cone that is audible 600 feet away. Each creature in the cone must make a DC 20 Constitution saving throw. On a failure, a creature takes 32 (5d12) poison damage and is incapacitated for 1 minute.",
        "On a success, a creature takes half as much damage and isn't incapacitated. An incapacitated creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
      ]
    }
  ],
  "slots": [
    "4, 3, 3, 3, 3, 2, 2, 1, 1"
  ],
  "spells": "fire bolt, minor illusion, prestidigitation, ray of frost, shocking grasp, charm person, detect magic, disguise self, magic missile, sleep, darkness, hold person, locate object, suggestion, bestow curse, clairvoyance, haste, lightning bolt, dimension door, greater invisibility, locate creature, phantasmal killer, polymorph, dominate person, scrying, telekinesis, wall of force, chain lightning, disintegrate, plane shift, prismatic spray, feeblemind, foresight",
  "description": "Source: CCodex (3pp)"
}