{
  "name": "Philosopher's Ghost",
  "size": "M",
  "type": "ooze",
  "alignment": "Unaligned",
  "ac": "13",
  "hp": "7 (2d4+2)",
  "speed": "walk 40 ft.",
  "str": "9",
  "dex": "17",
  "con": "12",
  "int": "2",
  "wis": "10",
  "cha": "6",
  "passive": "10",
  "cr": "4",
  "resist": "acid, cold; slashing from nonmagical weapons",
  "immune": "fire, poison",
  "conditionImmune": "blinded, charmed, deafened, exhaustion, frightened, prone",
  "senses": "blindsight 60 ft. (blind beyond this radius)",
  "trait": [
    {
      "name": "Illumination",
      "text": [
        "The philosopher's ghost sheds bright light in a 20-foot-radius and dim light for an additional 20 feet."
      ]
    },
    {
      "name": "Persistent Burning Form",
      "text": [
        "The philosopher's ghost can move through a space as narrow as 1 inch wide without squeezing. A creature that touches the ghost or hits it with a melee attack while within 5 feet of it takes 5 (1d10) fire damage. In addition, the philosopher's ghost can enter a hostile creature's space and stop there. The first time it enters a creature's space on a turn, that target takes 5 (1d10) fire damage and catches fire; until a creature takes an action to douse the fire, the target takes 5 (1d10) fire damage at the start of each of its turns."
      ]
    },
    {
      "name": "Siege Monster",
      "text": [
        "The philosopher's ghost deals double damage to objects and structures."
      ]
    },
    {
      "name": "Water Vulnerability",
      "text": [
        "If completely immersed in water, a philosopher's ghost's movement halves each round until it stops moving completely, becoming incapacitated, and contact with it no longer causes damage. As soon as any portion of it is exposed to the air again, it resumes moving at full speed."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The philosopher's ghost makes two burning touch attacks."
      ]
    },
    {
      "name": "Burning Touch",
      "text": [
        "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 8 (2d4 + 3) fire damage. If the target is a creature, it suffers a burning lesion, taking 2 (1d4) fire damage at the start of each of its turns. Any creature can take an action to soothe the burning lesion with a successful DC 12 Wisdom (Medicine) check. The lesion is also soothed if the target receives magical healing."
      ],
      "attack": [
        "Burning Touch|5|2d4+3"
      ]
    }
  ],
  "description": "Source: CCodex (3pp) p. 297"
}