{
  "name": "Rak Tulkhesh",
  "size": "H",
  "type": "fiend",
  "alignment": "Neutral Evil",
  "ac": "23 (natural armor, 25 versus ranged attacks)",
  "hp": "478 (33d12+264)",
  "speed": "walk 40 ft., climb 40 ft., fly 80 ft.",
  "str": "29",
  "dex": "19",
  "con": "27",
  "int": "21",
  "wis": "22",
  "cha": "26",
  "save": "Str +17, Con +16, Wis +14, Cha +16",
  "skill": "Athletics +17, Intimidation +16, Perception +14",
  "passive": "24",
  "languages": "all, telepathy 120 ft.",
  "cr": "28",
  "resist": "cold, fire, lightning",
  "immune": "poison; bludgeoning, piercing, slashing from nonmagical attacks",
  "conditionImmune": "charmed, exhaustion, frightened, paralyzed, poisoned, stunned",
  "senses": "truesight 120 ft.",
  "trait": [
    {
      "name": "Deadly Critical",
      "text": [
        "Rak Tulkhesh scores a critical hit on a roll of 19 or 20 and rolls the damage dice three times, instead of twice."
      ]
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "text": [
        "If Rak Tulkhesh fails a saving throw, he can choose to succeed instead."
      ]
    },
    {
      "name": "Magic Resistance",
      "text": [
        "Rak Tulkhesh has advantage on saving throws against spells and other magical effects."
      ]
    },
    {
      "name": "Whirlwind of Weapons",
      "text": [
        "A magical aura of weapons surrounds Rak Tulkhesh in a 10 foot radius. At the start of each of his turns, any other creature in the aura takes 14 (4d6) force damage."
      ]
    },
    {
      "name": "Innate Spellcasting",
      "text": [
        "Rak Tulkhesh's spellcasting ability is Charisma (spell save DC 24). He can innately cast the following spells, requiring no material components:",
        "At will: detect thoughts, dispel magic, spirit guardians",
        "1/day each: banishing smite, blinding smite, staggering smite"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "Rak Tulkhesh makes four weapon attacks."
      ]
    },
    {
      "name": "Spawned Melee Weapon",
      "text": [
        "Melee Weapon Attack: +17 to hit, reach 10 ft., one target. 28 (3d12 + 9) force damage."
      ],
      "attack": [
        "Spawned Melee Weapon|+17|3d12+9"
      ]
    },
    {
      "name": "Spawned Ranged Weapon",
      "text": [
        "Ranged Weapon Attack: +12 to hit, range 150/600 ft., one target. 17 (3d8 + 4) force damage."
      ],
      "attack": [
        "Spawned Ranged Weapon|+12|3d8+4"
      ]
    },
    {
      "name": "Change Shape",
      "text": [
        "Rak Tulkhesh magically polymorphs into a humanoid, beast, or giant that has a challenge rating no higher than his own, or back into his true form. He reverts to his true form if he dies. Any equipment he is wearing or carrying is absorbed or borne by the new form (his choice).",
        "In a new form, Rak Tulkhesh retains his alignment, hit points, Hit Dice, ability to speak, proficiencies, Legendary Resistance, and Intelligence, Wisdom, and Charisma scores, as well as this action. His statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form."
      ]
    }
  ],
  "legendary": [
    {
      "text": [
        "Rak can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. Rak regains spent legendary actions at the start of its turn."
      ]
    },
    {
      "name": "Attack",
      "text": [
        "Rak Tulkhesh makes one weapon attack."
      ]
    },
    {
      "name": "End Magic (Costs 2 Actions)",
      "text": [
        "Rak Tulkhesh casts dispel magic."
      ]
    },
    {
      "name": "Provoke Rage (Costs 3 Actions)",
      "text": [
        "Each creature within 60 feet of Rak Tulkhesh must succeed on a DC 24 Wisdom saving throw or use its reaction to make a melee weapon attack against a random creature within reach. If no creatures are within reach, it makes a ranged weapon attack against a random creature within range, throwing its weapon if necessary. This attack is made with advantage and gains a +4 bonus to the damage roll."
      ]
    }
  ],
  "spells": "detect thoughts, dispel magic, spirit guardians, banishing smite, blinding smite, staggering smite",
  "description": "Immortal Nature. An overlord doesn't require air, food, drink or sleep. It also can't die permanently. Upon its death, it reforms elsewhere in the multiverse and becomes active again at a time set by the DM.\nIn the first days of the world, the children of Khyber rose from the darkness to reign over Eberron. The greatest among them were the overlords, who held dominion over a world of fear, war, and death until the children of Eberron and Siberys rose up against them. Armies of dragons fought against the fiends of Khyber. And though the overlords couldn't be destroyed, the couatl sacrificed their lives to build a prison of celestial light: a silver flame that bound the overlords in Khyber once more. These bonds have held for countless generations, but the overlords still yearn to break free and reclaim the world above.\nAs long as the overlords are bound by the Silver Flame, they can't physically manifest in the world. But each overlord embodies a particular aspect of evil, which grows in strength as their servants—the fiends known as the Lords of Dust—scheme to unleash their ancient masters. The overlords gain strength when mortals embrace the dark paths laid down for them. And as they grow stronger, they gain more influence.\nSome thirty overlords are bound in Khyber. Two are described here: Rak Tulkhesh and Sul Khatesh, both of whom remain imprisoned and can't take physical form. The stat blocks provided here reflect the powers they would wield if they were ever unleashed upon the world.\nSource: Eberron: Rising from the Last War p. 303"
}