{
  "name": "Reduced-Threat Gray Ooze",
  "size": "M",
  "type": "ooze",
  "alignment": "Unaligned",
  "ac": "8",
  "hp": "11 (3d8+9)",
  "speed": "walk 10 ft., climb 10 ft.",
  "str": "12",
  "dex": "6",
  "con": "16",
  "int": "1",
  "wis": "6",
  "cha": "2",
  "skill": "Stealth +0",
  "passive": "8",
  "cr": "1/4",
  "resist": "acid, cold, fire",
  "conditionImmune": "blinded, charmed, deafened, exhaustion, frightened, prone",
  "senses": "blindsight 60 ft. (blind beyond this radius)",
  "trait": [
    {
      "name": "Amorphous",
      "text": [
        "The ooze can move through a space as narrow as 1 inch wide without squeezing."
      ]
    },
    {
      "name": "Corrode Metal",
      "text": [
        "Any nonmagical weapon made of metal that hits the ooze corrodes. After dealing damage, the weapon takes a permanent and cumulative −1 penalty to damage rolls. If its penalty drops to −5, the weapon is destroyed. Nonmagical ammunition made of metal that hits the ooze is destroyed after dealing damage.",
        "The ooze can eat through 2-inch-thick, nonmagical metal in 1 round."
      ]
    },
    {
      "name": "False Appearance",
      "text": [
        "While the ooze remains motionless, it is indistinguishable from an oily pool or wet rock."
      ]
    }
  ],
  "action": [
    {
      "name": "Pseudopod",
      "text": [
        "Melee Weapon Attack: +1 to hit, reach 5 ft., one target. 4 (1d6 + 1) bludgeoning damage plus 7 (2d6) acid damage, and if the target is wearing nonmagical metal armor, its armor is partly corroded and takes a permanent and cumulative −1 penalty to the AC it offers. The armor is destroyed if the penalty reduces its AC to 10."
      ],
      "attack": [
        "Pseudopod|+1|1d6+1"
      ]
    },
    {
      "name": "Variant: Psychic Gray Ooze",
      "text": [
        "A gray ooze that lives a long time can evolve to become more intelligent and develop limited psionic ability. Such occurrences are more common in gray oozes that live near psioncic creatures such as mind flayer, suggesting that the ooze can sense and mimic psionic ability.",
        "A psionic gray ooze has an intelligence score of 6 (-2), as well as the following additional action.",
        "Psychic Crush (Recharge 5-6). The ooze targets one creature that it can sense within 60 feet of it. The target must make a DC +8 Intelligence saving throw, taking 10 (3d6) psychic damage on a failed save, or half as much damage on a successful one."
      ]
    }
  ],
  "legendary": [
    {
      "text": [
        "The ooze can take 0 legendary action, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The ooze regains spent legendary action at the start of its turn."
      ]
    }
  ],
  "description": "\nSource: Tales from the Yawning Portal p. 113",
  "environment": "underdark"
}