{
  "name": "Retriever",
  "size": "L",
  "type": "construct",
  "alignment": "Lawful Evil",
  "ac": "19 (natural armor)",
  "hp": "210 (20d10+100)",
  "speed": "walk 40 ft., climb 40 ft.",
  "str": "22",
  "dex": "16",
  "con": "20",
  "int": "3",
  "wis": "11",
  "cha": "4",
  "save": "Dex +8, Con +10, Wis +5",
  "skill": "Perception +5, Stealth +8",
  "passive": "15",
  "languages": "understands Abyssal, Elvish, and Undercommon but can't speak",
  "cr": "14",
  "immune": "necrotic, poison, psychic; bludgeoning, piercing, slashing from nonmagical attacks that aren't adamantine",
  "conditionImmune": "charmed, exhaustion, frightened, paralyzed, poisoned",
  "senses": "blindsight 30 ft., darkvision 60 ft.",
  "trait": [
    {
      "name": "Faultless Tracker",
      "text": [
        "The retriever is given a quarry by its master. The quarry can be a specific creature or object the master is personally acquainted with, or it can be a general type of creature or object the master has seen before. The retriever knows the direction and distance to its quarry as long as the two of them are on the same plane of existence. The retriever can have only one such quarry at a time. The retriever also always knows the location of its master."
      ]
    },
    {
      "name": "Innate Spellcasting",
      "text": [
        "The retriever's innate spellcasting ability is Wisdom (spell save DC 13). The retriever can innately cast the following spells, requiring no material components.",
        "3/day each: plane shift (only self and up to one incapacitated creature which is considered willing for the spell), web"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The retriever makes two foreleg attacks and uses its force or paralyzing beam once, if available."
      ]
    },
    {
      "name": "Foreleg",
      "text": [
        "Melee Weapon Attack: +11 to hit, reach 10 ft., one target. 15 (2d8 + 6) slashing damage."
      ],
      "attack": [
        "Foreleg|+11|2d8+6"
      ]
    },
    {
      "name": "Force Beam",
      "text": [
        "The retriever targets one creature it can see within 60 feet of it. The target must make a DC 16 Dexterity saving throw, taking 27 (5d10) force damage on a failed save, or half as much damage on a successful one."
      ],
      "attack": [
        "Force Beam||5d10"
      ]
    },
    {
      "name": "Paralyzing Beam (Recharge 5-6)",
      "text": [
        "The retriever targets one creature it can see within 60 feet of it. The target must succeed on a DC 18 Constitution saving throw or be paralyzed for 1 minute. The paralyzed target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
        "If the paralyzed creature is Medium or smaller, the retriever can pick it up as part of the retriever's move and walk or climb with it at full speed."
      ]
    }
  ],
  "spells": "plane shift, web",
  "description": "Retriever. The retriever is a potent, spider-like construct conceived and built by the drow for one original purpose—to prowl the Abyss and capture demons for the drow to enslave or use in their rituals. The automatons proved so effective and so fearsome that they now perform many different missions.\nDemon-Infused. Although each retriever is a metal-and-magic construct, it houses the imprisoned spirit of a bebilith. Most of the demon's intellect has been distilled away, leaving only its cruelty and cunning.\nLethal Collectors. Though they were created to operate only in the Abyss, retrievers are sometimes dispatched when a powerful drow needs some creature or object captured and brought back alive and intact. Only under the rarest of circumstances is a retriever handed over or sold to a non-drow, since the dark elves don't want to take the chance that the construct will be turned against them.\nSource: Mordenkainen's Tome of Foes p. 222",
  "environment": "desert, forest, underdark"
}