{
  "name": "Returned Drifter",
  "size": "M",
  "type": "undead",
  "alignment": "Lawful Neutral",
  "ac": "13 (leather armor)",
  "hp": "11 (2d8+2)",
  "speed": "walk 30 ft.",
  "str": "14",
  "dex": "15",
  "con": "12",
  "int": "10",
  "wis": "12",
  "cha": "11",
  "passive": "11",
  "languages": "the languages it knew in life",
  "cr": "1/4",
  "resist": "necrotic",
  "immune": "poison",
  "conditionImmune": "poisoned",
  "trait": [
    {
      "name": "Turn Resistance",
      "text": [
        "The Returned has advantage on saving throws against any effect that turns undead."
      ]
    },
    {
      "name": "Unreadable Face",
      "text": [
        "The Returned is immune to any effect that would sense its emotions or read its thoughts. Wisdom (Insight) checks to ascertain the Returned's intentions or sincerity are made with disadvantage."
      ]
    }
  ],
  "action": [
    {
      "name": "Scimitar",
      "text": [
        "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 5 (1d6 + 2) slashing damage plus 3 (1d6) poison damage."
      ],
      "attack": [
        "Scimitar|+4|1d6+2"
      ]
    },
    {
      "name": "Sling",
      "text": [
        "Ranged Weapon Attack: +4 to hit, range 30/120 ft., one target. 4 (1d4 + 2) bludgeoning damage."
      ],
      "attack": [
        "Sling|+4|1d4+2"
      ]
    }
  ],
  "description": "Many Returned are pitiable souls who managed to escape from the Underworld only to find themselves stripped of the passions that motivated their flight. Lacking purpose and shunned by the living, these Returned typically seek places where they'll be left in peace, such as lonely tombs or the necropoleis of Asphodel and Odunos. There they go through half-hearted parodies of life, impeded by distraction and ennui. Despite this, even the most languorous Returned defend themselves if threatened and might be pressed into the service of their more willful brethren.\nReturned have escaped the Underworld and dwell among the living once more, but their second lives are rarely what they expected—not that they remember what it was they expected. As a result of having followed the Path of Phenax (see chapter 4), the Returned lose their identities, which manifest as separate beings known as eidolons. The experience of escaping the Underworld also causes them to lose their faces, which become expressionless surfaces with empty eye sockets and gaping mouths. These blank surfaces they cover with distinctive golden masks.\nReturned reenter the world blank and undead. No longer possessing the ability to form long-term memories, they generally can't build meaningful relationships or establish new lives. Instead, most experience fleeting emotions and follow hollow routines, their existences reduced to shadow plays without weight or substance.\nSource: Mythic Odysseys of Theros p. 240"
}