{
  "name": "Ruby Ooze",
  "size": "M",
  "type": "ooze",
  "alignment": "Unaligned",
  "ac": "9",
  "hp": "93 (11d8+44)",
  "speed": "walk 20 ft., climb 20 ft.",
  "str": "14",
  "dex": "8",
  "con": "18",
  "int": "2",
  "wis": "6",
  "cha": "1",
  "passive": "8",
  "cr": "6",
  "resist": "bludgeoning, piercing, slashing from nonmagical weapons",
  "immune": "acid, fire",
  "vulnerable": "lightning",
  "conditionImmune": "blinded, charmed, deafened, exhaustion, frightened, prone",
  "senses": "blindsight 60 ft. (blind beyond this radius)",
  "trait": [
    {
      "name": "Ambusher",
      "text": [
        "The ooze has advantage on attack rolls against any creature it has surprised."
      ]
    },
    {
      "name": "Amorphous",
      "text": [
        "The ooze can move through a space as narrow as 1 inch wide without squeezing."
      ]
    },
    {
      "name": "Corrosive Form",
      "text": [
        "A creature that touches the ooze or hits it with a melee attack while within 5 feet of it takes 7 (2d6) acid damage.",
        "Any nonmagical weapon made of metal or wood that hits the ooze is coated in a corrosive red slime. After dealing damage, the weapon takes a permanent and cumulative -1 penalty to damage rolls. If its penalty drops to -5, the weapon is destroyed.",
        "Nonmagical ammunition made of metal or wood that hits the ooze is destroyed after dealing damage. The ooze can eat through 2-inch-thick, nonmagical wood or metal in 1 round."
      ]
    },
    {
      "name": "False Appearance",
      "text": [
        "While the ooze remains motionless, it is indistinguishable from a pile of rubies."
      ]
    },
    {
      "name": "Spider Climb",
      "text": [
        "The ooze can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The ruby ooze makes two pseudopod attacks."
      ]
    },
    {
      "name": "Pseudopod",
      "text": [
        "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 9 (2d6 + 2) bludgeoning damage plus 14 (4d6) acid damage."
      ],
      "attack": [
        "Pseudopod|5|2d6+2"
      ]
    },
    {
      "name": "Acid Spray (Recharge 5-6)",
      "text": [
        "The ooze sprays its bright red protoplasm in a 20-foot line that is 5 feet wide. Each creature in that line must make a DC 15 Dexterity saving throw. On a failure, the creature takes 21 (6d6) acid damage and is restrained as its flesh begins to turn into a translucent ruby -like stone. On a success, the creature takes half the damage and isn't restrained. The restrained creature must make a DC 15 Constitution saving throw at the end of its next turn, taking 21 (6d6) acid damage and becoming petrified on a failure or ending the effect on a success."
      ]
    }
  ],
  "description": "Source: CCodex (3pp)"
}