{
  "name": "Sailing Ship",
  "size": "G",
  "type": "vehicle (100 ft. x 20 ft.)",
  "alignment": "Unaligned",
  "ac": "15",
  "hp": "300",
  "speed": "5 miles per hour (120 miles per day)",
  "str": "20",
  "dex": "7",
  "con": "17",
  "int": "0",
  "wis": "0",
  "cha": "0",
  "immune": "poison, psychic",
  "conditionImmune": "blinded, charmed, deafened, exhaustion, frightened, incapacitated, paralyzed, petrified, poisoned, prone, stunned, unconscious",
  "trait": [
    {
      "name": "Hit Points",
      "text": [
        "300"
      ]
    },
    {
      "name": "Hull:",
      "text": [
        "Armor Class: 15",
        "Hit Points: 300 (damage threshold 15)"
      ]
    },
    {
      "name": "Control:",
      "text": [
        "Helm",
        "Armor Class: 18",
        "Hit Points: 50",
        "Move up to the speed of its sails, with one 90-degree turn. If the helm is destroyed, the ship can't turn."
      ]
    },
    {
      "name": "Movement:",
      "text": [
        "Sails",
        "Armor Class: 12",
        "Hit Points: 100; -5 ft. speed per 25 damage taken"
      ]
    }
  ],
  "action": [
    {
      "text": [
        "On its turn, the ship can take 3 actions, choosing from the options below. It can take only 2 actions if it has fewer than twenty crew and only 1 action if it has fewer than ten. It can't take these actions if it has fewer than three crew.",
        "• Fire Ballista. The ship can fire its ballista (DMG, ch. 8).",
        "• Fire Mangonel. The ship can fire its mangonel (DMG, ch. 8).",
        "• Move. The ship can use its helm to move with its sails."
      ]
    },
    {
      "name": "Weapons:",
      "text": [
        "Ballista",
        "Armor Class: 15",
        "Hit Points: 50",
        "Ranged Weapon Attack: +6 to hit, range 120/480 ft., one target. 16 (3d10) piercing damage."
      ],
      "attack": [
        "Weapons:|+6|3d10"
      ]
    },
    {
      "name": "Weapons:",
      "text": [
        "Mangonel",
        "Armor Class: 15",
        "Hit Points: 100",
        "Ranged Weapon Attack: +5 to hit, range 200/800 ft. (can't hit targets within 60 ft. of it), one target. 27 (5d10) bludgeoning damage."
      ],
      "attack": [
        "Weapons:|+5|5d10"
      ]
    }
  ],
  "description": "Example Crew\nA sailing ship requires a large crew to properly sail the vessel. If the characters are guests on a sailing ship, the crew consists of the following creatures, all of which have proficiency with water vehicles in addition to their normal statistics:\n• One captain (bandit captain)\n• Four other officers: a first mate, a bosun, a quartermaster, and a cook (noble)\n• Twenty-five sailors (commoner)\n1. Main Deck\nThe main deck of the ship has the following features:\n• Mangonel. Sailing ships have one mangonel (DMG, ch. 8) attached to the deck.  Each weapon has 10 mangonel stones stacked and secured near it.\n• Hatch. A covered, 10-foot-square opening leads to the lower deck (area W8).\n• Railing. The main deck has a 3-foot-high rail around its perimeter that provides half cover for Medium creatures and three-quarters cover for Small creatures behind it.\n• Rowboats. Four rowboat are stacked on top of each other on this deck. Ropes and pulleys can hoist these boats in and out of the water.\n2. Officers' Quarters\nFour beds stand in the officer's quarters. Beneath each is an iron footlocker that holds the officers' belongings. The officers sleep in shifts so someone remains on duty to command the crew and carry out the captain's orders.\n3. Captain's Quarters\nThe captain's quarters hold a bed and a desk. Beneath the bed is an iron footlocker that holds the captain's belongings.\n4. Siege Weapon Ammunition\nShelves and rope on the walls of this cabin secure mangonel stones and ballista arrows.\n5. Supplies\nThis area holds tools, barrels of tar, rope, extra material to repair sails, and other supplies needed to maintain the ship.\n6. Forecastle\nThe forecastle has the following features:\n• Ballista. A ballista (DMG, ch. 8) is attached to the deck. Ten ballista arrows are stacked and secured nearby.\n• Railing. The forecastle has a 3-foot-high rail around its perimeter that provides half cover for Medium creatures and three-quarters cover for Small creatures behind it.\n7. Quarterdeck\nThe quarterdeck has the following features:\n• Railing. The quarterdeck has a 3-foot-high rail around its perimeter that provides half cover for Medium creatures and three-quarters cover for Small creatures behind it.\n• Wheel. The ship's wheel stands at the aft of the quarterdeck.\n8. Oar Deck\nTwenty-two benches are built into the deck of the lower deck, each with a 20-foot-long oar. When the ship is rowed, crew members sit on these benches to work the oars. Ten spare oars hang on the walls of the ship.\n9. Privy\nBenches line the walls of this room. Four holes carved in them house chamber pots.\n10. Medical Cabin\nHooks and shelves on the walls hold medical instruments, bandages, balms, tonics, jars of leeches, and more, ready to treat injuries from combat or sailing mishaps.\n11. Guest Cabin\nThis cabin is meant for guests and visiting high-ranking officials along for the journey.\n12. Hold\nThis area houses both passengers and cargo. The ship's off-duty crew sleep on bedrolls among the crates and barrels of food, water, and other supplies.\n13. Armory\nThe ship's supply of weapons and armor is held in this cabin. Its walls are fitted with built-in weapon and armor racks. The door to this cabin is usually locked, the key kept by one of the ship's officers.\nSource: Ghosts of Saltmarsh p. 192"
}