{
  "name": "Shadow Assassin",
  "size": "M",
  "type": "undead",
  "alignment": "Chaotic Evil",
  "ac": "14",
  "hp": "78 (12d8+24)",
  "speed": "walk 40 ft.",
  "str": "6",
  "dex": "19",
  "con": "14",
  "int": "13",
  "wis": "12",
  "cha": "14",
  "save": "Dex +8, Int +5",
  "skill": "Perception +9, Stealth +12",
  "passive": "19",
  "languages": "understands the languages it knew in life but can't speak",
  "cr": "9",
  "resist": "acid, cold, fire, lightning, thunder; bludgeoning, piercing, slashing from nonmagical attacks",
  "immune": "necrotic, poison",
  "vulnerable": "radiant",
  "conditionImmune": "exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Amorphous",
      "text": [
        "The assassin can move through a space as narrow as 1 inch wide without squeezing."
      ]
    },
    {
      "name": "Shadow Stealth",
      "text": [
        "While in dim light or darkness, the assassin can take the Hide action as a bonus action."
      ]
    },
    {
      "name": "Sunlight Weakness",
      "text": [
        "While in sunlight, the assassin has disadvantage on attack rolls, ability checks, and saving throws."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The assassin makes two Shadow Blade attacks."
      ]
    },
    {
      "name": "Shadow Blade",
      "text": [
        "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. 7 (1d6 + 4) piercing damage plus 10 (3d6) necrotic damage. Unless the target is immune to necrotic damage, the target's Strength score is reduced by 1d4 each time it is hit by this attack. The target dies if its Strength is reduced to 0. The reduction lasts until the target finishes a short or long rest. If a non-evil humanoid dies from this attack, a shadow (see the Monster Manual) rises from the corpse 1d4 hours later."
      ],
      "attack": [
        "Shadow Blade|+8|1d6+4"
      ]
    }
  ],
  "description": "A shadow assassin looks like an undead shadow (as described in theMonster Manual) that wields shortswords also made of shadow. It exists only to slay the living.\nSource: Waterdeep: Dungeon of the Mad Mage p. 316"
}