{
  "name": "Shadow Fey Ambassador",
  "size": "M",
  "type": "humanoid (elf)",
  "alignment": "Lawful Evil",
  "ac": "16 (studded leather armor)",
  "hp": "161 (19d8+76)",
  "speed": "walk 30 ft.",
  "str": "13",
  "dex": "18",
  "con": "18",
  "int": "16",
  "wis": "16",
  "cha": "20",
  "save": "Dex +8, Wis +7",
  "skill": "Arcana +7, Deception +13, Insight +7, Intimidation +9, Perception +7, Persuasion +13",
  "passive": "17",
  "languages": "Common, Elvish",
  "cr": "9",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Fey Ancestry",
      "text": [
        "The shadow fey has advantage on saving throws against being charmed, and magic can't put it to sleep."
      ]
    },
    {
      "name": "Shadow Traveler (5/Day)",
      "text": [
        "As a bonus action while in shadows, dim light, or darkness, the shadow fey disappears into the darkness and reappears in an unoccupied space it can see within 30 feet. A tendril of inky smoke appears at the origin and destination when it uses this trait."
      ]
    },
    {
      "name": "Sunlight Sensitivity",
      "text": [
        "rWhile in sunlight, the shadow fey has disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight."
      ]
    },
    {
      "name": "Traveler In Darkness",
      "text": [
        "The shadow fey has advantage on Intelligence (Arcana) checks made to know about shadow roads and shadow magic spells or items."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The ambassador uses its Withering Stare. It then makes three rapier attacks."
      ]
    },
    {
      "name": "Rapier",
      "text": [
        "Melee Weapon Attack: +8 to hit, reach 5 ft. 8 (1d8 + 4) piercing damage plus 10 (3d6) cold damage."
      ],
      "attack": [
        "Rapier|8|1d8+4"
      ]
    },
    {
      "name": "Honeyed Words (Recharges after a Long Rest)",
      "text": [
        "The silver-tongued shadow fey ambassador weaves together a string of highly persuasive and agreeable words.",
        "Each creature within 30 feet of the ambassador must succeed on a DC 16 Wisdom saving throw or be charmed by the ambassador, regarding it as a wise and trustworthy ally with the creature's best interests at heart. A charmed target doesn't have to obey the ambassador's commands, but it views the ambassador's words in the most favorable way.",
        "Each time a charmed target witnesses the shadow fey ambassador or its allies do something harmful to the target or its companions, it can repeat the saving throw, ending the effect on itself on a success. Otherwise, the effect lasts as long as the ambassador maintains concentration, up to 8 hours."
      ]
    },
    {
      "name": "Withering Stare",
      "text": [
        "The shadow fey ambassador targets one creature it can see within 30 feet of it. If the target can see it, the target must succeed on a DC 16 Wisdom saving throw or be frightened for 1 minute. The frightened target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a target's saving throw is successful or the effect ends for it, the target is immune to the ambassador's Withering Stare for the next 24 hours."
      ]
    }
  ],
  "description": "Source: CCodex (3pp)"
}