{
  "name": "Shapechanged Roper",
  "size": "L",
  "type": "monstrosity",
  "alignment": "Neutral Evil",
  "ac": "20 (natural armor)",
  "hp": "93 (11d10+33)",
  "speed": "walk 10 ft., climb 10 ft.",
  "str": "18",
  "dex": "8",
  "con": "17",
  "int": "7",
  "wis": "16",
  "cha": "6",
  "skill": "Perception +6, Stealth +5",
  "passive": "16",
  "cr": "5",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "False Appearance",
      "text": [
        "While the roper remains motionless, it is indistinguishable from a normal cave formation, such as a stalagmite."
      ]
    },
    {
      "name": "Grasping Tendrils",
      "text": [
        "The roper can have up to six tendrils at a time. Each tendril can be attacked (AC 20; 10 hit points; immunity to poison and psychic damage). Destroying a tendril deals no damage to the roper, which can extrude a replacement tendril on its next turn. A tendril can also be broken if a creature takes an action and succeeds on a DC 15 Strength check against it."
      ]
    },
    {
      "name": "Spider Climb",
      "text": [
        "The roper can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
      ]
    },
    {
      "name": "Shapechanger",
      "text": [
        "The roper can use its action to polymorph into a stone object or back to its true form. Its statistics are the same in each form. Any equipment it is wearing or carrying isn't transformed. It reverts to its true form if it dies."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The roper makes four attacks with its tendrils, uses Reel, and makes one attack with its bite."
      ]
    },
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. 22 (4d8 + 4) piercing damage."
      ],
      "attack": [
        "Bite|+7|4d8+4"
      ]
    },
    {
      "name": "Tendril",
      "text": [
        "Melee Weapon Attack: +7 to hit, reach 50 ft., one creature. The target is grappled (escape DC 15). Until the grapple ends, the target is restrained and has disadvantage on Strength checks and Strength saving throws, and the roper can't use the same tendril on another target."
      ]
    },
    {
      "name": "Reel",
      "text": [
        "The roper pulls each creature grappled by it up to 25 feet straight toward it."
      ]
    }
  ],
  "description": "\nSource: Waterdeep: Dungeon of the Mad Mage p. 106",
  "environment": "underdark"
}