{
  "name": "Shockerstomper",
  "size": "G",
  "type": "construct",
  "alignment": "Unaligned",
  "ac": "18",
  "hp": "300 (300d1)",
  "speed": "walk 40 ft.",
  "str": "23",
  "dex": "10",
  "con": "20",
  "int": "1",
  "wis": "1",
  "cha": "1",
  "passive": "5",
  "cr": "14",
  "immune": "poison, psychic",
  "conditionImmune": "blinded, deafened, charmed, frightened, paralyzed, poisoned",
  "senses": "blindsight 60 ft. (blind beyond this radius)",
  "trait": [
    {
      "name": "Disable",
      "text": [
        "When a leg drops to 0 hit points, it is disabled, and Shockerstomper can use a reaction to detach it from its main body. Whenever one of its legs is disabled, Shockerstomper's walking speed is reduced by 10 feet. The whole contraption topples over and shuts down if four of its seven legs are disabled."
      ]
    },
    {
      "name": "Electrified Surface",
      "text": [
        "A creature that ends its turn in contact with Shockerstomper's body (saucer or turrets) must make a DC 15 Constitution saving throw, taking 22 (4d10) lightning damage on a failed save, or half as much damage on a successful one."
      ]
    },
    {
      "name": "Immutable Form",
      "text": [
        "Shockerstomper is immune to any spell or effect that would alter its form."
      ]
    },
    {
      "name": "Control Module",
      "text": [
        "A creature atop or above Shockerstomper's platform can locate its control module with a successful DC 15 Intelligence (Investigation) check or Wisdom (Perception) check. As an action, a character can try to open the control module's access panel, either by tearing it off with a successful DC 25 Strength (Athletics) check or by dislodging it with thieves' tools and a successful DC 25 Dexterity check. Behind the panel, embedded in the floor of the control module, is a 5-foot-diameter pulsating crystal hemisphere with AC 10, 25 hit points, and immunity to poison and psychic damage. Destroying the crystal hemisphere shuts down Shockerstomper."
      ]
    },
    {
      "name": "Lightning Turret",
      "text": [
        "A character can try to plug the nozzle of a lightning turret with a 10-pound rock or similar object, doing so with a successful DC 15 Strength (Athletics) check. A plugged turret can't shoot lightning until a creature uses an action to try to clear the obstruction, which requires another successful DC 15 Strength (Athletics) check. Shockerstomper has no ability to clear an obstruction itself."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "Shockerstomper makes three Lightning Turret attacks and two Stomp attacks."
      ]
    },
    {
      "name": "Lightning Turret",
      "text": [
        "The turret shoots a magical lightning bolt at one creature within 60 feet of Shockerstomper. The target must make a DC 15 Dexterity saving throw, taking 44 (8d10) lightning damage on a failed save, or half as much damage on a successful one."
      ],
      "attack": [
        "Lightning Turret||8d10"
      ]
    },
    {
      "name": "Stomp",
      "text": [
        "Melee Weapon Attack: +8 to hit, reach 10 ft., one creature. 22 (3d10 + 6) bludgeoning damage."
      ],
      "attack": [
        "Stomp|+8|3d10+6"
      ]
    }
  ],
  "description": "\nSource: Waterdeep: Dungeon of the Mad Mage p. 174"
}