{
  "name": "Soluun Xibrindas",
  "size": "M",
  "type": "humanoid (elf)",
  "alignment": "Lawful Evil",
  "ac": "18 (studded leather armor, shield)",
  "hp": "84 (13d8+26)",
  "speed": "walk 30 ft.",
  "str": "13",
  "dex": "18",
  "con": "14",
  "int": "11",
  "wis": "13",
  "cha": "14",
  "save": "Dex +6, Con +4, Wis +3",
  "skill": "Perception +3, Stealth +8",
  "passive": "13",
  "languages": "Elvish, Undercommon",
  "cr": "4",
  "senses": "darkvision 120 ft.",
  "trait": [
    {
      "name": "Fey Ancestry",
      "text": [
        "Soluun has advantage on saving throws against being charmed, and magic can't put Soluun to sleep."
      ]
    },
    {
      "name": "Gunslinger",
      "text": [
        "Being within 5 feet of a hostile creature or attacking at long range doesn't impose disadvantage on Soluun's ranged attack rolls with a pistol. In addition, Soluun ignores half cover and three-quarters cover when making ranged attacks with a pistol."
      ]
    },
    {
      "name": "Sunlight Sensitivity",
      "text": [
        "While in sunlight, Soluun has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
      ]
    },
    {
      "name": "Equipment",
      "text": [
        "Four packets of smokepowder and a pouch containing 20 pistol bullets"
      ]
    },
    {
      "name": "Boots of Elvenkind",
      "text": [
        "Whilst wearing these boots Soluun's steps make no sound and he has advantage on any Dexterity (Stealth) checks that rely on moving silently."
      ]
    },
    {
      "name": "Innate Spellcasting",
      "text": [
        "Soluun's spellcasting ability is Charisma. It can innately cast the following spells, requiring no material components:",
        "At will: dancing lights",
        "1/day each: darkness, faerie fire, levitate (self only)"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "Soluun makes two scimitar attacks."
      ]
    },
    {
      "name": "Scimitar",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 7 (1d6 + 4) slashing damage."
      ],
      "attack": [
        "Scimitar|+6|1d6+4"
      ]
    },
    {
      "name": "Poisonous Pistol",
      "text": [
        "Ranged Weapon Attack: +6 to hit, range 30/90 ft., one target. 9 (1d10 + 4) piercing damage plus 11 (2d10) poison damage."
      ],
      "attack": [
        "Poisonous Pistol|+6|1d10+4"
      ]
    }
  ],
  "spells": "dancing lights, darkness, faerie fire, levitate",
  "description": "Soluun is a sadistic, fanatical bully who is fiercely loyal to Bregan D'aerthe, and to Jarlaxle in particular. His younger brother, Nar'l, has infiltrated the Xanathar Guild. Soluun considers Nar'l a weakling who turned to arcane magic by way of compensation, and he has never had much faith in his brother or his abilities.\nSoluun has a burning hatred of surface elves and halfelves, having been taught from a young age to kill them as opportunity permits. When not engaged in a Bregan D'aerthe operation, Soluun spends his nights haunting the darkened streets and alleys of Waterdeep, looking for solitary elves or half-elves to pick off. He conceals his nighttime escapades as well as he can, but Jarlaxle, Fel'rekt, and Krebbyg know what he's up to.\nSource: Waterdeep: Dragon Heist p. 202"
}