{
  "name": "Swarm of Quippers",
  "size": "M",
  "type": "swarm of Medium beasts",
  "alignment": "Unaligned",
  "ac": "13",
  "hp": "28 (8d8-8)",
  "speed": "walk 0 ft., swim 40 ft.",
  "str": "13",
  "dex": "16",
  "con": "9",
  "int": "1",
  "wis": "7",
  "cha": "2",
  "passive": "8",
  "cr": "1",
  "resist": "bludgeoning, piercing, slashing",
  "conditionImmune": "charmed, frightened, grappled, paralyzed, petrified, prone, restrained, stunned",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Blood Frenzy",
      "text": [
        "The swarm has advantage on melee attack rolls against any creature that doesn't have all its hit points."
      ]
    },
    {
      "name": "Swarm",
      "text": [
        "The swarm can occupy another creature's space and vice versa, and the swarm can move through any opening large enough for a Tiny quipper. The swarm can't regain hit points or gain temporary hit points."
      ]
    },
    {
      "name": "Water Breathing",
      "text": [
        "The swarm can breathe only underwater."
      ]
    }
  ],
  "action": [
    {
      "name": "Bites",
      "text": [
        "Melee Weapon Attack: +5 to hit, reach 0 ft., one creature in the swarm's space. 14 (4d6) piercing damage, or 7 (2d6) piercing damage if the swarm has half of its hit points or fewer."
      ],
      "attack": [
        "Bites|+5|4d6"
      ]
    }
  ],
  "description": "The Nature of Swarms. \n------\nThe swarms presented here aren't ordinary or benign assemblies of little creatures. They form as a result of some sinister or unwholesome influence. A vampire can summon swarms of bats and rats from the darkest corners of the night, while the very presence of a mummy lord can cause scarab beetles to boil up from the sand-filled depths of its tomb. A hag might have the power to turn swarms of ravens against her enemies, while a yuan-ti abomination might have swarms of poisonous snakes slithering in its wake. Even druids can't charm these swarms, and their aggressiveness is borderline unnatural.\n------\nSource: Monster Manual p. 338, Princes of the Apocalypse, Tomb of Annihilation, Waterdeep: Dungeon of the Mad Mage, Ghosts of Saltmarsh, Essentials Kit: Dragon of Icespire Peak, Essentials Kit: Sleeping Dragon's Wake, Locathah Rising",
  "environment": "underwater"
}