{
  "name": "Tashlyn Yafeera",
  "size": "M",
  "type": "humanoid (human)",
  "alignment": "Neutral",
  "ac": "18 (plate armor)",
  "hp": "149 (23d8+46)",
  "speed": "walk 30 ft.",
  "str": "18",
  "dex": "15",
  "con": "14",
  "int": "10",
  "wis": "14",
  "cha": "12",
  "save": "Str +8, Con +6",
  "skill": "Athletics +8, Intimidation +5, Perception +6",
  "passive": "16",
  "languages": "Common",
  "cr": "9",
  "trait": [
    {
      "name": "Indomitable (2/Day)",
      "text": [
        "Tashlyn can reroll a saving throw that she fails. She must use the new roll."
      ]
    },
    {
      "name": "Second Wind (Recharges after a Short or Long Rest)",
      "text": [
        "As a bonus action, Tashlyn can regain 20 hit points."
      ]
    },
    {
      "name": "Extra Damage",
      "text": [
        "Tashlyn deals an extra 7 (2d6) damage to every hit if she has more than half her hit points remaining."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "Tashlyn makes three attacks with her greatsword or her shortbow."
      ]
    },
    {
      "name": "Greatsword",
      "text": [
        "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. 11 (2d6 + 4) slashing damage."
      ],
      "attack": [
        "Greatsword|+8|2d6+4"
      ]
    },
    {
      "name": "Shortbow",
      "text": [
        "Ranged Weapon Attack: +6 to hit, range 80/320 ft., one target. 5 (1d6 + 2) piercing damage."
      ],
      "attack": [
        "Shortbow|+6|1d6+2"
      ]
    }
  ],
  "description": "Tashlyn is Master of Arms and Mercenaries for the Waterdeep Zhentarim. In this role, she provides armor, weapons, and training to sellswords on the Black Network's payroll.\nTashlyn has established a useful cover by serving as a bodyguard to Vorondar Levelstone, a dwarf magister stationed at the South Gate. She likes the dwarf and has earned his confidence, allowing her to reach the rank of captain in the City Guard. In that position, she watches over traffic that passes through the gate-and ensures that her associates in the Black Network can come and go freely.\nBorn to a well-off family in Calimshan, Tashlyn has an unfettered sense of superiority. Quick to anger, she hates to back down from a fight. She respects anyone who can best her in melee combat.\nThe Doom Raiders. The Doom Raiders were five unscrupulous adventurers who liked to plunder lich lairs (called \"dooms\" by some). They gave up adventuring to join the Black Network and came to Waterdeep three years ago with plans to establish a Zhentarim foothold in the city. In that time, they have forged alliances with various nobles and guilds and run afoul of others, all the while fending off Harper spies.\nSource: Waterdeep: Dragon Heist p. 200"
}