{
  "name": "The Hungry",
  "size": "M",
  "type": "monstrosity",
  "alignment": "Lawful Evil",
  "ac": "17 (natural armor)",
  "hp": "225 (30d8+90)",
  "speed": "walk 30 ft.",
  "str": "19",
  "dex": "10",
  "con": "17",
  "int": "6",
  "wis": "11",
  "cha": "6",
  "passive": "10",
  "languages": "Common",
  "cr": "11",
  "resist": "bludgeoning, piercing, slashing while in dim light or darkness",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Life Hunger",
      "text": [
        "If a creature the Hungry can see regains hit points, the Hungry gains two benefits until the end of its next turn: it has advantage on attack rolls, and its bite deals an extra 22 (4d10) necrotic damage on a hit."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The Hungry makes two attacks: one with its bite and one with its claws."
      ]
    },
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. 8 (1d8 + 4) piercing damage plus 13 (3d8) necrotic damage."
      ],
      "attack": [
        "Bite|+8|1d8+4"
      ]
    },
    {
      "name": "Claws",
      "text": [
        "Melee Weapon Attack: +8 to hit, reach 10 ft., one target. 18 (4d6 + 4) slashing damage. If the target is Medium or smaller, it is grappled (escape DC 16) and is restrained until the grapple ends. While grappling a creature, the Hungry can't attack with its claws."
      ],
      "attack": [
        "Claws|+8|4d6+4"
      ]
    }
  ],
  "description": "The Hungry. Horrid beasts with grasping claws and yawning mouths, the Hungry do whatever is necessary to sate their appetites. These greedy devourers consume all life and energy they encounter, stuffing their maws with flesh and drinking in their victims' screams. When they finish, they lurch away while their bright eyes resume the search for something else to consume.\nSorrowsworn. The Shadowfell's pervasive melancholy sometimes gives rise to strange incarnations of the plane's bleak nature. The sorrowsworn embody the forms of suffering that are inherent to the shadowy landscape, and they visit horror on those who stumble into their midst.\nEmotion Given Form. Each sorrowsworn personifies a different aspect of despair or distress. Some are manifestations of anger; others are loneliness given physical form. Their nature provides a clue both to understanding how they become more powerful and to overcoming them. Giving in to the negative emotions that the sorrowsworn represent causes these entities to grow deadlier. Fighting against these emotions can weaken them and drive them away.\nSource: Mordenkainen's Tome of Foes p. 232",
  "environment": "forest, underdark, urban"
}