{
  "name": "The Angry",
  "size": "M",
  "type": "monstrosity",
  "alignment": "Lawful Evil",
  "ac": "18 (natural armor)",
  "hp": "255 (30d8+120)",
  "speed": "walk 30 ft.",
  "str": "17",
  "dex": "10",
  "con": "19",
  "int": "8",
  "wis": "13",
  "cha": "6",
  "skill": "Perception +6",
  "passive": "16",
  "languages": "Common",
  "cr": "13",
  "resist": "bludgeoning, piercing, slashing while in dim light or darkness",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Two Heads",
      "text": [
        "The Angry has advantage on Wisdom (Perception) checks and on saving throws against being blinded, charmed, deafened, frightened, stunned, or knocked unconscious."
      ]
    },
    {
      "name": "Rising Anger",
      "text": [
        "If another creature deals damage to the Angry, the Angry's attack rolls have advantage until the end of its next turn, and the first time it hits with a hook attack on its next turn, the attack's target takes an extra 19 (3d12) psychic damage.",
        "On its turn, the Angry has disadvantage on attack rolls if no other creature has dealt damage to it since the end of its last turn."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The Angry makes two hook attacks."
      ]
    },
    {
      "name": "Hook",
      "text": [
        "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. 16 (2d12 + 3) piercing damage."
      ],
      "attack": [
        "Hook|+8|2d12+3"
      ]
    }
  ],
  "description": "The Angry. Relying on violence to sustain their existence, the Angry grow more powerful when their foes fight back. If a creature opts not to attack, though, the Angry becomes confused, and its attacks weaken. Each of the Angry has two heads, which bicker with each other until they find something else on which they can vent their wrath.\nSorrowsworn. The Shadowfell's pervasive melancholy sometimes gives rise to strange incarnations of the plane's bleak nature. The sorrowsworn embody the forms of suffering that are inherent to the shadowy landscape, and they visit horror on those who stumble into their midst.\nEmotion Given Form. Each sorrowsworn personifies a different aspect of despair or distress. Some are manifestations of anger; others are loneliness given physical form. Their nature provides a clue both to understanding how they become more powerful and to overcoming them. Giving in to the negative emotions that the sorrowsworn represent causes these entities to grow deadlier. Fighting against these emotions can weaken them and drive them away.\nSource: Mordenkainen's Tome of Foes p. 231",
  "environment": "underdark, urban"
}