{
  "name": "The Mad Mage of Mount Baratok",
  "size": "M",
  "type": "humanoid (any race)",
  "alignment": "Any alignment",
  "ac": "12 (15 with mage armor)",
  "hp": "99 (18d8+18)",
  "speed": "walk 30 ft.",
  "str": "10",
  "dex": "14",
  "con": "12",
  "int": "20",
  "wis": "15",
  "cha": "16",
  "save": "Int +9, Wis +6",
  "skill": "Arcana +13, History +13",
  "passive": "12",
  "languages": "any six languages",
  "cr": "12",
  "resist": "damage from spells; nonmagical bludgeoning, piercing, slashing (from stoneskin)",
  "trait": [
    {
      "name": "Magic Resistance",
      "text": [
        "The Mad Mage has advantage on saving throws against spells and other magical effects."
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "The Mad Mage is an 18th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 17, +9 to hit with spell attacks). The Mad Mage can cast disguise self and invisibility at will and has the following wizard spells prepared:",
        "At will: disguise self, invisibility",
        "Cantrips (at will): fire bolt, light, mage hand, prestidigitation, shocking grasp",
        "• 1st level (4 slots): detect magic, identify, mage armor*, magic missile",
        "• 2nd level (3 slots): detect thoughts, mirror image, misty step",
        "• 3rd level (3 slots): counterspell, fly, lightning bolt",
        "• 4th level (3 slots): banishment, fire shield, stoneskin*",
        "• 5th level (3 slots): cone of cold, scrying, wall of force",
        "• 6th level (1 slots): globe of invulnerability",
        "• 7th level (1 slots): teleport",
        "• 8th level (1 slots): mind blank*",
        "• 9th level (1 slots): time stop",
        "*The Mad Mage casts these spells on itself before combat."
      ]
    }
  ],
  "action": [
    {
      "name": "Dagger",
      "text": [
        "Melee or Ranged Weapon Attack: +6 to hit, reach 5 ft. or range 20/60 ft., one target. 4 (1d4 + 2) piercing damage."
      ],
      "attack": [
        "Dagger|+6|1d4+2"
      ]
    },
    {
      "name": "Variant: Familiars",
      "text": [
        "Any spellcaster that can cast the find familiar spell (such as an archmage or mage) is likely to have a familiar. The familiar can be one of the creatures described in the spell (see the Player's Handbook) or some other Tiny monster, such as a crawling claw, imp, pseudodragon, or quasit."
      ]
    }
  ],
  "slots": [
    "4, 3, 3, 3, 3, 1, 1, 1, 1"
  ],
  "spells": "disguise self, invisibility, fire bolt, light, mage hand, prestidigitation, shocking grasp, detect magic, identify, mage armor, magic missile, detect thoughts, mirror image, misty step, counterspell, fly, lightning bolt, banishment, fire shield, stoneskin, cone of cold, scrying, wall of force, globe of invulnerability, teleport, mind blank, time stop",
  "description": "\nSource: Curse of Strahd p. 39"
}