{
  "name": "Thessalar",
  "size": "M",
  "type": "humanoid (human)",
  "alignment": "Neutral Evil",
  "ac": "14 (breastplate)",
  "hp": "104 (7d10+14)",
  "speed": "walk 30 ft.",
  "str": "10",
  "dex": "12",
  "con": "13",
  "int": "19",
  "wis": "16",
  "cha": "16",
  "save": "Con +5, Int +8, Wis +7",
  "skill": "Animal handling +7, Arcana +8, Insight +7, Medicine +7",
  "passive": "13",
  "languages": "Common, Draconic, Elvish, Primordial",
  "cr": "12",
  "immune": "acid, poison",
  "conditionImmune": "poisoned",
  "trait": [
    {
      "name": "Special Equipment",
      "text": [
        "Thessalar wields a +1 dagger coated with thessaltoxin poison (see appendix C)."
      ]
    },
    {
      "name": "Alchemical Homunculus",
      "text": [
        "Thessalar is accompanied by his thessalars homunculus. If the mending spell is cast on it, the homunculus regains 2d6 hit points."
      ]
    },
    {
      "name": "Healing Toxicity",
      "text": [
        "Any magic item that restores hit points and can be applied to a piercing or slashing weapon (a potion, an ointment, and so forth) causes a hit with that weapon to deal extra damage to Thessalar equal to the amount the item would normally heal."
      ]
    },
    {
      "name": "Greater Restoration (1/Day)",
      "text": [
        "Thessalar can cast greater restoration if he has access to alchemical supplies."
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "Thessalar is an 18th-level spellcaster. His spellcasting ability is Intelligence (spell save DC 16, +8 to hit with spell attacks). He has the following artificer spells prepared:",
        "Cantrips (at will): light, mending, message, shocking grasp",
        "• 1st level (4 slots): alarm, cure wounds, identify, ray of sickness",
        "• 2nd level (3 slots): invisibility, Melf's acid arrow, web",
        "• 3rd level (3 slots): dispel magic, haste, stinking cloud",
        "• 4th level (3 slots): blight, Mordenkainen's faithful hound, Otiluke's resilient sphere",
        "• 5th level (1 slots): cloudkill"
      ]
    }
  ],
  "action": [
    {
      "name": "Dagger",
      "text": [
        "Melee or Ranged Weapon Attack: +5 to hit, reach 5 ft. or range 20/60 ft., one target. 3 (1d4 + 1) piercing damage, and the target must succeed on a DC 15 Constitution saving throw. On a failed save, the target is affected as if by the polymorph spell, transforming into a random beast or a creature it has seen within the last 24 hours (as chosen by the DM). This effect lasts until the target finishes a long rest."
      ],
      "attack": [
        "Dagger|+5|1d4+1"
      ]
    }
  ],
  "slots": [
    "4, 3, 3, 3, 1"
  ],
  "spells": "light, mending, message, shocking grasp, alarm, cure wounds, identify, ray of sickness, invisibility, Melf's acid arrow, web, dispel magic, haste, stinking cloud, blight, Mordenkainen's faithful hound, Otiluke's resilient sphere, cloudkill",
  "description": "Thessalar was a master alchemist and creator of monsters, whose own blood was said to possess dire magical properties.\nHe is vainglorious, egotistical, and utterly ruthless in furthering his research. His career began as a priest in the service of Moloch, where he rose through the ranks before eventually taking over the temple as a working laboratory. Most of his experiments have involved the pursuit of new forms of life, resulting in such creatures as the thessalhydra and the owlbear. In recent years, he has also researched the prolonging of life—namely his own. Thessalar hopes that by becoming a lich, his research and experiments can continue indefinitely.\nOver time, Thessalar has subjected himself to so many of his own experiments that his blood has taken on alchemical and magical properties. He regularly uses it as the basis for many of the reagents used throughout his labs.\nSource: Infernal Machine Rebuild p. 57"
}