{
  "name": "Tosculi Jeweled Drone",
  "size": "S",
  "type": "humanoid (tosculi)",
  "alignment": "Lawful Evil",
  "ac": "15 (natural armor)",
  "hp": "90 (12d6+48)",
  "speed": "walk 30 ft., fly 60 ft.",
  "str": "10",
  "dex": "18",
  "con": "18",
  "int": "14",
  "wis": "14",
  "cha": "17",
  "skill": "Deception +5, Insight +4, Persuasion +5",
  "passive": "12",
  "languages": "Common, Infernal",
  "cr": "4",
  "conditionImmune": "charmed, frightened",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Pheromones",
      "text": [
        "The jeweled drone emits a sweet scent that empowers other tosculi within 15 feet of the drone. A tosculi that starts its turn within the area can add a d6 to one attack roll or saving throw it makes before the start of its next turn, provided it can smell the scent. A tosculi can benefit from only one Pheromones die at a time. This effect ends if the jeweled drone dies."
      ]
    },
    {
      "name": "Scintillating Carapace",
      "text": [
        "While in bright light, the jeweled drone's carapace shines and glitters. When a non-tosculi creature that can see the drone starts its turn within 30 feet of the drone, the drone can force the creature to make a DC 12 Wisdom saving throw if the drone isn't incapacitated. On a failure, the creature is blinded until the start of its next turn.",
        "Unless surprised, a creature can avert its eyes to avoid the saving throw at the start of its turn. If it does so, it can't see the drone until the start of its next turn, when it can avert its eyes again. If it looks at the drone in the meantime, it must immediately make the save."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The jeweled drone makes three attacks. two with its claws and one with its scimitar."
      ]
    },
    {
      "name": "Claws",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 7 (1d6 + 4) slashing damage."
      ],
      "attack": [
        "Claws|6|1d6+4"
      ]
    },
    {
      "name": "Scimitar",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 7 (1d6 + 4) slashing damage plus 10 (3d6) poison damage.",
        "If the poison damage reduces the target to 0 hp, the target is stable but poisoned for 1 hour, even after regaining hp, and is paralyzed while poisoned in this way."
      ],
      "attack": [
        "Scimitar|6|1d6+4"
      ]
    }
  ],
  "reaction": [
    {
      "name": "Protect the Queen",
      "text": [
        "When a creature makes an attack against a tosculi hive queen, the jeweled drone grants a +2 bonus to the queen's AC if the drone is within 5 feet of the queen."
      ]
    }
  ],
  "description": "Source: CCodex (3pp)",
  "environment": "coastal, forest, grassland"
}