{
  "name": "Triton Master of Waves",
  "size": "M",
  "type": "humanoid (triton)",
  "alignment": "Neutral",
  "ac": "15 (natural armor)",
  "hp": "105 (14d8+42)",
  "speed": "walk 30 ft., swim 30 ft.",
  "str": "16",
  "dex": "11",
  "con": "16",
  "int": "10",
  "wis": "12",
  "cha": "19",
  "save": "Dex +3, Int +3, Cha +7",
  "skill": "Athletics +6, Nature +6, Survival +4",
  "passive": "11",
  "languages": "Common, Primordial",
  "cr": "8",
  "resist": "cold, fire",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Amphibious",
      "text": [
        "The triton can breathe air and water."
      ]
    },
    {
      "name": "Summon Water Weird (Recharges after a Short or Long Rest)",
      "text": [
        "As a bonus action, the triton magically summons 1d4 water weird. The summoned weirds appear in unoccupied spaces in water within 60 feet of the triton. The water weirds act immediately after the triton on the same initiative count and fight until they're destroyed. They disappear if the triton dies."
      ]
    },
    {
      "name": "Innate Spellcasting",
      "text": [
        "The triton's spellcasting ability is Charisma (spell save DC 15, +7 to hit with spell attacks). It can innately cast the following spells, requiring no material components:",
        "At will: ray of frost (see \"Actions\" below)",
        "2/day: cone of cold",
        "1/day each: fog cloud, gust of wind, wind wall"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The triton makes two attacks using Wave Touch and casts ray of frost."
      ]
    },
    {
      "name": "Wave Touch",
      "text": [
        "Melee Spell Attack: +7 to hit, reach 5 ft., one target. 22 (4d10) cold damage."
      ],
      "attack": [
        "Wave Touch|+7|4d10"
      ]
    },
    {
      "name": "Ray of Frost (Cantrip)",
      "text": [
        "Ranged Spell Attack: +7 to hit, range 60 ft., one creature. 13 (3d8) cold damage, and the target's speed is reduced by 10 feet until the start of the triton's next turn."
      ],
      "attack": [
        "Ray of Frost (Cantrip)|+7|3d8"
      ]
    }
  ],
  "reaction": [
    {
      "name": "Frigid Shield",
      "text": [
        "When a creature the triton can see targets the triton with an attack, the triton gains 10 temporary hit points. If the attack hits and reduces the temporary hit points to 0, each creature within 5 feet of the triton takes 9 (2d8) cold damage."
      ]
    }
  ],
  "spells": "ray of frost, cone of cold, fog cloud, gust of wind, wind wall",
  "description": "Triton masters of waves sculpt storms and change the tides, bending the sea to their will. Drawing forth living currents and the icy cold of the deep, these mages make the ocean their ally, using it to defend their people or enact Thassa's wishes. While dire threats from the land might bring them to coastal shallows, most masters of waves keep to the ocean's depths.\nAlthough many masters of waves resent land-dwellers and strike out at those who trespass upon their waters, most are devoted followers of the sea god. Those who share their faith or who bear earnest offerings to Thassa might defuse the tritons' ire—that is, if they survive the deadly winds and waves that typically herald these sea guardians' appearance.\nClever, far-ranging people of the sea, tritons live rich lives unknown to most land-dwelling individuals. While the waves separate most tritons from land-dwellers, occasionally the inhabitants of the surface and the deep come into conflict. In such cases, tritons prove skilled at sabotaging ocean-going vessels, employing water-based magic, and otherwise whipping up the fury of the sea. Few dare insult tritons in their home environment, but those who do and survive often learn that the tritons' wrath doesn't end at the shore.\nSource: Mythic Odysseys of Theros p. 245"
}