{
  "name": "Tsucora Quori",
  "size": "M",
  "type": "aberration",
  "alignment": "Lawful Evil",
  "ac": "16 (natural armor)",
  "hp": "68 (8d8+32)",
  "speed": "walk 40 ft.",
  "str": "17",
  "dex": "14",
  "con": "18",
  "int": "14",
  "wis": "14",
  "cha": "16",
  "save": "Wis +5, Cha +6",
  "skill": "Insight +5, Perception +5",
  "passive": "15",
  "languages": "Common, Quori",
  "cr": "7",
  "resist": "psychic",
  "conditionImmune": "charmed, frightened",
  "senses": "darkvision 60 ft.",
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The quori makes three attacks: one pincer attack, one attack with its claws, and one stinger attack."
      ]
    },
    {
      "name": "Pincer",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 8 (1d10 + 3) bludgeoning damage. The target is grappled (escape DC 14) if it is a Large or smaller creature. The quori has two pincers, each of which can grapple one target."
      ],
      "attack": [
        "Pincer|+6|1d10+3"
      ]
    },
    {
      "name": "Claws",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 13 (4d4 + 3) slashing damage."
      ],
      "attack": [
        "Claws|+6|4d4+3"
      ]
    },
    {
      "name": "Stinger",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 10 ft., one creature. 8 (1d10 + 3) piercing damage plus 10 (3d6) psychic damage, and the target must succeed on a DC 14 Wisdom saving throw or be frightened of the quori for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
      ],
      "attack": [
        "Stinger|+6|1d10+3"
      ]
    },
    {
      "name": "Possession (Recharge 6)",
      "text": [
        "One humanoid that the quori can see within 5 feet of it must succeed on a DC 14 Charisma saving throw or be possessed by the quori; the quori then disappears, and the target is incapacitated and loses control of its body. The quori now controls the body but doesn't deprive the target of awareness. The quori can't be targeted by any attack, spell, or other effect, and it retains its alignment, Intelligence, Wisdom, Charisma, and immunity to being charmed and frightened. It otherwise uses the possessed target's statistics, but doesn't gain access to the target's knowledge, class features, or proficiencies.",
        "The possession lasts until the body drops to 0 hit points, the quori ends it as a bonus action, or the quori is forced out by an effect like the dispel evil and good spell. When the possession ends, the quori reappears in an unoccupied space within 5 feet of the body. The target is immune to this quori's Possession for 24 hours after succeeding on the saving throw or after the possession ends."
      ]
    }
  ],
  "trait": [
    {
      "name": "Innate Spellcasting (Psionics)",
      "text": [
        "The quori's spellcasting ability is Charisma (spell save DC 14). It can innately cast the following spells, requiring no components:",
        "At will: charm person",
        "1/day: fear"
      ]
    }
  ],
  "spells": "charm person, fear",
  "description": "Dal Quor is the plane of dreams and is currently dominated by a dark power known as il-Lashtavar, or the Dreaming Dark. Il-Lashtavar is served by a host of aberrations that are the embodiments of dreams and nightmares—the quori. Because it is difficult for anything to physically travel to or from Dal Quor, quori in Eberron are typically encountered while possessing a host body. The Inspired are the most common type of willing host for the quori and are described earlier in this chapter.\nSource: Eberron: Rising from the Last War p. 307"
}