{
  "name": "Undercity Medusa",
  "size": "M",
  "type": "monstrosity",
  "alignment": "Neutral Evil",
  "ac": "16 (natural armor)",
  "hp": "120 (16d8+48)",
  "speed": "walk 30 ft.",
  "str": "16",
  "dex": "18",
  "con": "16",
  "int": "17",
  "wis": "12",
  "cha": "15",
  "skill": "Deception +5, Insight +4, Perception +4, Stealth +7",
  "passive": "14",
  "languages": "Common, Elvish",
  "cr": "6",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Magic Resistance",
      "text": [
        "The medusa has advantage on saving throws against spells and other magical effects."
      ]
    },
    {
      "name": "Surprise Attack",
      "text": [
        "During the first round of combat, the medusa has advantage on attack rolls against any creature that is surprised, and it deals an extra 10 (3d6) damage each time it hits such a creature with an attack."
      ]
    },
    {
      "name": "Innate Spellcasting",
      "text": [
        "The medusa's innate spellcasting ability is Intelligence (spell save DC 14). The medusa can innately cast the following spells, requiring no material components:",
        "1/day each: expeditious retreat, fog cloud, misty step"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The medusa makes two claw attacks. It can also use Petrifying Gaze before or after making these attacks."
      ]
    },
    {
      "name": "Claw",
      "text": [
        "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. 13 (2d8 + 4) slashing damage."
      ],
      "attack": [
        "Claw|+7|2d8+4"
      ]
    },
    {
      "name": "Petrifying Gaze",
      "text": [
        "The medusa fixes its gaze on one creature within 60 feet of it that it can see and that can see its eyes. The target must make a DC 14 Constitution saving throw. If the saving throw fails by 5 or more, the creature is instantly petrified. Otherwise, a creature that fails the save begins to turn to stone and is restrained. The restrained creature must repeat the saving throw at the end of its next turn, becoming petrified on a failure or ending the effect on a success. The petrification lasts until the creature is freed by a greater restoration spell or similar magic."
      ]
    }
  ],
  "spells": "expeditious retreat, fog cloud, misty step",
  "description": "The medusas of Ravnica, often called gorgons, are a monstrous race of creatures that appear superficially similar to human women. In place of hair, a gorgon has a writhing mass of black, serpentine cables, and its hands are scaly claws.\nThe gaze of a medusa's glowing eyes causes living tissue to petrify. The transformation is rapid, leaving the victim as a stone statue, usually frozen in a position of abject fear or agony-a fine trophy for the medusa's macabre collection. The medusa must exert its will to effect this transformation, so the gaze of a surprised or friendly Ravnican medusa is harmless.\nThis deadly gaze attack gives medusas a degree of power among the Golgari that is out of proportion with their small numbers. Medusas command a significant share of the guild's smaller cells around Ravnica, and at least one medusa is thought to be angling for control of the entire guild at the moment.\nNot all gorgons are so ambitious; some prefer to simply stalk the endless shadows of the undercity like hungry predators.\nSource: Guildmasters' Guide to Ravnica p. 222"
}