{
  "name": "Urstul Floxin",
  "size": "M",
  "type": "humanoid (Illuskanhuman)",
  "alignment": "Lawful Evil",
  "ac": "15 (studded leather armor)",
  "hp": "78 (12d8+24)",
  "speed": "walk 30 ft.",
  "str": "11",
  "dex": "16",
  "con": "14",
  "int": "13",
  "wis": "11",
  "cha": "10",
  "save": "Dex +6, Int +4",
  "skill": "Acrobatics +6, Deception +3, Perception +3, Stealth +9",
  "passive": "13",
  "languages": "Common, Orc, Thieves' cant",
  "cr": "8",
  "resist": "poison",
  "trait": [
    {
      "name": "Assassinate",
      "text": [
        "During its first turn, Urstul has advantage on attack rolls against any creature that hasn't taken a turn. Any hit Urstul scores against a surprised creature is a critical hit."
      ]
    },
    {
      "name": "Evasion",
      "text": [
        "If Urstul is subjected to an effect that allows him to make a Dexterity saving throw to take only half damage, Urstul instead takes no damage if he succeeds on the saving throw, and only half damage if it fails."
      ]
    },
    {
      "name": "Sneak Attack (1/Turn)",
      "text": [
        "Urstul deals an extra 14 (4d6) damage when he hits a target with a weapon attack and has advantage on the attack roll, or when the target is within 5 feet of an ally of Urstul that isn't incapacitated and Urstul doesn't have disadvantage on the attack roll."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "Urstul makes two shortsword attacks."
      ]
    },
    {
      "name": "Shortsword",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 6 (1d6 + 3) piercing damage, and the target must make a DC 15 Constitution saving throw, taking 24 (7d6) poison damage on a failed save, or half as much damage on a successful one."
      ],
      "attack": [
        "Shortsword|+6|1d6+3",
        "Shortsword||7d6"
      ]
    },
    {
      "name": "Light Crossbow",
      "text": [
        "Ranged Weapon Attack: +6 to hit, range 80/320 ft., one target. 7 (1d8 + 3) piercing damage, and the target must make a DC 15 Constitution saving throw, taking 24 (7d6) poison damage on a failed save, or half as much damage on a successful one."
      ],
      "attack": [
        "Light Crossbow|+6|1d8+3",
        "Light Crossbow||7d6"
      ]
    }
  ],
  "description": "Urstul Floxin works for Manshoon, and he is the highest-ranking member of the Zhentarim squad stationed at House Gralhund. Urstul is a glorified thug with all the charm and breeding of a snake, but the Gralhunds tolerate him because he feeds them useful information culled from his spies throughout the city. Urstul takes his orders from Manshoon's current simulacrum, which comes and goes from House Gralhund by way of a teleportation circle (connected to the circle in Kolat Towers).\nUrstul is a large, heavyset man in his forties. He storms about House Gralhund like he owns the place. He has a collection of black flying snakes that he uses as couriers to deliver messages to underlings throughout the city.\nSource: Waterdeep: Dragon Heist p. 216"
}