{
  "name": "Vampiric Knight",
  "size": "M",
  "type": "undead (Vampire)",
  "alignment": "Neutral Evil",
  "ac": "20 (plate armor, shield)",
  "hp": "127 (15d8+60)",
  "speed": "walk 30 ft.",
  "str": "20",
  "dex": "14",
  "con": "18",
  "int": "13",
  "wis": "17",
  "cha": "14",
  "save": "Dex +6, Con +8, Wis +7",
  "skill": "Athletics +9, Perception +7",
  "passive": "17",
  "languages": "The languages it knew in life",
  "cr": "11",
  "resist": "necrotic; bludgeoning, piercing, slashing from nonmagical weapons",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Regeneration",
      "text": [
        "The vampiric knight regains 20 hp at the start of its turn if it has at least 1 hp and isn't in running water. If it takes radiant damage or damage from holy water, this trait doesn't function at the start of the vampiric knight's next turn."
      ]
    },
    {
      "name": "Vampire Weaknesses",
      "text": [
        "The vampiric knight has the following flaws."
      ]
    },
    {
      "name": "Forbiddance",
      "text": [
        "The vampiric knight can't enter a residence without an invitation from one of the occupants."
      ]
    },
    {
      "name": "Harmed By Running Water",
      "text": [
        "The vampiric knight takes 20 acid damage if it ends its turn in running water."
      ]
    },
    {
      "name": "Stake To The Heart",
      "text": [
        "If a piercing weapon made of wood is driven into the vampiric knight's heart while the knight is incapacitated in its resting place, the vampiric knight is paralyzed until the stake is removed."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The vampiric knight makes two impaling longsword attacks."
      ]
    },
    {
      "name": "Impaling Longsword",
      "text": [
        "Melee Weapon Attack: +9 to hit, reach 5 ft., one target. 9 (1d8 + 5) slashing damage, or 10 (1d10 + 5) slashing damage if used with two hands, plus 9 (2d8) necrotic damage. The vampiric knight impales the target on its longsword, grappling the target if it is a Medium or smaller creature (escape DC 17). Until the grapple ends, the target is restrained, takes 9 (2d8) necrotic damage at the start of each of its turns, and the vampiric knight can't make longsword attacks against other targets."
      ],
      "attack": [
        "Impaling Longsword|9|1d8+5"
      ]
    },
    {
      "name": "Channel Corruption (Recharge 5-6)",
      "text": [
        "Each living creature within 20 feet of the vampiric knight must make a DC 17 Constitution saving throw, taking 42 (12d6) necrotic damage on a failed save, or half as much damage on a successful one."
      ]
    }
  ],
  "reaction": [
    {
      "name": "Shield",
      "text": [
        "When a creature makes an attack against an allied vampire, the knight can grant the vampire a +3 bonus to its AC if the knight is within 5 feet of the vampire."
      ]
    }
  ],
  "description": "Source: CCodex (3pp) p. 369"
}