{
  "name": "Vampire Neonate",
  "size": "M",
  "type": "undead",
  "alignment": "Neutral Evil",
  "ac": "15 (natural armor)",
  "hp": "82 (11d8+33)",
  "speed": "walk 30 ft.",
  "str": "16",
  "dex": "16",
  "con": "16",
  "int": "11",
  "wis": "10",
  "cha": "12",
  "save": "Dex +6, Wis +3",
  "skill": "Perception +3, Stealth +6",
  "passive": "13",
  "languages": "Common",
  "cr": "5",
  "resist": "necrotic; bludgeoning, piercing, slashing from nonmagical attacks not made with living wood weapons",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Regeneration",
      "text": [
        "The vampire regains 10 hit points at the start of its turn if it has at least 1 hit point. If the vampire takes radiant damage or damage from holy water, this trait doesn't function at the start of the vampire's next turn."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The vampire makes two attacks, only one of which can be a bite attack."
      ]
    },
    {
      "name": "Claws",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one creature. 8 (2d4 + 3) slashing damage. Instead of dealing damage, the vampire can grapple the target (escape DC 13)."
      ],
      "attack": [
        "Claws|+6|2d4+3"
      ]
    },
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one willing creature, or a creature that is grappled by the vampire, incapacitated, or restrained. 6 (1d6 + 3) piercing damage plus 7 (2d6) necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage taken, and the vampire regains hit points equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0."
      ],
      "attack": [
        "Bite|+6|1d6+3"
      ]
    },
    {
      "name": "Vampiric Glamer",
      "text": [
        "The vampire obscures its form with mind-affecting magic that makes others perceive it as a beautiful human of the same size and shape. The illusion ends if the vampire takes a bonus action to end it or if the vampire dies. A creature that can see the vampire can take an action to visually inspect it, ending the mental effect on itself and seeing the vampire's true form with a successful DC 20 Wisdom (Perception) check."
      ]
    },
    {
      "name": "Aura of Silence",
      "text": [
        "The vampire shrouds itself in a cloak of silence to a radius of 2 feet. Within that radius, the effect is the same as the silence spell."
      ]
    },
    {
      "name": "Variant: Elder Vampires",
      "text": [
        "The basic vampire statistics represent a \"neonate\"—a newly spawned vampire. Older vampires can learn powerful magic of many different kinds, and might have any of the following traits and abilities.",
        "Shapechanger. The vampire has the Shapechanger trait of the vampire in the Monster Manual, as well as the shapechanger tag. Some vampires can turn into bat form, some can assume mist form, and a few can choose either form.",
        "Charm. The vampire has the Charm action of the vampire in the Monster Manual.",
        "Flight. The vampire has a flying speed of 30 feet.",
        "Gorger. The vampire has advantage on melee attack rolls, but attack rolls against it have advantage.",
        "Spellcasting. The vampire has the spellcasting abilities of a wizard or cleric."
      ]
    }
  ],
  "description": "\nSource: Plane Shift: Innistrad p. 17"
}