{
  "name": "Victoro Cassalanter",
  "size": "M",
  "type": "humanoid (half-elf)",
  "alignment": "Lawful Evil",
  "ac": "15 (glamoured studded leather, ring of protection)",
  "hp": "97 (15d8+30)",
  "speed": "walk 30 ft.",
  "str": "13",
  "dex": "13",
  "con": "14",
  "int": "16",
  "wis": "17",
  "cha": "18",
  "save": "Con +6, Wis +7",
  "skill": "History +7, Insight +7, Persuasion +8, Religion +7",
  "passive": "13",
  "languages": "Common, Draconic, Elvish, Infernal",
  "cr": "10",
  "immune": "poison",
  "conditionImmune": "poisoned",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Special Equipment",
      "text": [
        "Victoro wears a ring of protection and glamoured studded leather disguised to look like fine clothing. He carries a rod of rulership shaped like a ruby-tipped cane."
      ]
    },
    {
      "name": "Fey Ancestry",
      "text": [
        "Victoro has advantage on saving throws against being charmed, and magic can't put him to sleep."
      ]
    },
    {
      "name": "Rod of Rulership",
      "text": [
        "Victoro can use an action to present the rod and command obedience from each creature of his choice that he can see within 120 feet of him. Each target must succeed on a DC 15 Wisdom saving throw or be charmed for 8 hours by Victoro. While charmed in this way, the creature regards Victoro as its trusted leader. If harmed by Victoro or his companions, or commanded to do something contrary to its nature, a target ceases to be charmed in this way. The rod can't be used again until the next dawn."
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "Victoro is a 15th-level spellcaster. His spellcasting ability is Wisdom (spell save DC 15, +7 to hit with spell attacks). Victoro has the following cleric spells prepared:",
        "Cantrips (at will): guidance, light, mending, spare the dying, thaumaturgy",
        "• 1st level (4 slots): charm person, command, detect magic, disguise self, protection from evil and good, sanctuary",
        "• 2nd level (3 slots): augury, lesser restoration, mirror image, pass without trace, spiritual weapon",
        "• 3rd level (3 slots): blink, clairvoyance, dispel magic, magic circle, protection from energy",
        "• 4th level (3 slots): banishment, dimension door, divination, freedom of movement, polymorph",
        "• 5th level (2 slots): dominate person, flame strike, modify memory, insect plague",
        "• 6th level (1 slots): heal",
        "• 7th level (1 slots): divine word",
        "• 8th level (1 slots): earthquake"
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "Victoro makes two attacks with his rapier."
      ]
    },
    {
      "name": "Rapier",
      "text": [
        "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 5 (1d8 + 1) piercing damage."
      ],
      "attack": [
        "Rapier|+5|1d8+1"
      ]
    },
    {
      "name": "Cloak of Shadows (2/Day)",
      "text": [
        "Victoro becomes invisible until the end of his next turn. He becomes visible early immediately after he attacks or casts a spell."
      ]
    },
    {
      "name": "Summon Devil (Recharges after 9 Days)",
      "text": [
        "Victoro summons a barbed devil. The devil appears in an unoccupied space within 30 feet of Victoro, acts as Victoro's ally, and can't summon other devils. It remains for 1 minute, until it or Victoro dies, or until Victoro dismisses it as an action."
      ]
    }
  ],
  "slots": [
    "4, 3, 3, 3, 2, 1, 1, 1"
  ],
  "spells": "guidance, light, mending, spare the dying, thaumaturgy, charm person, command, detect magic, disguise self, protection from evil and good, sanctuary, augury, lesser restoration, mirror image, pass without trace, spiritual weapon, blink, clairvoyance, dispel magic, magic circle, protection from energy, banishment, dimension door, divination, freedom of movement, polymorph, dominate person, flame strike, modify memory, insect plague, heal, divine word, earthquake",
  "description": "The lord of House Cassalanter is a devilishly handsome half-elf who likes coin and power. He and his wife gained both by cutting a deal with Asmodeus-which involved trading away the souls of their three children.\nVictoro is a priest of Asmodeus, though his devotion to the Lord of the Nine Hells is a secret known only to his wife and his closest friends. Most Waterdavians know him as a successful banker, philanthropist, and worshiper of Lathander. Some of his business profits go toward feeding and sheltering the poor. But behind this veneer of generosity, Victoro is a self-serving beast.\nThe soul of Victoro's eldest son, Osvaldo, is forever lost and can't be saved. To allay his guilt, Victoro has forged a plan to win back the souls of his young twins, Terenzio and Elzerina. Under the terms of the contract, their souls will be forfeit on their ninth birthdays, and that day is fast approaching. But Victoro can buy his way out of the obligation by providing, as the contract states, \"one shy of a million gold coins and the sacrifice of one shy of a hundred unfortunate souls.\"\nVictoro is well schooled, suave, slow to anger, and blessed with good health, long life, and immunity to disease. He dresses in the latest fashions and walks with a ruby-tipped cane, though not because he needs to. This cane has the magical properties of a rod of rulership.\nSource: Waterdeep: Dragon Heist p. 218"
}