{
  "name": "Whymsee",
  "size": "M",
  "type": "humanoid (any race)",
  "alignment": "Any Evil Alignment",
  "ac": "10",
  "hp": "75 (10d8+30)",
  "speed": "walk 30 ft., swim 30 ft.",
  "str": "12",
  "dex": "10",
  "con": "16",
  "int": "10",
  "wis": "15",
  "cha": "14",
  "skill": "Perception +5",
  "passive": "15",
  "languages": "any two languages",
  "cr": "5",
  "resist": "bludgeoning, piercing, slashing from nonmagical attacks",
  "trait": [
    {
      "name": "Amphibious",
      "text": [
        "Whymsee can breathe air and water."
      ]
    },
    {
      "name": "Innate Spellcasting",
      "text": [
        "Whymsee's spellcasting ability is Wisdom (spell save DC 13, +5 to hit with spell attacks). It can innately cast the following spells, requiring no material components:",
        "At will: command, create or destroy water",
        "3/day each: control water, darkness, water breathing, water walk",
        "1/day each: call lightning, Evard's black tentacles"
      ]
    }
  ],
  "action": [
    {
      "name": "Thunderous Touch",
      "text": [
        "Melee Spell Attack: +5 to hit, reach 5 ft., one creature. 27 (5d10) thunder damage."
      ],
      "attack": [
        "Thunderous Touch|+5|5d10"
      ]
    },
    {
      "name": "Shell Defense",
      "text": [
        "Whymsee withdraws into her shell. Until she emerges, she gains a +4 bonus to AC and has advantage on Strength and Constitution saving throws. While in her shell, Whymsee is prone, her speed is 0 and can't increase, she has disadvantage on Dexterity saving throws, it can't take reactions, and the only action she can take is a bonus action to emerge."
      ]
    },
    {
      "name": "Ink Cloud",
      "text": [
        "While underwater, Whymsee can expel an ink cloud in a 20-foot radius. The cloud spreads around corners, and that area is heavily obscured to creatures other than kraken priests or a kraken. Each creature other than a kraken priest or a kraken that ends its turn there must succeed on a DC 14 Constitution saving throw, taking 9 (2d8) poison damage on a failed save, or half as much damage on a successful one. A strong current disperses the cloud, which otherwise disappears at the end of Whymsee's next turn."
      ],
      "attack": [
        "Ink Cloud||2d8"
      ]
    }
  ],
  "spells": "command, create or destroy water, control water, darkness, water breathing, water walk, call lightning, Evard's black tentacles",
  "description": "\nSource: Locathah Rising p. 20",
  "environment": "coastal, underwater"
}