{
  "name": "Witch Queen",
  "size": "S",
  "type": "humanoid (derro)",
  "alignment": "Chaotic Evil",
  "ac": "15 (studded leather armor)",
  "hp": "77 (14d6+28)",
  "speed": "walk 30 ft.",
  "str": "9",
  "dex": "16",
  "con": "14",
  "int": "11",
  "wis": "9",
  "cha": "16",
  "skill": "Arcana +3, Stealth +6",
  "passive": "9",
  "languages": "Common, Dwarvish, Undercommon",
  "cr": "5",
  "senses": "darkvision 120 ft.",
  "trait": [
    {
      "name": "Heightened Spell (3/Day)",
      "text": [
        "As a bonus action, a target of the witch queen's choice within 60 feet of her has disadvantage on its saving throw against her next spell."
      ]
    },
    {
      "name": "Magic Resistance",
      "text": [
        "The witch queen has advantage on saving throws against spells and other magical effects."
      ]
    },
    {
      "name": "Sunlight Sensitivity",
      "text": [
        "While in sunlight, the witch queen has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "The witch queen is an 8th-level spellcaster. Its spellcasting ability is Charisma (spell save DC 14, +6 to hit with spell attacks). The witch queen has the following Wizard spells prepared:",
        "Cantrips (at will): acid splash, mage hand, message, ray of frost",
        "• 1st level (4 slots): burning hands, magic missile, sleep",
        "• 2nd level (3 slots): invisibility, spider climb, suggestion",
        "• 3rd level (3 slots): blink, fear, lightning bolt",
        "• 4th level (2 slots): blight, confusion"
      ]
    }
  ],
  "action": [
    {
      "name": "Maddening Scimitar",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 6 (1d6 + 3) slashing damage. If the target is a creature, it must succeed on a DC 14 Charisma saving throw or use its reaction to move up to its speed and make a melee attack against the nearest enemy of the witch queen."
      ],
      "attack": [
        "Maddening Scimitar|6|1d6+3"
      ]
    }
  ],
  "slots": [
    "4, 3, 3, 2"
  ],
  "spells": "acid splash, mage hand, message, ray of frost, burning hands, magic missile, sleep, invisibility, spider climb, suggestion, blink, fear, lightning bolt, blight, confusion",
  "description": "Source: CCodex (3pp) p. 97"
}