{
  "name": "Wyllow",
  "size": "M",
  "type": "humanoid (elf)",
  "alignment": "Any alignment",
  "ac": "16 (hide armor, shield)",
  "hp": "132 (24d8+24)",
  "speed": "walk 35 ft.",
  "str": "10",
  "dex": "14",
  "con": "12",
  "int": "12",
  "wis": "20",
  "cha": "11",
  "save": "Int +5, Wis +9",
  "skill": "Medicine +9, Nature +5, Perception +1",
  "passive": "19",
  "languages": "Druidic plus any two languages, Elvish",
  "cr": "12",
  "senses": "darkvision 60 ft.",
  "trait": [
    {
      "name": "Fey Ancestry",
      "text": [
        "<$title_short_name$> has advantage on saving throws against being charmed, and magic can't put Wyllow to sleep."
      ]
    },
    {
      "name": "Mask of the Wild",
      "text": [
        "<$title_short_name$> can attempt to hide even when they are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena."
      ]
    },
    {
      "name": "Spellcasting",
      "text": [
        "Wyllow is an 18th-level spellcaster. Its spellcasting ability is Wisdom (spell save DC 17, +9 to hit with spell attacks). It has the following druid spells prepared:",
        "Cantrips (at will): druidcraft, mending, poison spray, produce flame",
        "• 1st level (4 slots): cure wounds, entangle, faerie fire, speak with animals",
        "• 2nd level (3 slots): animal messenger, beast sense, hold person",
        "• 3rd level (3 slots): conjure animals, meld into stone, water breathing",
        "• 4th level (3 slots): dominate beast, locate creature, stoneskin, wall of fire",
        "• 5th level (3 slots): commune with nature, mass cure wounds, tree stride",
        "• 6th level (1 slots): heal, heroes' feast, sunbeam",
        "• 7th level (1 slots): fire storm",
        "• 8th level (1 slots): animal shapes",
        "• 9th level (1 slots): foresight"
      ]
    }
  ],
  "action": [
    {
      "name": "Scimitar",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 5 (1d6 + 2) slashing damage."
      ],
      "attack": [
        "Scimitar|+6|1d6+2"
      ]
    },
    {
      "name": "Change Shape (2/Day)",
      "text": [
        "Wyllow magically polymorphs into a beast or elemental with a challenge rating of 6 or less, and can remain in this form for up to 9 hours. Wyllow can choose whether its equipment falls to the ground, melds with its new form, or is worn by the new form. Wyllow reverts to its true form if it dies or falls unconscious. Wyllow can revert to its true form using a bonus action on its turn.",
        "While in a new form, Wyllow retains its game statistics and ability to speak, but its AC, movement modes, Strength, and Dexterity are replaced by those of the new form, and it gains any special senses, proficiencies, traits, actions, and reactions (except class features, legendary actions, and lair actions) that the new form has but that it lacks. It can cast its spells with verbal or somatic components in its new form.",
        "The new form's attacks count as magical for the purpose of overcoming resistances and immunity to nonmagical attacks."
      ]
    }
  ],
  "slots": [
    "4, 3, 3, 3, 3, 1, 1, 1, 1"
  ],
  "spells": "druidcraft, mending, poison spray, produce flame, cure wounds, entangle, faerie fire, speak with animals, animal messenger, beast sense, hold person, conjure animals, meld into stone, water breathing, dominate beast, locate creature, stoneskin, wall of fire, commune with nature, mass cure wounds, tree stride, heal, heroes' feast, sunbeam, fire storm, animal shapes, foresight",
  "description": "\nSource: Waterdeep: Dungeon of the Mad Mage p. 70",
  "environment": "forest, mountain, swamp"
}