{
  "name": "Yalah Gralhund",
  "size": "M",
  "type": "humanoid (Tethyrianhuman)",
  "alignment": "Lawful Evil",
  "ac": "15 (breastplate)",
  "hp": "9 (2d8)",
  "speed": "walk 30 ft.",
  "str": "11",
  "dex": "12",
  "con": "11",
  "int": "12",
  "wis": "16",
  "cha": "16",
  "skill": "Deception +5, Insight +5, Persuasion +5",
  "passive": "13",
  "languages": "Common, Infernal",
  "cr": "1/8",
  "action": [
    {
      "name": "Rapier",
      "text": [
        "Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 5 (1d8 + 1) piercing damage."
      ],
      "attack": [
        "Rapier|+3|1d8+1"
      ]
    }
  ],
  "reaction": [
    {
      "name": "Parry",
      "text": [
        "Yalah adds 2 to its AC against one melee attack that would hit it. To do so, Yalah must see the attacker and be wielding a melee weapon."
      ]
    }
  ],
  "description": "The lady of House Gralhund is no fool. She has a keen mind and the wisdom to discern friend from foe. She also has a husband who worships her (see \"Orond Gralhund\"), and a house that has the resources of the Black Network at its disposal.\nYalah stays abreast of events in the city, keeps a tight rein on her children, and uses her station and her family's wealth to pry secrets from the lips of nobles, guildmasters, and commoners alike. Though her previous attempts to become a Masked Lord have been thwarted, she believes it's only a matter of time until that honor is bestowed on her. Once she knows the identities and secrets of enough Masked Lords, Yalah is confident that she can bribe, blackmail, or extort her way into their ranks. From there, she plans to effect changes in the government that will ensure House Gralhund's prosperity for generations to come.\nYalah shares the services of a half-orc bodyguard with her husband, although Hrabbaz (see \"Hrabbaz\") is more loyal to her than to him. She also uses the Zhentarim who are based in House Gralhund as her personal spy network, not realizing that the Zhents' true master is Manshoon. Most of her dealings are with the Zhent master assassin Urstul Floxin (see \"Urstul Floxin\"), whom she treats as an underling.\nSource: Waterdeep: Dragon Heist p. 220"
}