{
  "name": "Yorb",
  "size": "S",
  "type": "humanoid (grung)",
  "alignment": "Lawful Evil",
  "ac": "13",
  "hp": "49 (9d6+18)",
  "speed": "walk 25 ft., climb 25 ft.",
  "str": "7",
  "dex": "16",
  "con": "15",
  "int": "10",
  "wis": "11",
  "cha": "12",
  "save": "Dex +5",
  "skill": "Athletics +2, Perception +2, Stealth +5, Survival +2",
  "passive": "12",
  "languages": "Grung",
  "cr": "2",
  "immune": "poison",
  "conditionImmune": "poisoned",
  "trait": [
    {
      "name": "Amphibious",
      "text": [
        "Yorb can breathe air and water."
      ]
    },
    {
      "name": "Poisonous Skin",
      "text": [
        "Any creature that grapples Yorb or otherwise comes into direct contact with Yorb's skin must succeed on a DC 12 Constitution saving throw or become poisoned for 1 minute. A poisoned creature no longer in direct contact with Yorb can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
      ]
    },
    {
      "name": "Standing Leap",
      "text": [
        "Yorb's long jump is up to 25 feet and its high jump is up to 15 feet, with or without a running start."
      ]
    }
  ],
  "action": [
    {
      "name": "Dagger",
      "text": [
        "Melee or Ranged Weapon Attack: +5 to hit, reach 5 ft. or range 20/60 ft., one target. 5 (1d4 + 3) piercing damage, and the target must succeed on a DC 12 Constitution saving throw or take 5 (2d4) poison damage."
      ],
      "attack": [
        "Dagger|+5|1d4+3",
        "Dagger||2d4"
      ]
    },
    {
      "name": "Shortbow",
      "text": [
        "Ranged Weapon Attack: +5 to hit, range 80/320 ft., one target. 6 (1d6 + 3) piercing damage, and the target must succeed on a DC 12 Constitution saving throw or take 5 (2d4) poison damage."
      ],
      "attack": [
        "Shortbow|+5|1d6+3",
        "Shortbow||2d4"
      ]
    },
    {
      "name": "Mesmerizing Chirr (Recharge 6)",
      "text": [
        "Yorb makes a chirring noise to which grungs are immune. Each humanoid or beast that is within 15 feet of Yorb and able to hear it must succeed on a DC 12 Wisdom saving throw or be stunned until the end of Yorb's next turn."
      ]
    },
    {
      "name": "Variant: Grung Poison",
      "text": [
        "Grung poison loses its potency 1 minute after being removed from a grung. A similar breakdown occurs if Yorb dies. A creature poisoned by a grung can suffer an additional effect that varies depending on Yorb's skin color. This effect lasts until the creature is no longer poisoned by Yorb.",
        "Green. The poisoned creature can't move except to climb or make standing jumps. If the creature is flying, it can't take any actions or reactions unless it lands.",
        "Blue. The poisoned creature must shout loudly or otherwise make a loud noise at the start and end of its turn.",
        "Purple. The poisoned creature feels a desperate need to soak itself in liquid or mud. It can't take actions or move except to do so or to reach a body of liquid or mud.",
        "Red. The poisoned creature must use its action to eat if food is within reach.",
        "Orange. The poisoned creature is frightened of its allies.",
        "Gold. The poisoned creature is charmed and can speak Grung."
      ]
    }
  ],
  "description": "\nSource: Tomb of Annihilation p. 108",
  "environment": "forest"
}