{
  "name": "Young Light Dragon",
  "size": "L",
  "type": "dragon",
  "alignment": "Good Neutral",
  "ac": "15 (natural armor)",
  "hp": "142 (15d10+60)",
  "speed": "walk 40 ft., fly 80 ft.",
  "str": "18",
  "dex": "10",
  "con": "19",
  "int": "14",
  "wis": "16",
  "cha": "15",
  "save": "Dex +3, Con +7, Wis +6, Cha +5",
  "skill": "Perception +6, Persuasion +5",
  "passive": "16",
  "languages": "Draconic",
  "cr": "7",
  "resist": "bludgeoning, piercing, slashing from nonmagical weapons",
  "immune": "radiant",
  "conditionImmune": "blinded",
  "senses": "blindsight 30 ft., darkvision 120 ft.",
  "trait": [
    {
      "name": "Illumination",
      "text": [
        "The dragon sheds bright light in a 15-foot radius and dim light for an additional 15 feet.Incorporeal Movement. The dragon can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."
      ]
    },
    {
      "name": "Void Traveler",
      "text": [
        "The light dragon travels from star to star and does not require air, food, drink, or sleep. When flying between stars, the light dragon magically glides on solar winds, making the immense journey through the void in an impossibly short time."
      ]
    }
  ],
  "action": [
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. 15 (2d10 + 4) piercing damage."
      ],
      "attack": [
        "Bite|7|2d10+4"
      ]
    },
    {
      "name": "Breath Weapon (Recharge 56)",
      "text": [
        "The dragon uses one of the following breath weapons."
      ]
    },
    {
      "name": "Radiant Breath",
      "text": [
        "The dragon exhales radiant energy in a 30-foot cone. Each creature in that area must make a DC 15 Dexterity saving throw, taking 44 (8d10) radiant damage on a failed save, or half as much damage on a successful one."
      ]
    },
    {
      "name": "Flaring Breath",
      "text": [
        "The dragon emits a flash of dazzling light from its maw in a 30-foot cone. Each creature in that area must make a DC 15 Constitution saving throw or be blinded.",
        "Undead within the area of effect must also make a DC 15 Wisdom saving throw or be turned for 1 minute. Undead of CR 1 or lower who fail the saving throw are instantly destroyed."
      ]
    }
  ],
  "description": "Source: CCodex (3pp)"
}