{
  "name": "Young Bronze Dragon",
  "size": "L",
  "type": "dragon",
  "alignment": "Lawful Good",
  "ac": "18 (natural armor)",
  "hp": "142 (15d10+60)",
  "speed": "walk 40 ft., fly 80 ft., swim 40 ft.",
  "str": "21",
  "dex": "10",
  "con": "19",
  "int": "14",
  "wis": "13",
  "cha": "17",
  "save": "Dex +3, Con +7, Wis +4, Cha +6",
  "skill": "Insight +4, Perception +7, Stealth +3",
  "passive": "17",
  "languages": "Common, Draconic",
  "cr": "8",
  "immune": "lightning",
  "senses": "blindsight 30 ft., darkvision 120 ft.",
  "trait": [
    {
      "name": "Amphibious",
      "text": [
        "The dragon can breathe air and water."
      ]
    }
  ],
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The dragon makes three attacks: one with its bite and two with its claws."
      ]
    },
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +8 to hit, reach 10 ft., one target. 16 (2d10 + 5) piercing damage."
      ],
      "attack": [
        "Bite|+8|2d10+5"
      ]
    },
    {
      "name": "Claw",
      "text": [
        "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. 12 (2d6 + 5) slashing damage."
      ],
      "attack": [
        "Claw|+8|2d6+5"
      ]
    },
    {
      "name": "Breath Weapons (Recharge 5-6)",
      "text": [
        "The dragon uses one of the following breath weapons.",
        "• Lightning Breath. The dragon exhales lightning in a 60-foot line that is 5 feet wide. Each creature in that line must make a DC 15 Dexterity saving throw, taking 55 (10d10) lightning damage on a failed save, or half as much damage on a successful one.",
        "• Repulsion Breath. The dragon exhales repulsion energy in a 30-foot cone. Each creature in that area must succeed on a DC 15 Strength saving throw. On a failed save, the creature is pushed 40 feet away from the dragon."
      ],
      "attack": [
        "Breath Weapons (Recharge 5-6)||10d10"
      ]
    }
  ],
  "description": "True dragons are winged reptiles of ancient lineage and fearsome power. They are known and feared for their predatory cunning and greed, with the oldest dragons accounted as some of the most powerful creatures in the world. Dragons are also magical creatures whose innate power fuels their dreaded breath weapons and other preternatural abilities.\nMany creatures, including wyverns and dragon turtles, have draconic blood. However, true dragons fall into the two broad categories of chromatic and metallic dragons. The black, blue, green, red, and white dragons are selfish, evil, and feared by all. The brass, bronze, copper, gold, and silver dragons are noble, good, and highly respected by the wise.\nThough their goals and ideals vary tremendously, all true dragons covet wealth, hoarding mounds of coins and gathering gems, jewels, and magic items. Dragons with large hoards are loath to leave them for long, venturing out of their lairs only to patrol or feed.\nTrue dragons pass through four distinct stages of life, from lowly wyrmlings to ancient dragons, which can live for over a thousand years. In that time, their might can become unrivaled and their hoards can grow beyond price.\nDragon Age Categories\nCategory | Size | Age Range\nWyrmling | Medium | 5 years or less\nYoung | Large | 6–100 years\nAdult | Huge | 101–800 years\nAncient | Gargantuan | 801 years or more\n\nSource: Monster Manual p. 108, Waterdeep: Dragon Heist, Ghosts of Saltmarsh",
  "environment": "coastal"
}