{
  "name": "Zimwi",
  "size": "M",
  "type": "giant,tome of Beasts",
  "alignment": "chaotic evil",
  "ac": "17 (natural armor)",
  "hp": "76 (9d8+36)",
  "speed": "40 ft.",
  "str": "13",
  "dex": "18",
  "con": "19",
  "int": "6",
  "wis": "9",
  "cha": "7",
  "skill": "Perception +1",
  "senses": "darkvision 60 ft.",
  "passive": "11",
  "languages": " Giant",
  "cr": "4",
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "The zimwi makes one claws attack and one bite attack."
      ]
    },
    {
      "name": "Bite",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) piercing damage. If the target is a Medium or smaller creature grappled by the zimwi, that creature is swallowed, and the grapple ends. While swallowed, the creature is blinded and restrained, it has total cover against attacks and other effects outside the zimwi, and it takes 14 (4d6) acid damage at the start of each of the zimwi's turns. If the zimwi's stomach takes 20 damage or more on a single turn from a creature inside it, the zimwi must succeed on a DC 14 Constitution saving throw at the end of that turn or regurgitate all swallowed creatures, which fall prone in a space within 5 feet of the zimwi. Damage done to a zimwi's stomach does not harm the zimwi. The zimwi's stomach is larger on the inside than the outside. It can have two Medium creatures or four Small or smaller creatures swallowed at one time. If the zimwi dies, a swallowed creature is no longer restrained by it and can escape from the corpse using 5 feet of movement, exiting prone."
      ],
      "attack": [
        "Bite|6|2d8+4"
      ]
    },
    {
      "name": "Claws",
      "text": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) slashing damage, and if the target is a Medium or smaller creature and the zimwi isn't already grappling a creature, it is grappled (escape DC 11)."
      ],
      "attack": [
        "Claws|6|2d6+4"
      ]
    }
  ]
}