{
  "name": "Ziraj the Hunter",
  "size": "M",
  "type": "humanoid (half-orc)",
  "alignment": "Lawful Evil",
  "ac": "17 (+2 leather armor)",
  "hp": "153 (18d8+72)",
  "speed": "walk 30 ft.",
  "str": "18",
  "dex": "18",
  "con": "18",
  "int": "11",
  "wis": "14",
  "cha": "15",
  "save": "Wis +5, Cha +5",
  "skill": "Athletics +7, Intimidation +5, Stealth +7, Survival +5",
  "passive": "12",
  "languages": "Common, Orc",
  "cr": "8",
  "senses": "darkvision 60 ft.",
  "action": [
    {
      "name": "Multiattack",
      "text": [
        "Ziraj makes three attacks with his glaive or with his oversized longbow."
      ]
    },
    {
      "name": "Glaive",
      "text": [
        "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. 9 (1d10 + 4) slashing damage."
      ],
      "attack": [
        "Glaive|+7|1d10+4"
      ]
    },
    {
      "name": "Oversized Longbow",
      "text": [
        "Ranged Weapon Attack: +7 to hit, range 150/600 ft., one target. 11 (2d6 + 4) piercing damage."
      ],
      "attack": [
        "Oversized Longbow|+7|2d6+4"
      ]
    },
    {
      "name": "Dreadful Aspect (Recharges after a Short or Long Rest)",
      "text": [
        "Ziraj exudes magical menace. Each enemy within 30 feet of him must succeed on a DC 13 Wisdom saving throw or be frightened for 1 minute of Ziraj. If a frightened enemy ends its turn more than 30 feet away from Ziraj, the enemy can repeat the saving throw, ending the effect on itself on a success."
      ]
    }
  ],
  "trait": [
    {
      "name": "Spellcasting",
      "text": [
        "Ziraj is a 10th-level spellcaster. His spellcasting ability is Charisma. He has the following paladin spells prepared:",
        "• 1st level (4 slots): command, protection from evil and good, thunderous smite",
        "• 2nd level (3 slots): branding smite, find steed",
        "• 3rd level (2 slots): blinding smite, dispel magic"
      ]
    }
  ],
  "slots": [
    "4, 3, 2"
  ],
  "spells": "command, protection from evil and good, thunderous smite, branding smite, find steed, blinding smite, dispel magic",
  "description": "Ziraj is a half-orc hunter who wields an oversized bow that shoots correspondingly large arrows. He is the Master of Assassination for the Black Network. If Ziraj sets out to kill someone, it's because one of his friends (Davil, Istrid, Skeemo, or Tashlyn) asked him to. The characters might become Ziraj's prey, or Ziraj might come to their aid to eliminate a common enemy. He's the strong, silent type.\nThe City Watch has received reports of a figure who haunts the rooftops of Waterdeep-a hulking shadow that glares from its perch, rains down death in the form of long black arrows, and slinks off without so much as a whisper. Where he comes from-if he even has a home-remains a mystery, as does the question of where he might show up next.\nTreasure. Ziraj wears +2 leather armor and carries an oversized longbow. This unique weapon can be used only by a Medium or larger creature that has a Strength of 18 or higher. The bow shoots oversized arrows that deal piercing damage equal to 2d6 + the wielder's Strength modifier. Its range is the same as an ordinary longbow.\nThe Doom Raiders. The Doom Raiders were five unscrupulous adventurers who liked to plunder lich lairs (called \"dooms\" by some). They gave up adventuring to join the Black Network and came to Waterdeep three years ago with plans to establish a Zhentarim foothold in the city. In that time, they have forged alliances with various nobles and guilds and run afoul of others, all the while fending off Harper spies.\nSource: Waterdeep: Dragon Heist p. 201"
}