{
  "name": "Deck of Illusions",
  "detail": "Wondrous item, major",
  "type": "W",
  "magic": "1",
  "text": "This box contains a set of parchment cards. A full deck has 34 cards. A deck found as treasure is usually missing 1d20 - 1 cards.\nThe magic of the deck functions only if cards are drawn at random (you can use an altered deck of playing cards to simulate the deck). You can use an action to draw a card at random from the deck and throw it to the ground at a point within 30 feet of you.\nAn illusion of one or more creatures forms over the thrown card and remains until dispelled. An illusory creature appears real, of the appropriate size, and behaves as if it were a real creature, except that it can do no harm. While you are within 120 feet of the illusory creature and can see it, you can use an action to move it magically anywhere within 30 feet of its card. Any physical interaction with the illusory creature reveals it to be an illusion, because objects pass through it. Someone who uses an action to visually inspect the creature identifies it as illusory with a successful DC 15 Intelligence (Investigation) check. The creature then appears translucent.\nThe illusion lasts until its card is moved or the illusion is dispelled. When the illusion ends, the image on its card disappears, and that card can't be used again.\n1d33 | Illusion\n1 | adult red dragon\n2 | Knight and four guard\n3 | Succubus\n4 | Druid\n5 | Cloud giant\n6 | Ettin\n7 | Bugbear\n8 | Goblin\n9 | Beholder\n10 | Archmage and mage apprentice\n11 | Night hag\n12 | Assassin\n13 | Fire giant\n14 | oni\n15 | Gnoll\n16 | Kobold\n17 | Lich\n18 | Priest and two acolyte\n19 | Medusa\n20 | Veteran\n21 | Frost giant\n22 | Troll\n23 | Hobgoblin\n24 | Goblin\n25 | Iron golem\n26 | Bandit captain and three bandit\n27 | Erinyes\n28 | Berserker\n29 | Hill giant\n30 | Ogre\n31 | Orc\n32 | Kobold\n33-34 | You (the deck's owner)\nFound On: Magic Item Table F\nSource: Dungeon Master's Guide p. 161",
  "roll": [
    "1d20-1",
    "1d33"
  ]
}