{
  "name": "Sending Stone",
  "detail": "Wondrous item",
  "type": "W",
  "magic": "1",
  "text": "Also at rank 1, you are given use of an Acquisitions Incorporated sending stone, an uncommon magic item that resembles a gemstone in a bold setting. It functions like a normal sending stone, except that it has no matching stone and allows communication with Head Office, specific secretarians you know, and the secretarian nearest your location. You must succeed on a DC 15 Intelligence (Arcana) check to establish contact. Once the stone is successfully used, it can't be used again until the next dawn.\nMaking contact with another secretarian assumes that they are in possession of their own sending stone.\nQuirks of Your Sending Stone\nd8 | quirk\n1 | It's a flip stone.\n2 | It gets great reception everywhere except in your headquarters.\n3 | It sometimes picks up other magical conversations.\n4 | It's the perfect size, shape, and weight to be used as a skipping stone.\n5 | It heats up when you use it, to the extent that it once burned through your gloves.\n6 | It has an obnoxious ringtone that you can't work out how to change.\n7 | It fails to notify you of incoming messages except for a faint pulsating glow.\n8 | It's voice activated, so that every time you talk to someone, it tries to send a message to someone else.\nRumor Mill: Also at rank 2, whenever your franchise begins a major quest or mission, make a DC 15 Intelligence (History) check. On a success, you can learn up to three rumors related to creatures or organizations involved in the mission, which come to you through your sending stone. These rumors reflect current or historical knowledge possessed by Acquisitions Incorporated or the organization's many contacts.\nImproved Rumor Mill: At rank 3, when you use your Rumor Mill feature, the DM provides you with a sense of which parts of a particular rumor are inaccurate, if any. You do not necessarily learn the truth behind those false rumors.\nSource: Acquisitions Incorporated p. 33"
}