{
  "name": "Trinket (Gothic)",
  "detail": "Adventuring Gear",
  "type": "G",
  "text": "When you make your character, you can roll once on the Trinkets table to gain a trinket, a simple item lightly touched by mystery. The DM might also use this table. It can help stock a room in a dungeon or fill a creatures pockets.\nCurse of Strahd. Character Options, Gothic Trinket Table\nd100 | Trinket\n01-02 | A picture you drew as a child of your imaginary friend\n03-04 | A lock that opens when blood is dripped in its keyhole\n05-06 | Clothes stolen from a scarecrow\n07-08 | A spinning top carved with four faces: happy, sad, wrathful, and dead\n09-10 | The necklace of a sibling who died on the day you were born\n11-12 | A wig from someone executed by beheading\n13-14 | The unopened letter to you from your dying father\n15-16 | A pocket watch that runs backward for an hour every midnight\n17-18 | A winter coat stolen from a dying soldier\n19-20 | A bottle of invisible ink that can only be read at sunset\n21-22 | A wineskin that refills when interred with a dead person for a night\n23-24 | A set of silverware used by a king for his last meal\n25-26 | A spyglass that always shows the world suffering a terrible storm\n27-28 | A cameo with the profile's face scratched away\n29-30 | A lantern with a black candle that never runs out and that burns with green flame\n31-32 | A teacup from a child's tea set, stained with blood\n33-34 | A little black book that records your dreams, and yours alone, when you sleep\n35-36 | A necklace formed of the interlinked holy symbols of a dozen deities\n37-38 | A hangman's noose that feels heavier than it should\n39-40 | A birdcage into which small birds fly but once inside never eat or leave\n41-42 | A lepidopterist's box filled dead moths with skulllike patterns on their wings\n43-44 | A jar of pickled ghouls' tongues\n45-46 | The wooden hand of a notorious pirate\n47-48 | An urn with the ashes of a dead relative\n49-50 | A hand mirror backed with a bronze depiction of a medusa\n51-52 | Pallid leather gloves crafted with ivory fingernails\n53-54 | Dice made from the knuckles of a notorious charlatan\n55-56 | A ring of keys for forgotten locks\n57-58 | Nails from the coffin of a murderer\n59-60 | A key to the family crypt\n61-62 | A bouquet of funerary flowers that always looks and smells fresh\n63-64 | A switch used to discipline you as a child\n65-66 | A music box that plays by itself whenever someone holding it dances\n67-68 | A walking cane with an iron ferrule that strikes sparks on stone\n69-70 | A flag from a ship lost at sea\n71-72 | Porcelain doll's head that always seems to be looking at you\n73-74 | A wolf's head wrought in silver that is also a whistle\n75-76 | A small mirror that shows a much older version of the viewer\n77-78 | Small, worn book of children's nursery rhymes\n79-80 | A mummified raven claw\n81-82 | A broken pendent of a silver dragon that's always cold to the touch\n83-84 | A small locked box that quietly hums a lovely melody at night but you always forget it in the morning\n85-86 | An inkwell that makes one a little nauseous when staring at it\n87-88 | An old little doll made from a dark, dense wood and missing a hand and a foot\n89-90 | A black executioner's hood\n91-92 | A pouch made of flesh, with a sinew drawstring\n93-94 | A tiny spool of black thread that never runs out\n95-96 | A tiny clockwork figurine of a dancer that's missing a gear and doesn't work\n97-98 | A black wooden pipe that creates puffs of smoke that look like skulls\n99-00 | A vial of perfume, the scent of which only certain creatures can detect\nSource: Curse of Strahd p. 2"
}