{
  "name": "Cleric",
  "hd": "8",
  "proficiency": "Wisdom, Charisma, History, Insight, Medicine, Persuasion, Religion",
  "spellAbility": "Wisdom",
  "numSkills": "2",
  "armor": "light, medium, shields",
  "weapons": "simple",
  "tools": "none",
  "wealth": "5d4x10",
  "autolevel": [
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Starting Cleric"
          ],
          "text": [
            "As a 1st-level Cleric, you begin play with 8+your Constitution modifier hit points.",
            "",
            "You are proficient with the following items, in addition to any proficiencies provided by your race or background.",
            "• Armor: light, medium, shields",
            "• Weapons: simple",
            "• Tools: none",
            "• Skills: Choose 2 from History, Insight, Medicine, Persuasion, Religion",
            "",
            "You begin play with the following equipment, in addition to any equipment provided by your background.",
            "• (a) a mace or (b) a warhammer (if proficient)",
            "• (a) scale mail, (b) leather armor, or (c) chain mail (if proficient)",
            "• (a) a light crossbow and Crossbow Bolts (20) or (b) any simple weapon",
            "• (a) a priest's pack or (b) an explorer's pack",
            "• A shield and a holy symbol",
            "",
            "Alternatively, you may start with 5d4 x 10 gp and choose your own equipment.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Multiclass Cleric"
          ],
          "text": [
            "To multiclass as a Cleric, you must meet the following prerequisites:",
            "• Wisdom 13",
            "",
            "You gain the following proficiencies:",
            "• Armor: light, medium, shields",
            "• Weapons: none",
            "• Tools: none",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "slots": "3, 2"
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "name": [
            "Spellcasting"
          ],
          "text": [
            "As a conduit for divine power, you can cast cleric spells. See chapter 10 for the general rules of spellcasting and chapter 11 for a selection of cleric spells.",
            "",
            "Cantrips:",
            "   At 1st level, you know three cantrips of your choice from the cleric spell list. You learn additional cleric cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Cleric table.",
            "",
            "Preparing and Casting Spells:",
            "   The Cleric table shows how many spell slots you have to cast your cleric spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
            "   You prepare the list of cleric spells that are available for you to cast, choosing from the cleric spell list. When you do so, choose a number of cleric spells equal to your Wisdom modifier + your cleric level (minimum of one spell). The spells must be of a level for which you have spell slots.",
            "   For example, if you are a 3rd-level cleric, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.",
            "   You can change your list of prepared spells when you finish a long rest. Preparing a new list of cleric spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.",
            "",
            "Spellcasting Ability:",
            "   Wisdom is your spellcasting ability for your cleric spells. The power of your spells comes from your devotion to your deity. You use your Wisdom whenever a cleric spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a cleric spell you cast and when making an attack roll with one.",
            "",
            "Ritual Casting:",
            "   You can cast a cleric spell as a ritual if that spell has the ritual tag and you have the spell prepared.",
            "",
            "Spellcasting Focus:",
            "   You can use a holy symbol as a spellcasting focus for your cleric spells.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "name": [
            "Divine Domain"
          ],
          "text": [
            "Choose one domain related to your deity from the list of available domains. Each domain is detailed in their own feature, and each one provides examples of gods associated with it. Your choice grants you domain spells and other features when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels.",
            "",
            "Domain Spells:",
            "   Each domain has a list of spells—its domain spells—that you gain at the cleric levels noted in the domain description. Once you gain a domain spell, you always have it prepared, and it doesn't count against the number of spells you can prepare each day.",
            "   If you have a domain spell that doesn't appear on the cleric spell list, the spell is nonetheless a cleric spell for you.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Knowledge Domain"
          ],
          "text": [
            "The gods of knowledge—including Oghma, Boccob, Gilean, Aureon, and Thoth—value learning and understanding above all. Some teach that knowledge is to be gathered and shared in libraries and universities, or promote the practical knowledge of craft and invention. Some deities hoard knowledge and keep its secrets to themselves. And some promise their followers that they will gain tremendous power if they unlock the secrets of the multiverse. Followers of these gods study esoteric lore, collect old tomes, delve into the secret places of the earth, and learn all they can. Some gods of knowledge promote the practical knowledge of craft and invention, including smith deities like Gond, Reorx, Onatar, Moradin, Hephaestus, and Goibhniu.",
            "At each indicated cleric level, you add the listed spells to your spells prepared.",
            "",
            "Knowledge Domain Spells",
            "Cleric Level | Spells",
            "1st | command, identify",
            "3rd | augury, suggestion",
            "5th | nondetection, speak with dead",
            "7th | arcane eye, confusion",
            "9th | legend lore, scrying",
            "",
            "Source: Player's Handbook p. 59"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Knowledge Domain: Blessings of Knowledge"
          ],
          "text": [
            "At 1st level, you learn two languages of your choice. You also become proficient in your choice of two of the following skills: Arcana, History, Nature, or Religion.",
            "Your proficiency bonus is doubled for any ability check you make that uses either of those skills.",
            "",
            "Source: Player's Handbook p. 59"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Life Domain"
          ],
          "text": [
            "The Life domain focuses on the vibrant positive energy—one of the fundamental forces of the universe—that sustains all life. The gods of life promote vitality and health through healing the sick and wounded, caring for those in need, and driving away the forces of death and undeath. Almost any non-evil deity can claim influence over this domain, particularly agricultural deities (such as Chauntea, Arawai, and Demeter), sun gods (such as Lathander, Pelor, and Re-Horakhty), gods of healing or endurance (such as Ilmater, Mishakal, Apollo, and Diancecht), and gods of home and community (such as Hestia, Hathor, and Boldrei).",
            "At each indicated cleric level, you add the listed spells to your spells prepared.",
            "",
            "Life Domain Spells",
            "Cleric Level | Spells",
            "1st | bless, cure wounds",
            "3rd | lesser restoration, spiritual weapon",
            "5th | beacon of hope, revivify",
            "7th | death ward, guardian of faith",
            "9th | mass cure wounds, raise dead",
            "",
            "Source: Player's Handbook p. 60"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Life Domain: Bonus Proficiency"
          ],
          "text": [
            "When you choose this domain at 1st level, you gain proficiency with heavy armor.",
            "",
            "Source: Player's Handbook p. 60"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Life Domain: Disciple of Life"
          ],
          "text": [
            "Also starting at 1st level, your healing spells are more effective. Whenever you use a spell of 1st level or higher to restore hit points to a creature, the creature regains additional hit points equal to 2 + the spell's level.",
            "",
            "Source: Player's Handbook p. 60"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Light Domain"
          ],
          "text": [
            "Gods of light—including Helm, Lathander, Pholtus, Branchala, the Silver Flame, Belenus, Apollo, and Re-Horakhty—promote the ideals of rebirth and renewal, truth, vigilance, and beauty, often using the symbol of the sun. Some of these gods are portrayed as the sun itself or as a charioteer who guides the sun across the sky. Others are tireless sentinels whose eyes pierce every shadow and see through every deception. Some are deities of beauty and artistry, who teach that art is a vehicle for the soul's improvement. Clerics of a god of light are enlightened souls infused with radiance and the power of their gods' discerning vision, charged with chasing away lies and burning away darkness.",
            "At each indicated cleric level, you add the listed spells to your spells prepared.",
            "",
            "Light Domain Spells",
            "Cleric Level | Spells",
            "1st | burning hands, faerie fire",
            "3rd | flaming sphere, scorching ray",
            "5th | daylight, fireball",
            "7th | guardian of faith, wall of fire",
            "9th | flame strike, scrying",
            "",
            "Source: Player's Handbook p. 60"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Light Domain: Bonus Cantrip"
          ],
          "text": [
            "When you choose this domain at 1st level, you gain the light cantrip if you don't already know it.",
            "",
            "Source: Player's Handbook p. 60"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Light Domain: Warding Flare"
          ],
          "text": [
            "Also at 1st level, you can interpose divine light between yourself and an attacking enemy. When you are attacked by a creature within 30 feet of you that you can see, you can use your reaction to impose disadvantage on the attack roll, causing light to flare before the attacker before it hits or misses. An attacker that can't be blinded is immune to this feature.",
            "You can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest.",
            "",
            "Source: Player's Handbook p. 60"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Nature Domain"
          ],
          "text": [
            "Gods of nature are as varied as the natural world itself, from inscrutable gods of the deep forests (such as Silvanus, Obad-Hai, Chislev, Balinor, and Pan) to friendly deities associated with particular springs and groves (such as Eldath). Druids revere nature as a whole and might serve one of these deities, practicing mysterious rites and reciting all-but-forgotten prayers in their own secret tongue. But many of these gods have clerics as well, champions who take a more active role in advancing the interests of a particular nature god. These clerics might hunt the evil monstrosities that despoil the woodlands, bless the harvest of the faithful, or wither the crops of those who anger their gods.",
            "At each indicated cleric level, you add the listed spells to your spells prepared.",
            "",
            "Nature Domain Spells",
            "Cleric Level | Spells",
            "1st | animal friendship, speak with animals",
            "3rd | barkskin, spike growth",
            "5th | plant growth, wind wall",
            "7th | dominate beast, grasping vine",
            "9th | insect plague, tree stride",
            "",
            "Source: Player's Handbook p. 61"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Nature Domain: Acolyte of Nature"
          ],
          "text": [
            "At 1st level, you learn one druid cantrip of your choice. You also gain proficiency in one of the following skills of your choice: Animal Handling, Nature, or Survival.",
            "",
            "Source: Player's Handbook p. 61"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Nature Domain: Bonus Proficiency"
          ],
          "text": [
            "Also at 1st level, you gain proficiency with heavy armor.",
            "",
            "Source: Player's Handbook p. 61"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Tempest Domain"
          ],
          "text": [
            "Gods whose portfolios include the Tempest domain—including Talos, Umberlee, Kord, Zeboim, the Devourer, Zeus, and Thor—govern storms, sea, and sky. They include gods of lightning and thunder, gods of earthquakes, some fire gods, and certain gods of violence, physical strength, and courage. In some pantheons, a god of this domain rules over other deities and is known for swift justice delivered by thunderbolts. In the pantheons of seafaring people, gods of this domain are ocean deities and the patrons of sailors. Tempest gods send their clerics to inspire fear in the common folk, either to keep those folk on the path of righteousness or to encourage them to offer sacrifices of propitiation to ward off divine wrath.",
            "At each indicated cleric level, you add the listed spells to your spells prepared.",
            "",
            "Tempest Domain Spells",
            "Cleric Level | Spells",
            "1st | fog cloud, thunderwave",
            "3rd | gust of wind, shatter",
            "5th | call lightning, sleet storm",
            "7th | control water, ice storm",
            "9th | destructive wave, insect plague",
            "",
            "Source: Player's Handbook p. 62"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Tempest Domain: Bonus Proficiencies"
          ],
          "text": [
            "At 1st level, you gain proficiency with martial weapons and heavy armor.",
            "",
            "Source: Player's Handbook p. 62"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Tempest Domain: Wrath of the Storm"
          ],
          "text": [
            "Also at 1st level, you can thunderously rebuke attackers. When a creature within 5 feet of you that you can see hits you with an attack, you can use your reaction to cause the creature to make a Dexterity saving throw. The creature takes 2d8 lightning or thunder damage (your choice) on a failed saving throw, and half as much damage on a successful one.",
            "You can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest.",
            "",
            "Source: Player's Handbook p. 62"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Trickery Domain"
          ],
          "text": [
            "Gods of trickery—such as Tymora, Beshaba, Olidammara, the Traveler, Garl Glittergold, and Loki—are mischief-makers and instigators who stand as a constant challenge to the accepted order among both gods and mortals. They're patrons of thieves, scoundrels, gamblers, rebels, and liberators. Their clerics are a disruptive force in the world, puncturing pride, mocking tyrants, stealing from the rich, freeing captives, and flouting hollow traditions. They prefer subterfuge, pranks, deception, and theft rather than direct confrontation.",
            "At each indicated cleric level, you add the listed spells to your spells prepared.",
            "",
            "Trickery Domain Spells",
            "Cleric Level | Spells",
            "1st | charm person, disguise self",
            "3rd | mirror image, pass without trace",
            "5th | blink, dispel magic",
            "7th | dimension door, polymorph",
            "9th | dominate person, modify memory",
            "",
            "Source: Player's Handbook p. 62"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Trickery Domain: Blessing of the Trickster"
          ],
          "text": [
            "Starting when you choose this domain at 1st level, you can use your action to touch a willing creature other than yourself to give it advantage on Dexterity (Stealth) checks. This blessing lasts for 1 hour or until you use this feature again.",
            "",
            "Source: Player's Handbook p. 62"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: War Domain"
          ],
          "text": [
            "War has many manifestations. It can make heroes of ordinary people. It can be desperate and horrific, with acts of cruelty and cowardice eclipsing instances of excellence and courage. In either case, the gods of war watch over warriors and reward them for their great deeds. The clerics of such gods excel in battle, inspiring others to fight the good fight or offering acts of violence as prayers. Gods of war include champions of honor and chivalry (such as Torm, Heironeous, and Kiri-Jolith) as well as gods of destruction and pillage (such as Erythnul, the Fury, Gruumsh, and Ares) and gods of conquest and domination (such as Bane, Hextor, and Maglubiyet). Other war gods (such as Tempus, Nike, and Nuada) take a more neutral stance, promoting war in all its manifestations and supporting warriors in any circumstance.",
            "At each indicated cleric level, add the listed spells to your spells prepared.",
            "",
            "War Domain Spells",
            "Cleric Level | Spells",
            "1st | divine favor, shield of faith",
            "3rd | magic weapon, spiritual weapon",
            "5th | crusader's mantle, spirit guardians",
            "7th | freedom of movement, stoneskin",
            "9th | flame strike, hold monster",
            "",
            "Source: Player's Handbook p. 63"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "War Domain: Bonus Proficiencies"
          ],
          "text": [
            "At 1st level, you gain proficiency with martial weapons and heavy armor.",
            "",
            "Source: Player's Handbook p. 63"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "War Domain: War Priest"
          ],
          "text": [
            "From 1st level, your god delivers bolts of inspiration to you while you are engaged in battle. When you use the Attack action, you can make one weapon attack as a bonus action. You can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest.",
            "",
            "Source: Player's Handbook p. 63"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "slots": "3, 3"
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "name": [
            "Channel Divinity (1/rest)"
          ],
          "text": [
            "At 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description.",
            "When you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again.",
            "Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC.",
            "Beginning at 6th level, you can use your Channel Divinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "name": [
            "Divine Domain feature"
          ],
          "text": [
            "At 2nd level, you gain a feature from your Divine Domain.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Knowledge Domain: Channel Divinity: Knowledge of the Ages"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to tap into a divine well of knowledge. As an action, you choose one skill or tool. For 10 minutes, you have proficiency with the chosen skill or tool.",
            "",
            "Source: Player's Handbook p. 59"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Life Domain: Channel Divinity: Preserve Life"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to heal the badly injured.",
            "As an action, you present your holy symbol and evoke healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 30 feet of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum. You can't use this feature on an undead or a construct.",
            "",
            "Source: Player's Handbook p. 60"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Light Domain: Channel Divinity: Radiance of the Dawn"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to harness sunlight, banishing darkness and dealing radiant damage to your foes.",
            "As an action, you present your holy symbol, and any magical darkness within 30 feet of you is dispelled. Additionally, each hostile creature within 30 feet of you must make a Constitution saving throw. A creature takes radiant damage equal to 2d10 + your cleric level on a failed saving throw, and half as much damage on a successful one. A creature that has total cover from you is not affected.",
            "",
            "Source: Player's Handbook p. 60"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Nature Domain: Channel Divinity: Charm Animals and Plants"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to charm animals and plants.",
            "As an action, you present your holy symbol and invoke the name of your deity. Each beast or plant creature that can see you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is charmed by you for 1 minute or until it takes damage. While it is charmed by you, it is friendly to you and other creatures you designate.",
            "",
            "Source: Player's Handbook p. 61"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Tempest Domain: Channel Divinity: Destructive Wrath"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to wield the power of the storm with unchecked ferocity.",
            "When you roll lightning or thunder damage, you can use your Channel Divinity to deal maximum damage, instead of rolling.",
            "",
            "Source: Player's Handbook p. 62"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Trickery Domain: Channel Divinity: Invoke Duplicity"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to create an illusory duplicate of yourself.",
            "As an action, you create a perfect illusion of yourself that lasts for 1 minute, or until you lose your concentration (as if you were concentrating on a spell). The illusion appears in an unoccupied space that you can see within 30 feet of you. As a bonus action on your turn, you can move the illusion up to 30 feet to a space you can see, but it must remain within 120 feet of you.",
            "For the duration, you can cast spells as though you were in the illusion's space, but you must use your own senses. Additionally, when both you and your illusion are within 5 feet of a creature that can see the illusion, you have advantage on attack rolls against that creature, given how distracting the illusion is to the target.",
            "",
            "Source: Player's Handbook p. 62"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "War Domain: Channel Divinity: Guided Strike"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to strike with supernatural accuracy. When you make an attack roll, you can use your Channel Divinity to gain a +10 bonus to the roll. You make this choice after you see the roll, but before the DM says whether the attack hits or misses.",
            "",
            "Source: Player's Handbook p. 63"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "3"
      },
      "slots": "3, 4, 2"
    },
    {
      "$": {
        "level": "4"
      },
      "slots": "4, 4, 3"
    },
    {
      "$": {
        "level": "4",
        "scoreImprovement": "YES"
      },
      "feature": [
        {
          "name": [
            "Ability Score Improvement"
          ],
          "text": [
            "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
            "If your DM allows the use of feats, you may instead take a feat.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "5"
      },
      "slots": "4, 4, 3, 2"
    },
    {
      "$": {
        "level": "5"
      },
      "feature": [
        {
          "name": [
            "Destroy Undead (CR 1/2)"
          ],
          "text": [
            "Starting at 5th level, when an undead of CR 1/2 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "slots": "4, 4, 3, 3"
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "name": [
            "Channel Divinity (2/rest)"
          ],
          "text": [
            "Beginning at 6th level, you can use your Channel Divinity twice between rests.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "name": [
            "Divine Domain feature"
          ],
          "text": [
            "At 6th level, you gain a feature from your Divine Domain.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Knowledge Domain: Channel Divinity: Read Thoughts"
          ],
          "text": [
            "At 6th level, you can use your Channel Divinity to read a creature's thoughts. You can then use your access to the creature's mind to command it.",
            "As an action, choose one creature that you can see within 60 feet of you. That creature must make a Wisdom saving throw. If the creature succeeds on the saving throw, you can't use this feature on it again until you finish a long rest.",
            "If the creature fails its save, you can read its surface thoughts (those foremost in its mind, reflecting its current emotions and what it is actively thinking about) when it is within 60 feet of you. This effect lasts for 1 minute.",
            "During that time, you can use your action to end this effect and cast the suggestion spell on the creature without expending a spell slot. The target automatically fails its saving throw against the spell.",
            "",
            "Source: Player's Handbook p. 59"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Life Domain: Blessed Healer"
          ],
          "text": [
            "Beginning at 6th level, the healing spells you cast on others heal you as well. When you cast a spell of 1st level or higher that restores hit points to a creature other than you, you regain hit points equal to 2 + the spell's level.",
            "",
            "Source: Player's Handbook p. 60"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Light Domain: Improved Flare"
          ],
          "text": [
            "Starting at 6th level, you can also use your Warding Flare feature when a creature that you can see within 30 feet of you attacks a creature other than you.",
            "",
            "Source: Player's Handbook p. 60"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Nature Domain: Dampen Elements"
          ],
          "text": [
            "Starting at 6th level, when you or a creature within 30 feet of you takes acid, cold, fire, lightning, or thunder damage, you can use your reaction to grant resistance to the creature against that instance of the damage.",
            "",
            "Source: Player's Handbook p. 61"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Tempest Domain: Thunderbolt Strike"
          ],
          "text": [
            "At 6th level, when you deal lightning damage to a Large or smaller creature, you can also push it up to 10 feet away from you.",
            "",
            "Source: Player's Handbook p. 62"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Trickery Domain: Channel Divinity: Cloak of Shadows"
          ],
          "text": [
            "Starting at 6th level, you can use your Channel Divinity to vanish.",
            "As an action, you become invisible until the end of your next turn. You become visible if you attack or cast a spell.",
            "",
            "Source: Player's Handbook p. 62"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "War Domain: Channel Divinity: War God's Blessing"
          ],
          "text": [
            "At 6th level, when a creature within 30 feet of you makes an attack roll, you can use your reaction to grant that creature a +10 bonus to the roll, using your Channel Divinity. You make this choice after you see the roll, but before the DM says whether the attack hits or misses.",
            "",
            "Source: Player's Handbook p. 63"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "7"
      },
      "slots": "4, 4, 3, 3, 1"
    },
    {
      "$": {
        "level": "8"
      },
      "slots": "4, 4, 3, 3, 2"
    },
    {
      "$": {
        "level": "8",
        "scoreImprovement": "YES"
      },
      "feature": [
        {
          "name": [
            "Ability Score Improvement"
          ],
          "text": [
            "When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
            "If your DM allows the use of feats, you may instead take a feat.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "name": [
            "Destroy Undead (CR 1)"
          ],
          "text": [
            "Starting at 8th level, when an undead of CR 1 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "name": [
            "Divine Domain feature"
          ],
          "text": [
            "At 8th level, you gain a feature from your Divine Domain.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Knowledge Domain: Potent Spellcasting"
          ],
          "text": [
            "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip.",
            "",
            "Source: Player's Handbook p. 59"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Life Domain: Divine Strike"
          ],
          "text": [
            "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Player's Handbook p. 60"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Light Domain: Potent Spellcasting"
          ],
          "text": [
            "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip.",
            "",
            "Source: Player's Handbook p. 60"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Nature Domain: Divine Strike"
          ],
          "text": [
            "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 cold, fire, or lightning damage (your choice) to the target. When you reach 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Player's Handbook p. 61"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Tempest Domain: Divine Strike"
          ],
          "text": [
            "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 thunder damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Player's Handbook p. 62"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Trickery Domain: Divine Strike"
          ],
          "text": [
            "At 8th level, you gain the ability to infuse your weapon strikes with poison—a gift from your deity. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 poison damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Player's Handbook p. 62"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "War Domain: Divine Strike"
          ],
          "text": [
            "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type dealt by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Player's Handbook p. 63"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "9"
      },
      "slots": "4, 4, 3, 3, 3, 1"
    },
    {
      "$": {
        "level": "10"
      },
      "slots": "5, 4, 3, 3, 3, 2"
    },
    {
      "$": {
        "level": "10"
      },
      "feature": [
        {
          "name": [
            "Divine Intervention"
          ],
          "text": [
            "Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great.",
            "Imploring your deity's aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The DM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate. If your deity intervenes, you can't use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest.",
            "At 20th level, your call for intervention succeeds automatically, no roll required.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "11"
      },
      "slots": "5, 4, 3, 3, 3, 2, 1"
    },
    {
      "$": {
        "level": "11"
      },
      "feature": [
        {
          "name": [
            "Destroy Undead (CR 2)"
          ],
          "text": [
            "Starting at 11th level, when an undead of CR 2 or lower or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "12"
      },
      "slots": "5, 4, 3, 3, 3, 2, 1"
    },
    {
      "$": {
        "level": "12",
        "scoreImprovement": "YES"
      },
      "feature": [
        {
          "name": [
            "Ability Score Improvement"
          ],
          "text": [
            "When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
            "If your DM allows the use of feats, you may instead take a feat.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "13"
      },
      "slots": "5, 4, 3, 3, 3, 2, 1, 1"
    },
    {
      "$": {
        "level": "14"
      },
      "slots": "5, 4, 3, 3, 3, 2, 1, 1"
    },
    {
      "$": {
        "level": "14"
      },
      "feature": [
        {
          "name": [
            "Destroy Undead (CR 3)"
          ],
          "text": [
            "Starting at 14th level, when an undead of CR 3 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "15"
      },
      "slots": "5, 4, 3, 3, 3, 2, 1, 1, 1"
    },
    {
      "$": {
        "level": "16"
      },
      "slots": "5, 4, 3, 3, 3, 2, 1, 1, 1"
    },
    {
      "$": {
        "level": "16",
        "scoreImprovement": "YES"
      },
      "feature": [
        {
          "name": [
            "Ability Score Improvement"
          ],
          "text": [
            "When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
            "If your DM allows the use of feats, you may instead take a feat.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "slots": "5, 4, 3, 3, 3, 2, 1, 1, 1, 1"
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "name": [
            "Destroy Undead (CR 4)"
          ],
          "text": [
            "Starting at 17th level, when an undead of CR 4 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "name": [
            "Divine Domain feature"
          ],
          "text": [
            "At 17th level, you gain a feature from your Divine Domain.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Knowledge Domain: Visions of the Past",
            "Knowledge Domain: Object Reading",
            "Knowledge Domain: Area Reading"
          ],
          "text": [
            "Starting at 17th level, you can call up visions of the past that relate to an object you hold or your immediate surroundings. You spend at least 1 minute in meditation and prayer, then receive dreamlike, shadowy glimpses of recent events. You can meditate in this way for a number of minutes equal to your Wisdom score and must maintain concentration during that time, as if you were casting a spell.",
            "Once you use this feature, you can't use it again until you finish a short or long rest.",
            "   Holding an object as you meditate, you can see visions of the object's previous owner. After meditating for 1 minute, you learn how the owner acquired and lost the object, as well as the most recent significant event involving the object and that owner. If the object was owned by another creature in the recent past (within a number of days equal to your Wisdom score), you can spend 1 additional minute for each owner to learn the same information about that creature.",
            "   As you meditate, you see visions of recent events in your immediate vicinity (a room, street, tunnel, clearing, or the like, up to a 50-foot cube), going back a number of days equal to your Wisdom score. For each minute you meditate, you learn about one significant event, beginning with the most recent. Significant events typically involve powerful emotions, such as battles and betrayals, marriages and murders, births and funerals. However, they might also include more mundane events that are nevertheless important in your current situation.",
            "",
            "Source: Player's Handbook p. 59"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Life Domain: Supreme Healing"
          ],
          "text": [
            "Starting at 17th level, when you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die. For example, instead of restoring 2d6 hit points to a creature, you restore 12.",
            "",
            "Source: Player's Handbook p. 60"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Light Domain: Corona of Light"
          ],
          "text": [
            "Starting at 17th level, you can use your action to activate an aura of sunlight that lasts for 1 minute or until you dismiss it using another action. You emit bright light in a 60-foot radius and dim light 30 feet beyond that. Your enemies in the bright light have disadvantage on saving throws against any spell that deals fire or radiant damage.",
            "",
            "Source: Player's Handbook p. 60"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Nature Domain: Master of Nature"
          ],
          "text": [
            "At 17th level, you gain the ability to command animals and plant creatures. While creatures are charmed by your Charm Animals and Plants feature, you can take a bonus action on your turn to verbally command what each of those creatures will do on its next turn.",
            "",
            "Source: Player's Handbook p. 61"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Tempest Domain: Stormborn"
          ],
          "text": [
            "At 17th level, you have a flying speed equal to your current walking speed whenever you are not underground or indoors.",
            "",
            "Source: Player's Handbook p. 62"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Trickery Domain: Improved Duplicity"
          ],
          "text": [
            "At 17th level, you can create up to four duplicates of yourself, instead of one, when you use Invoke Duplicity. As a bonus action on your turn, you can move any number of them up to 30 feet, to a maximum range of 120 feet.",
            "",
            "Source: Player's Handbook p. 62"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "War Domain: Avatar of Battle"
          ],
          "text": [
            "At 17th level, you gain resistance to bludgeoning, piercing, and slashing damage from nonmagical weapons.",
            "",
            "Source: Player's Handbook p. 63"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "18"
      },
      "slots": "5, 4, 3, 3, 3, 3, 1, 1, 1, 1"
    },
    {
      "$": {
        "level": "18"
      },
      "feature": [
        {
          "name": [
            "Channel Divinity (3/rest)"
          ],
          "text": [
            "Beginning at 18th level, you can use your Channel Divinity three times between rests.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "19"
      },
      "slots": "5, 4, 3, 3, 3, 3, 2, 1, 1, 1"
    },
    {
      "$": {
        "level": "19",
        "scoreImprovement": "YES"
      },
      "feature": [
        {
          "name": [
            "Ability Score Improvement"
          ],
          "text": [
            "When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
            "If your DM allows the use of feats, you may instead take a feat.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "20"
      },
      "slots": "5, 4, 3, 3, 3, 3, 2, 2, 1, 1"
    },
    {
      "$": {
        "level": "20"
      },
      "feature": [
        {
          "name": [
            "Divine Intervention Improvement"
          ],
          "text": [
            "At 20th level, your call for intervention succeeds automatically, no roll required.",
            "",
            "Source: Player's Handbook p. 36"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Death Domain"
          ],
          "text": [
            "The Death domain is concerned with the forces that cause death, as well as the negative energy that gives rise to undead creatures. Deities such as Chemosh, Myrkul, and WeeJas are patrons of necromancers, death knights, liches, mummy lords, and vampires. Gods of the Death domain also embody murder (Anubis, Bhaal, and Pyremius), pain (Iuz or Loviatar), disease or poison (Incabulos, Talona, or Morgion), and the underworld (Hades and Hel).",
            "At each indicated cleric level, add the listed spells to your spells prepared. They do not count towards your limit.",
            "",
            "Death Domain Spells",
            "Cleric Level | Spells",
            "1st | false life, ray of sickness",
            "3rd | blindness/deafness, ray of enfeeblement",
            "5th | animate dead, vampiric touch",
            "7th | blight, death ward",
            "9th | antilife shell, cloudkill",
            "",
            "Source: Dungeon Master's Guide p. 96"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Death Domain: Bonus Proficiency"
          ],
          "text": [
            "When the cleric chooses this domain at 1st level, he or she gains proficiency with martial weapons.",
            "",
            "Source: Dungeon Master's Guide p. 96"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Death Domain: Reaper"
          ],
          "text": [
            "At 1st level, the cleric learns one necromancy cantrip of his or her choice from any spell list. When the cleric casts a necromancy cantrip that normally targets only one creature, the spell can instead target two creatures within range and within 5 feet of each other.",
            "",
            "Source: Dungeon Master's Guide p. 96"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Death Domain: Channel Divinity: Touch of Death"
          ],
          "text": [
            "Starting at 2nd level, the cleric can use Channel Divinity to destroy another creature's life force by touch.",
            "When the cleric hits a creature with a melee attack, the cleric can use Channel Divinity to deal extra necrotic damage to the target. The damage equals 5 + twice his or her cleric level.",
            "",
            "Source: Dungeon Master's Guide p. 96"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Death Domain: Inescapable Destruction"
          ],
          "text": [
            "Starting at 6th level, the cleric's ability to channel negative energy becomes more potent. Necrotic damage dealt by the character's cleric spells and Channel Divinity options ignores resistance to necrotic damage.",
            "",
            "Source: Dungeon Master's Guide p. 96"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Death Domain: Divine Strike"
          ],
          "text": [
            "At 8th level, the cleric gains the ability to infuse his or her weapon strikes with necrotic energy. Once on each of the cleric's turns when he or she hits a creature with a weapon attack, the cleric can cause the attack to deal an extra 1d8 necrotic damage to the target. When the cleric reaches 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Dungeon Master's Guide p. 96"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Death Domain: Improved Reaper"
          ],
          "text": [
            "Starting at 17th level, when the cleric casts a Necromancy spell of 1st through 5th-level that targets only one creature, the spell can instead target two creatures within range and within 5 feet of each other. If the spell consumes its material components, the cleric must provide them for each target.",
            "",
            "Source: Dungeon Master's Guide p. 96"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Forge Domain"
          ],
          "text": [
            "The gods of the forge are patrons of artisans who work with metal, from a humble blacksmith who keeps a village in horseshoes and plow blades to the mighty elf artisan whose diamond-tipped arrows of mithral have felled demon lords. The gods of the forge teach that, with patience and hard work, even the most intractable metal can be transformed from a lump of ore to a beautifully wrought object. Clerics of these deities search for objects lost to the forces of darkness, liberate mines overrun by orcs, and uncover rare and wondrous materials necessary to create potent magic items. Followers of these gods take great pride in their work, and they are willing to craft and use heavy armor and powerful weapons to protect them. Deities of this domain include Gond, Reorx, Onatar, Moradin, Hephaestus, and Goibhniu.",
            "At each indicated cleric level, add the listed spells to your spells prepared.",
            "",
            "Forge Domain Spells",
            "Cleric Level | Spells",
            "1st | identify, searing smite",
            "3rd | heat metal, magic weapon",
            "5th | elemental weapon, protection from energy",
            "7th | fabricate, wall of fire",
            "9th | animate objects, creation",
            "",
            "Source: Xanathar's Guide to Everything p. 18"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Forge Domain: Blessing of the Forge"
          ],
          "text": [
            "At 1st level, you gain the ability to imbue magic into a weapon or armor. At the end of a long rest, you can touch one nonmagical object that is a suit of armor or a simple or martial weapon. Until the end of your next long rest or until you die, the object becomes a magic item, granting a +1 bonus to AC if it's armor or a +1 bonus to attack and damage rolls if it's a weapon.",
            "Once you use this feature, you can't use it again until you finish a long rest.",
            "",
            "Source: Xanathar's Guide to Everything p. 18"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Forge Domain: Bonus Proficiency"
          ],
          "text": [
            "When you choose this domain at 1st level, you gain proficiency with heavy armor and smith's tools.",
            "",
            "Source: Xanathar's Guide to Everything p. 18"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Grave Domain"
          ],
          "text": [
            "Gods of the grave watch over the line between life and death. To these deities, death and the afterlife are a foundational part of the multiverse. To desecrate the peace of the dead is an abomination. Deities of the grave include Kelemvor, Wee Jas, the ancestral spirits of the Undying Court, Hades, Anubis, and Osiris. Followers of these deities seek to put wandering spirits to rest, destroy the undead, and ease the suffering of the dying. Their magic also allows them to stave off death for a time, particularly for a person who still has some great work to accomplish in the world. This is a delay of death, not a denial of it, for death will eventually get its due.",
            "",
            "Grave Domain Spells",
            "Cleric Level | Spells",
            "1st | bane, false life",
            "3rd | gentle repose, ray of enfeeblement",
            "5th | revivify, vampiric touch",
            "7th | blight, death ward",
            "9th | antilife shell, raise dead",
            "",
            "Source: Xanathar's Guide to Everything p. 19"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Grave Domain: Circle of Mortality"
          ],
          "text": [
            "At 1st level, you gain the ability to manipulate the line between life and death. When you would normally roll one or more dice to restore hit points with a spell to a creature at 0 hit points, you instead use the highest number possible for each die.",
            "In addition, you learn the spare the dying cantrip, which doesn't count against the number of cleric cantrips you know. For you, it has a range of 30 feet, and you can cast it as a bonus action.",
            "",
            "Source: Xanathar's Guide to Everything p. 19"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Grave Domain: Eyes of the Grave"
          ],
          "text": [
            "At 1st level, you gain the ability to occasionally sense the presence of the undead, whose existence is an insult to the natural cycle of life. As an action, you can open your awareness to magically detect undead. Until the end of your next turn, you know the location of any undead within 60 feet of you that isn't behind total cover and that isn't protected from divination magic. This sense doesn't tell you anything about a creature's capabilities or identity.",
            "You can use this feature a number of times equal to your Wisdom modifier (minimum of once). You regain all expended uses when you finish a long rest.",
            "",
            "Source: Xanathar's Guide to Everything p. 19"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Forge Domain: Channel Divinity: Artisan's Blessing"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to create simple items.",
            "You conduct an hour-long ritual that crafts a nonmagical item that must include some metal: a simple or martial weapon, a suit of armor, ten pieces of ammunition, a set of tools, or another metal object (see chapter 5, \"Equipment,\" in the Player's Handbook for examples of these items). The creation is completed at the end of the hour, coalescing in an unoccupied space of your choice on a surface within 5 feet of you.",
            "The thing you create can be something that is worth no more than 100 gp. As part of this ritual, you must lay out metal, which can include coins, with a value equal to the creation. The metal irretrievably coalesces and transforms into the creation at the ritual's end, magically forming even nonmetal parts of the creation. The ritual can create a duplicate of a nonmagical item that contains metal, such as a key, if you possess the original during the ritual.",
            "",
            "Source: Xanathar's Guide to Everything p. 18"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Grave Domain: Channel Divinity: Path to the Grave"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to mark another creature's life force for termination.",
            "As an action, you choose one creature you can see within 30 feet of you, cursing it until the end of your next turn. The next time you or an ally of yours hits the cursed creature with an attack, the creature has vulnerability to all of that attack's damage, and then the curse ends.",
            "",
            "Source: Xanathar's Guide to Everything p. 19"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Forge Domain: Soul of the Forge"
          ],
          "text": [
            "Starting at 6th level, your mastery of the forge grants you special abilities:",
            "• You gain resistance to fire damage.",
            "• While wearing heavy armor, you gain a +1 bonus to AC.",
            "",
            "Source: Xanathar's Guide to Everything p. 18"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Grave Domain: Sentinel at Death's Door"
          ],
          "text": [
            "At 6th level, you gain the ability to impede death's progress. As a reaction when you or a creature you can see within 30 feet of you suffers a critical hit, you can turn that hit into a normal hit. Any effects triggered by a critical hit are canceled.",
            "You can use this feature a number of times equal to your Wisdom modifier (minimum of once). You regain all expended uses when you finish a long rest.",
            "",
            "Source: Xanathar's Guide to Everything p. 19"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Forge Domain: Divine Strike"
          ],
          "text": [
            "At 8th level, you gain the ability to infuse your weapon strikes with the fiery power of the forge. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 fire damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Xanathar's Guide to Everything p. 18"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Grave Domain: Potent Spellcasting"
          ],
          "text": [
            "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip.",
            "",
            "Source: Xanathar's Guide to Everything p. 19"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Forge Domain: Saint of Forge and Fire"
          ],
          "text": [
            "At 17th level, your blessed affinity with fire and metal becomes more powerful:",
            "• You gain immunity to fire damage",
            "• While wearing heavy armor, you have resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks.",
            "",
            "Source: Xanathar's Guide to Everything p. 18"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Grave Domain: Keeper of Souls"
          ],
          "text": [
            "Starting at 17th level, you can seize a trace of vitality from a parting soul and use it to heal the living. When an enemy you can see dies within 60 feet of you, you or one creature of your choice that is within 60 feet of you regains hit points equal to the enemy's number of Hit Dice. You can use this feature only if you aren't incapacitated. Once you use it, you can't do so again until the start of your next turn.",
            "",
            "Source: Xanathar's Guide to Everything p. 19"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Arcana Domain"
          ],
          "text": [
            "Magic is an energy that suffuses the multiverse and that fuels both destruction and creation. Gods of the Arcana domain know the secrets and potential of magic intimately. For some of these gods, magical knowledge is a great responsibility that comes with a special understanding of the nature of reality. Other gods of Arcana see magic as pure power, to be used as its wielder sees fit.",
            "The gods of this domain are often associated with knowledge, as learning and arcane power tend to go hand-in-hand. In the Realms, deities of this domain include Azuth and Mystra, as well as Corellon Larethian of the elven pantheon. In other worlds, this domain includes Hecate, Math Mathonwy, and Isis; the triple moon gods of Solinari, Lunitari, and Nuitari of Krynn; and Boccob, Vecna, and WeeJas of Greyhawk.",
            "At each indicated cleric level, add the listed spells to your spells prepared. They do not count towards your limit.",
            "",
            "Arcana Domain Spells",
            "Cleric Level | Spells",
            "1st | detect magic, magic missile",
            "3rd | magic weapon, Nystul's magic aura",
            "5th | dispel magic, magic circle",
            "7th | arcane eye, Leomund's secret chest",
            "9th | planar binding, teleportation circle",
            "",
            "Source: Sword Coast Adventurer's Guide p. 125"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Arcana Domain: Arcane Initiate"
          ],
          "text": [
            "When you choose this domain at 1st level, you gain proficiency in the Arcana skill, and you gain two cantrips of your choice from the wizard spell list. For you, these cantrips count as cleric cantrips.",
            "",
            "Source: Sword Coast Adventurer's Guide p. 125"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Arcana Domain: Channel Divinity: Arcane Abjuration"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to abjure otherworldly creatures.",
            "As an action, you present your holy symbol, and one celestial, elemental, fey, or fiend of your choice that is within 30 feet of you must make a Wisdom saving throw, provided that the creature can see or hear you. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage.",
            "A turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly end its move in a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, then the creature can use the Dodge action.",
            "After you reach 5th level, when a creature fails its saving throw against your Arcane Abjuration feature, the creature is banished for 1 minute (as in the banishment spell, no concentration required) if it isn't on its plane of origin, and its challenge rating is at or below a certain threshold, as shown below.",
            "",
            "Arcane Banishment",
            "Cleric level | Banishes Creatures of CR...",
            "5th | 1/2 or lower",
            "8th | 1 or lower",
            "11th | 2 or lower",
            "14th | 3 or lower",
            "17th | 4 or lower",
            "",
            "Source: Sword Coast Adventurer's Guide p. 125"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Arcana Domain: Spell Breaker"
          ],
          "text": [
            "Starting at 6th level, when you restore hit points to an ally with a spell of 1st level or higher, you can also end one spell of your choice on that creature. The level of the spell you end must be equal to or lower than the level of the spell slot you use to cast the healing spell.",
            "",
            "Source: Sword Coast Adventurer's Guide p. 125"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Arcana Domain: Potent Spellcasting"
          ],
          "text": [
            "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip.",
            "",
            "Source: Sword Coast Adventurer's Guide p. 125"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Arcana Domain: Arcane Mastery"
          ],
          "text": [
            "At 17th level, you choose four spells from the Wizard spell list, one from each of the following levels: 6th, 7th, 8th, and 9th. You add them to your list of domain spells. Like your other domain spells, they are always prepared and count as cleric spells for you.",
            "",
            "Source: Sword Coast Adventurer's Guide p. 125"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Order Domain"
          ],
          "text": [
            "The Order Domain represents discipline, as well as devotion to a society or an institution and strict obedience to the laws governing it. On Ravnica, the domain is favored by clerics of the Azorius Senate, who use it to maintain and enforce the law, and of the Orzhov Syndicate, who exploit law and order for their personal gain. On other worlds, gods who grant access to this domain include Bane, Tyr, Majere, Erathis, Pholtus, Wee Jas, Aureon, Maglubiyet, Nuada, Athena, Anubis, Forseti, and Asmodeus.",
            "The ideal of order is obedience to the law above all else, rather than to a specific individual or the passing influence of emotion or popular rule. Clerics of order are typically concerned with how things are done, rather than whether an action's results are just. Following the law and obeying its edicts is critical, especially when it benefits these clerics and their guilds or deities.",
            "Law establishes hierarchies. Those selected by the law to lead must be obeyed. Those who obey must do so to the best of their ability. In this manner, law creates an intricate web of obligations that allows society to forge order and security in a chaotic multiverse.",
            "At each indicated cleric level, you add the listed spells to your spells prepared.",
            "",
            "Order Domain Spells",
            "Cleric Level | Spells",
            "1st | command, heroism",
            "3rd | hold person, zone of truth",
            "5th | mass healing word, slow",
            "7th | compulsion, locate creature",
            "9th | commune, dominate person",
            "",
            "Source: Guildmasters' Guide to Ravnica p. 25"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain: Bonus Proficiencies"
          ],
          "text": [
            "When you choose this domain at 1st level, you gain proficiency with heavy armor. You also gain proficiency in the Intimidation or Persuasion skill (your choice).",
            "",
            "Source: Guildmasters' Guide to Ravnica p. 25"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain: Voice of Authority"
          ],
          "text": [
            "Starting at 1st level, you can invoke the power of law to drive an ally to attack. If you cast a spell with a spell slot of 1st level or higher and target an ally with the spell, that ally can use their reaction immediately after the spell to make one weapon attack against a creature of your choice that you can see.",
            "If the spell targets more than one ally, you choose the ally who can make the attack.",
            "",
            "Source: Guildmasters' Guide to Ravnica p. 25"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain: Channel Divinity: Order's Demand"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to exert an intimidating presence over others.",
            "As an action, you present your holy symbol, and each creature of your choice that can see or hear you within 30 feet of you must succeed on a Wisdom saving throw or be charmed by you until the end of your next turn or until the charmed creature takes any damage. You can also cause any of the charmed creatures to drop what they are holding when they fail the saving throw.",
            "",
            "Source: Guildmasters' Guide to Ravnica p. 25"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain: Embodiment of the Law"
          ],
          "text": [
            "At 6th level, you become remarkably adept at channeling magical energy to compel others.",
            "If you cast a spell of the enchantment school using a spell slot of 1st level or higher, you can change the spell's casting time to 1 bonus action for this casting, provided the spell's casting time is normally 1 action.",
            "You can use this feature a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses of it when you finish a long rest.",
            "",
            "Source: Guildmasters' Guide to Ravnica p. 25"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain: Blessed Strikes"
          ],
          "text": [
            "8th-level cleric Divine Domain feature (replaces Divine Strike)",
            "In battle, you are blessed with divine might. When a creature takes damage from one of your spells or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn.",
            "",
            "Source: Guildmasters' Guide to Ravnica p. 25"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain: Divine Strike"
          ],
          "text": [
            "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 psychic damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Guildmasters' Guide to Ravnica p. 25"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain: Order's Wrath"
          ],
          "text": [
            "Starting at 17th level, enemies you designate for destruction wilt under the combined efforts of you and your allies. If you deal your Divine Strike damage to a creature on your turn, you can curse that creature until the start of your next turn. The next time one of your allies hits the cursed creature with an attack, the target also takes 2d8 psychic damage, and the curse ends. You can curse a creature in this way only once per turn.",
            "",
            "Source: Guildmasters' Guide to Ravnica p. 25"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Order Domain"
          ],
          "text": [
            "The Order Domain represents discipline, as well as devotion to a society or an institution and strict obedience to the laws governing it. On Ravnica, the domain is favored by clerics of the Azorius Senate, who use it to maintain and enforce the law, and of the Orzhov Syndicate, who exploit law and order for their personal gain. On other worlds, gods who grant access to this domain include Bane, Tyr, Majere, Erathis, Pholtus, Wee Jas, Aureon, Maglubiyet, Nuada, Athena, Anubis, Forseti, and Asmodeus.",
            "The ideal of order is obedience to the law above all else, rather than to a specific individual or the passing influence of emotion or popular rule. Clerics of order are typically concerned with how things are done, rather than whether an action's results are just. Following the law and obeying its edicts is critical, especially when it benefits these clerics and their guilds or deities.",
            "Law establishes hierarchies. Those selected by the law to lead must be obeyed. Those who obey must do so to the best of their ability. In this manner, law creates an intricate web of obligations that allows society to forge order and security in a chaotic multiverse.",
            "At each indicated cleric level, you add the listed spells to your spells prepared.",
            "",
            "Order Domain Spells",
            "Cleric Level | Spells",
            "1st | command, heroism",
            "3rd | hold person, zone of truth",
            "5th | mass healing word, slow",
            "7th | compulsion, locate creature",
            "9th | commune, dominate person",
            "",
            "Source: Tasha's Cauldron of Everything p. 31"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain: Bonus Proficiencies"
          ],
          "text": [
            "When you choose this domain at 1st level, you gain proficiency with heavy armor. You also gain proficiency in the Intimidation or Persuasion skill (your choice).",
            "",
            "Source: Tasha's Cauldron of Everything p. 31"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain: Voice of Authority"
          ],
          "text": [
            "Starting at 1st level, you can invoke the power of law to drive an ally to attack. If you cast a spell with a spell slot of 1st level or higher and target an ally with the spell, that ally can use their reaction immediately after the spell to make one weapon attack against a creature of your choice that you can see.",
            "If the spell targets more than one ally, you choose the ally who can make the attack.",
            "",
            "Source: Tasha's Cauldron of Everything p. 31"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Peace Domain",
            "Peace Domain: Domain Spells"
          ],
          "text": [
            "The balm of peace thrives at the heart of healthy communities, between friendly nations, and in the souls of the kindhearted. The gods of peace inspire people of all sorts to resolve conflict and to stand up against those forces that try to prevent peace from flourishing. See the Peace Deities table for a list of some of the gods associated with this domain.",
            "Clerics of the Peace Domain preside over the signing of treaties, and they are often asked to arbitrate in disputes. These clerics' blessings draw people together and help them shoulder one another's burdens, and the clerics' magic aids those who are driven to fight for the way of peace.",
            "",
            "Peace Deities",
            "Example Deity | Pantheon",
            "Angharradh | Elven",
            "Berronar Truesilver | Dwarven",
            "Boldrei | Eberron",
            "Cyrrollalee | Halfling",
            "Eldath | Forgotten Realms",
            "Gaerdal | Ironhand Gnomish",
            "Paladine | Dragonlance",
            "Rao | Greyhawk",
            "   1st-level Peace Domain feature",
            "   You gain domain spells at the cleric levels listed in the Peace Domain Spells table. See the Divine Domain class feature for how domain spells work.",
            "",
            "Peace Domain Spells",
            "Cleric Level | Spells",
            "1st | heroism, sanctuary",
            "3rd | aid, warding bond",
            "5th | beacon of hope, sending",
            "7th | aura of purity, Otiluke's resilient sphere",
            "9th | greater restoration, Rary's telepathic bond",
            "",
            "Source: Tasha's Cauldron of Everything p. 32"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Peace Domain: Emboldening Bond"
          ],
          "text": [
            "1st-level Peace Domain feature",
            "You can forge an empowering bond among people who are at peace with one another. As an action, you choose a number of willing creatures within 30 feet of you (this can include yourself) equal to your proficiency bonus. You create a magical bond among them for 10 minutes or until you use this feature again. While any bonded creature is within 30 feet of another, the creature can roll a d4 and add the number rolled to an attack roll, an ability check, or a saving throw it makes. Each creature can add the d4 no more than once per turn.",
            "You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.",
            "",
            "Source: Tasha's Cauldron of Everything p. 32"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Peace Domain: Implement of Peace"
          ],
          "text": [
            "1st-level Peace Domain feature",
            "You gain proficiency in the Insight, Performance, or Persuasion skill (your choice).",
            "",
            "Source: Tasha's Cauldron of Everything p. 32"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Twilight Domain",
            "Twilight Domain: Domain Spells"
          ],
          "text": [
            "The twilit transition from light into darkness often brings calm and even joy, as the day's labors end and the hours of rest begin. The darkness can also bring terrors, but the gods of twilight guard against the horrors of the night.",
            "Clerics who serve these deities-examples of which appear on the Twilight Deities table-bring comfort to those who seek rest and protect them by venturing into the encroaching darkness to ensure that the dark is a comfort, not a terror.",
            "",
            "Twilight Deities",
            "Example Deity | Pantheon",
            "Boldrei | Eberron",
            "Celestian | Greyhawk",
            "Dol Arrah | Eberron",
            "Helm | Forgotten Realms",
            "Ilmater | Forgotten Realms",
            "Mishakal | Dragonlance",
            "Selûne | Forgotten Realms",
            "Yondalla | Halfling",
            "   1st-level Twilight Domain feature",
            "   You gain domain spells at the cleric levels listed in the Twilight Domain Spells table. See the Divine Domain class feature for how domain spells work.",
            "",
            "Twilight Domain Spells",
            "Cleric Level | Spells",
            "1st | faerie fire, sleep",
            "3rd | moonbeam, see invisibility",
            "5th | aura of vitality, Leomund's tiny hut",
            "7th | aura of life, greater invisibility",
            "9th | circle of power, mislead",
            "",
            "Source: Tasha's Cauldron of Everything p. 34"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Twilight Domain: Bonus Proficiencies"
          ],
          "text": [
            "1st-level Twilight Domain feature",
            "You gain proficiency with martial weapons and heavy armor.",
            "",
            "Source: Tasha's Cauldron of Everything p. 34"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Twilight Domain: Eyes of Night"
          ],
          "text": [
            "1st-level Twilight Domain feature",
            "You can see through the deepest gloom. You have darkvision out to a range of 300 feet. In that radius, you can see in dim light as if it were bright light and in darkness as if it were dim light.",
            "As an action, you can magically share the darkvision of this feature with willing creatures you can see within 10 feet of you, up to a number of creatures equal to your Wisdom modifier (minimum of one creature). The shared darkvision lasts for 1 hour. Once you share it, you can't do so again until you finish a long rest, unless you expend a spell slot of any level to share it again.",
            "",
            "Source: Tasha's Cauldron of Everything p. 34"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Twilight Domain: Vigilant Blessing"
          ],
          "text": [
            "1st-level Twilight Domain feature",
            "The night has taught you to be vigilant. As an action, you give one creature you touch (including possibly yourself) advantage on the next initiative roll the creature makes. This benefit ends immediately after the roll or if you use this feature again.",
            "",
            "Source: Tasha's Cauldron of Everything p. 34"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "name": [
            "Channel Divinity: Harness Divine Power"
          ],
          "text": [
            "2nd-level cleric optional class features",
            "You can expend a use of your Channel Divinity to fuel your spells. As a bonus action, you touch your holy symbol, utter a prayer, and regain one expended spell slot, the level of which can be no higher than half your proficiency bonus (rounded up). The number of times you can use this feature is based on the level you've reached in this class: 2nd level, once; 6th level, twice; and 18th level, thrice. You regain all expended uses when you finish a long rest.",
            "",
            "Source: Tasha's Cauldron of Everything p. 30"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain: Channel Divinity: Order's Demand"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to exert an intimidating presence over others.",
            "As an action, you present your holy symbol, and each creature of your choice that can see or hear you within 30 feet of you must succeed on a Wisdom saving throw or be charmed by you until the end of your next turn or until the charmed creature takes any damage. You can also cause any of the charmed creatures to drop what they are holding when they fail the saving throw.",
            "",
            "Source: Tasha's Cauldron of Everything p. 31"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Peace Domain: Channel Divinity: Balm of Peace"
          ],
          "text": [
            "2nd-level Peace Domain feature",
            "You can use your Channel Divinity to make your very presence a soothing balm. As an action, you can move up to your speed, without provoking opportunity attacks, and when you move within 5 feet of any other creature during this action, you can restore a number of hit points to that creature equal to 2d6 + your Wisdom modifier (minimum of 1 hit point). A creature can receive this healing only once whenever you take this action.",
            "",
            "Source: Tasha's Cauldron of Everything p. 32"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Twilight Domain: Channel Divinity: Twilight Sanctuary"
          ],
          "text": [
            "2nd-level Twilight Domain feature",
            "You can use your Channel Divinity to refresh your allies with soothing twilight.",
            "As an action, you present your holy symbol, and a sphere of twilight emanates from you. The sphere is centered on you, has a 30-foot radius, and is filled with dim light. The sphere moves with you, and it lasts for 1 minute or until you are incapacitated or die. Whenever a creature (including you) ends its turn in the sphere, you can grant that creature one of these benefits:",
            "• You grant it temporary hit points equal to 1d6 plus your cleric level.",
            "• You end one effect on it causing it to be charmed or frightened.",
            "",
            "Source: Tasha's Cauldron of Everything p. 34"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "4"
      },
      "feature": [
        {
          "name": [
            "Cantrip Versatility"
          ],
          "text": [
            "4th-level cleric optional class features",
            "Whenever you reach a level in this class that grants the Ability Score Improvement feature, you can replace one cantrip you learned from this class's Spellcasting feature with another cantrip from the cleric spell list.",
            "",
            "Source: Tasha's Cauldron of Everything p. 30"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain: Embodiment of the Law"
          ],
          "text": [
            "At 6th level, you become remarkably adept at channeling magical energy to compel others.",
            "If you cast a spell of the enchantment school using a spell slot of 1st level or higher, you can change the spell's casting time to 1 bonus action for this casting, provided the spell's casting time is normally 1 action.",
            "You can use this feature a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses of it when you finish a long rest.",
            "",
            "Source: Tasha's Cauldron of Everything p. 31"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Peace Domain: Protective Bond"
          ],
          "text": [
            "6th-level Peace Domain feature",
            "The bond you forge between people helps them protect each other. When a creature affected by your Emboldening Bond feature is about to take damage, a second bonded creature within 30 feet of the first can use its reaction to teleport to an unoccupied space within 5 feet of the first creature. The second creature then takes all the damage instead.",
            "",
            "Source: Tasha's Cauldron of Everything p. 32"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Twilight Domain: Steps of Night"
          ],
          "text": [
            "6th-level Twilight Domain feature",
            "You can draw on the mystical power of night to rise into the air. As a bonus action when you are in dim light or darkness, you can magically give yourself a flying speed equal to your walking speed for 1 minute. You can use this bonus action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.",
            "",
            "Source: Tasha's Cauldron of Everything p. 34"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain: Blessed Strikes"
          ],
          "text": [
            "8th-level cleric optional class features, which replaces the Divine Strike feature",
            "You are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn.",
            "",
            "Source: Tasha's Cauldron of Everything p. 31"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain: Divine Strike"
          ],
          "text": [
            "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 psychic damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Tasha's Cauldron of Everything p. 31"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Peace Domain: Blessed Strikes"
          ],
          "text": [
            "8th-level cleric optional class features, which replaces the Potent Spellcasting feature",
            "You are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn.",
            "",
            "Source: Tasha's Cauldron of Everything p. 32"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Peace Domain: Potent Spellcasting"
          ],
          "text": [
            "8th-level Peace Domain feature",
            "You add your Wisdom modifier to the damage you deal with any cleric cantrip.",
            "",
            "Source: Tasha's Cauldron of Everything p. 32"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Twilight Domain: Blessed Strikes"
          ],
          "text": [
            "8th-level cleric optional class features, which replaces the Divine Strike feature",
            "You are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn.",
            "",
            "Source: Tasha's Cauldron of Everything p. 34"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Twilight Domain: Divine Strike"
          ],
          "text": [
            "8th-level Twilight Domain feature",
            "You gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage. When you reach 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Tasha's Cauldron of Everything p. 34"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain: Order's Wrath"
          ],
          "text": [
            "Starting at 17th level, enemies you designate for destruction wilt under the combined efforts of you and your allies. If you deal your Divine Strike damage to a creature on your turn, you can curse that creature until the start of your next turn. The next time one of your allies hits the cursed creature with an attack, the target also takes 2d8 psychic damage, and the curse ends. You can curse a creature in this way only once per turn.",
            "",
            "Source: Tasha's Cauldron of Everything p. 31"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Peace Domain: Expansive Bond"
          ],
          "text": [
            "17th-level Peace Domain feature",
            "The benefits of your Emboldening Bond and Protective Bond features now work when the creatures are within 60 feet of each other. Moreover, when a creature uses Protective Bond to take someone else's damage, the creature has resistance to that damage.",
            "",
            "Source: Tasha's Cauldron of Everything p. 32"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Twilight Domain: Twilight Shroud"
          ],
          "text": [
            "17th-level Twilight Domain feature",
            "The twilight that you summon offers a protective embrace: you and your allies have half cover while in the sphere created by your Twilight Sanctuary.",
            "",
            "Source: Tasha's Cauldron of Everything p. 34"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Darkness Domain (Twitter)"
          ],
          "text": [
            "[Note: this subclass is likely not intended as official content: \"For the curious, when building stuff for my own campaign I kind of don't care about balance. Anything I can break in design I can counterbreak five times as bad during a session, as needed. Plus, IMO stuff going sideways and weird is why I play the game.\"—Mike Mearls (https://twitter.com/mikemearls/status/1015752965213204480)]",
            "Custom built for clerics of Zehir, and perhaps Lolth.",
            "At each indicated cleric level, you add the listed spells to your spells prepared.",
            "",
            "Darkness Domain Spells",
            "Cleric Level | Spells",
            "1st | arms of hadar, hex",
            "3rd | blindness/deafness, darkness",
            "5th | fear, vampiric touch",
            "7th | blight, Evard's black tentacles",
            "9th | contagion, enervation",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Darkness Domain (Twitter): Child of Night"
          ],
          "text": [
            "When you choose this domain at 1st level, you gain the chill touch cantrip. If you do not have darkvision, you gain it with a range of 30 feet.",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Darkness Domain (Twitter): Shield of Ineffable Darkness"
          ],
          "text": [
            "Starting at 1st level, you can invoke the power of darkness to punish anyone fool enough to harm you. As a reaction when a creature you can see damages you, you cause that creature to become blinded until the end of your next turn.",
            "Once you use this feature, you can't use it again until you complete a short or long rest.",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Destruction Domain (Twitter)"
          ],
          "text": [
            "[Note: this subclass is likely not intended as official content: \"For the curious, when building stuff for my own campaign I kind of don't care about balance. Anything I can break in design I can counterbreak five times as bad during a session, as needed. Plus, IMO stuff going sideways and weird is why I play the game.\"—Mike Mearls (https://twitter.com/mikemearls/status/1015752965213204480)]",
            "Custom built for clerics of Gruumsh, and perhaps Tiamat.",
            "At each indicated cleric level, you add the listed spells to your spells prepared.",
            "",
            "Destruction Domain Spells",
            "Cleric Level | Spells",
            "1st | inflict wounds, wrathful smite",
            "3rd | enlarge/reduce, shatter",
            "5th | fireball, lightning bolt",
            "7th | ice storm, staggering smite",
            "9th | cloudkill, destructive wave",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Destruction Domain (Twitter): Armed for Destruction"
          ],
          "text": [
            "When you choose this domain at 1st level, you gain proficiency with martial weapons.",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Destruction Domain (Twitter): Destructive Fury"
          ],
          "text": [
            "Starting at 1st level, you can channel divine energy to enter a destructive frenzy. As a bonus action, you gain 5 temporary hit points and a +1 bonus to weapon damage rolls. This benefit lasts for one minute. Once you use this ability, you cannot use it again until you complete a short or long rest.",
            "When you use this ability, you can expend a spell slot to augment its effects. You gain additional temporary hit points equal to three times the slot's level and a bonus to weapon damage rolls equal to half the slot's level (minimum 1). This benefit lasts for one minute.",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Beauty Domain (Twitter)"
          ],
          "text": [
            "[Note: this subclass is likely not intended as official content: \"For the curious, when building stuff for my own campaign I kind of don't care about balance. Anything I can break in design I can counterbreak five times as bad during a session, as needed. Plus, IMO stuff going sideways and weird is why I play the game.\"—Mike Mearls (https://twitter.com/mikemearls/status/1015752965213204480)]",
            "Beauty can both bend minds and inspire hearts. It is the force that compels others to lose control and give in to their impulses, but it can also awaken strength and determination to steel a forlorn heart.",
            "Clerics of Beauty bring joy and hope to the world. They are the beacon of light that reminds us that some things are worth fighting for. They seek to bring peace and amity among the world's folk. They fight only when they must, and prefer to use their magic to end fights with as little bloodshed as possible.",
            "At each indicated cleric level, you add the listed spells to your spells prepared.",
            "",
            "Beauty Domain Spells",
            "Cleric Level | Spells",
            "1st | charm person, heroism",
            "3rd | enthrall, suggestion",
            "5th | beacon of hope, hypnotic pattern",
            "7th | charm monster, compulsion",
            "9th | dominate person, hold monster",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Beauty Domain (Twitter): Beauty's Refuge"
          ],
          "text": [
            "Starting at 1st level, your mere presence is enough to inspire hope and determination in others. When you complete a short or long rest, up to 12 allies of your choice gain temporary hit points equal to your Charisma modifier (minimum 1).",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Beauty Domain (Twitter): Rebuke the Defiler"
          ],
          "text": [
            "When you select this domain at 1st level, you gain the ability to rebuke those who lash out at your in violence.",
            "As a reaction when a creature you can see within 30 feet of you inflicts damage, you force that creature to make a Wisdom save. On a failed saving throw, it takes psychic damage equal to the damage dealt. On a successful save, it takes half that damage.",
            "If the creature made multiple attacks, select one attack to determine the damage dealt. If the creature used one or more effects that damaged multiple targets, choose the damage take by one of those targets from one of the effects.",
            "Once you use this feature, you can't use it again until you complete a short or long rest.",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Darkness Domain (Twitter): Channel Divinity: Shadow Spawn"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to fade into the darkness.",
            "As a bonus action, you become a creature of darkness that can blend into the shadows. You gain advantage on all Dexterity (Stealth) checks. If a creature cannot see you, your spells and attacks deal maximum damage to them. The shadows seem to draw around, as if they seek to protect you. This benefit lasts for one minute.",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Destruction Domain (Twitter): Channel Divinity: Sundering Invocation"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to channel destructive energy.",
            "As an action, you touch a creature or a an unattended object within reach. A creature must make a Constitution saving throw, taking 5 times your cleric level thunder damage on a failed saving throw and half as much on a successful one. An unattended object takes 5 times your cleric level thunder damage.",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Beauty Domain (Twitter): Channel Divinity: Beauty's Truce"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to quell the flame of violence.",
            "As an action, you force all creatures within 100 feet of you to make Charisma saving throws. Each creature that fails this saved is charmed by every other creature that also failed the saving throw. This benefit lasts for one hour. While charmed by this ability, creatures consider all other creatures charmed by it to be their allies. They fight to defend them from attackers.",
            "While this ability persists, absent any threat creatures charmed by it will rest, talk among themselves, share stories of their lives, create a communal feast using food and drink they carry, and generally act as if they are old friends, long separated and brought together again for a joyous reunion.",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Darkness Domain (Twitter): Hungry Darkness"
          ],
          "text": [
            "Starting at 6th level, your Shield of Ineffable Darkness becomes more powerful. When you use it, you can select up to three additional, hostile creatures you can see within 30 feet of you. They are also blinded until the end of your next turn.",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Destruction Domain (Twitter): Appetite for Destruction"
          ],
          "text": [
            "Starting at 6th level, your destructive acts fuel further expressions of devastation. If you kill a creature or destroy an object with a weapon attack, you can use your reaction to immediately make one additional weapon attack.",
            "You can use this ability a number of times equal to your Wisdom modifier (minimum 1). You regain all expended uses when you complete a long rest.",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Beauty Domain (Twitter): Superior Refuge"
          ],
          "text": [
            "Starting at 6th level, the temporary hit points granted by your Beauty's Refuge ability increase to 5 + your Charisma modifier (minimum 1).",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Darkness Domain (Twitter): Potent Cantrip"
          ],
          "text": [
            "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip.",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Destruction Domain (Twitter): Blessed Strikes"
          ],
          "text": [
            "8th-level cleric Divine Domain feature (replaces Divine Strike)",
            "In battle, you are blessed with divine might. When a creature takes damage from one of your spells or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn.",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Destruction Domain (Twitter): Divine Strike"
          ],
          "text": [
            "Starting at 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 thunder damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Beauty Domain (Twitter): Potent Cantrip"
          ],
          "text": [
            "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip.",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Darkness Domain (Twitter): Soul of Darkness"
          ],
          "text": [
            "Starting at 17th level, you gain strength from darkness. As a bonus action, you fade into the shadows. You regain hit points equal to your cleric level and gain resistance to all damage for one minute. In addition, while this duration lasts you can use a bonus action to teleport up to 30 feet to an unoccupied space you can see that is in dim light or darkness.",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Destruction Domain (Twitter): Hand of Devastation"
          ],
          "text": [
            "Starting at 17th level, your spells deliver exceptional power. When you roll damage for a spell, roll twice the listed number of dice. You then choose from among the rolled dice the results you wish to use to determine the spell's damage. You must select dice that match the quantity and type normally rolled to determine the spell's damage.",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Beauty Domain (Twitter): Soul of Beauty"
          ],
          "text": [
            "Starting at 17th level, you become an avatar of unearthly beauty. Your enemies attack with uncertainty, fearful of damaging the wondrous being they behold, while your magic draws upon your presence to augment its power.",
            "As a reaction, you can impose a penalty on a creature's attacks against you or on its saving throws against your spells and abilities. This benefit lasts until the end of the current turn The penalty equals your Charisma modifier (minimum 1).",
            "",
            "Source: Twitter"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Ambition Domain (PSA)"
          ],
          "text": [
            "\"The worthy shall strive for greatness—supremacy in life leads to supremacy in the afterlife.\"",
            "Bontu has fully embraced this dictum, and though she expends little effort in teaching it, she surely leads by example. Her viziers subtly plant the seeds that flower into the ambition the God-Pharaoh desires. Through insinuation, they remind acolytes and initiates alike that achieving one's place in the afterlife at the expense of others is not shameful, but is proof of the initiate's determination and drive. Nothing is more important than that drive, they suggest—not the bonds of a crop, not friendship or love. Not even devotion to a deity.",
            "At each indicated cleric level, add the listed spells to your spells prepared.",
            "",
            "Ambition Domain Spells",
            "Cleric Level | Spells",
            "1st | bane, disguise self",
            "3rd | mirror image, ray of enfeeblement",
            "5th | bestow curse, vampiric touch",
            "7th | death ward, dimension door",
            "9th | dominate person, modify memory",
            "",
            "Source: Plane Shift: Amonkhet p. 27"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Ambition Domain (PSA): Warding Flare"
          ],
          "text": [
            "When you choose this domain at 1st level, you can interpose divine light between yourself and an attacking enemy. When you are attacked by a creature within 30 feet of you that you can see, you can use your reaction to impose disadvantage on the attack roll, causing light to flare before the attacker before it hits or misses. An attacker that can't be blinded is immune to this feature.",
            "You can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest.",
            "",
            "Source: Plane Shift: Amonkhet p. 27"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Knowledge Domain (PSA)"
          ],
          "text": [
            "\"The worthy shall cultivate a nimble mind that can perceive the wonders beyond imagination that wait in the afterlife.\"",
            "Kefnet's task is to pass on this teaching of the God-Pharaoh and elucidate its meaning. He teaches that the afterlife will be inhabited only by those who have proved by their wits that they are worthy of dwelling in the glorious presence of the God-Pharaoh. He trains acolytes and initiates to push their limits and challenge their mental capacity with spells of ever-greater power.",
            "Kefnet's domain is identical to the Knowledge domain in the Player's Handbook.",
            "",
            "Source: Plane Shift: Amonkhet p. 25"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Solidarity Domain (PSA)"
          ],
          "text": [
            "\"The worthy must know and respect all others whom the God-Pharaoh deems worthy, for in the afterlife, all will be united in purpose and action.\"",
            "Oketra is charged with expounding upon this teaching of the God-Pharaoh, instilling in every initiate the virtue of solidarity. She forges each group of children into a crop of acolytes with just one purpose: to be judged worthy of a glorious afterlife. And she instills in each crop the ability to unite in a single action in pursuit of that purpose. She is fond of poetic imagery to communicate her ideals.",
            "At each indicated cleric level, add the listed spells to your spells prepared.",
            "",
            "Solidarity Domain Spells",
            "Cleric Level | Spells",
            "1st | bless, guiding bolt",
            "3rd | aid, warding bond",
            "5th | beacon of hope, crusader's mantle",
            "7th | aura of life, guardian of faith",
            "9th | circle of power, mass cure wounds",
            "",
            "Source: Plane Shift: Amonkhet p. 24"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Solidarity Domain (PSA): Bonus Proficiency"
          ],
          "text": [
            "When you choose this domain at 1st level, you gain proficiency with heavy armor.",
            "",
            "Source: Plane Shift: Amonkhet p. 24"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Solidarity Domain (PSA): Solidarity's Action"
          ],
          "text": [
            "Also at 1st level, when you take the Help action to aid an ally's attack, you can make one weapon attack as a bonus action. You can use this feature a number of times equal to your Wisdom modifier (minimum of once). You regain expended uses when you finish a long rest.",
            "",
            "Source: Plane Shift: Amonkhet p. 24"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Strength Domain (PSA)"
          ],
          "text": [
            "\"The worthy shall hone a strong body that can withstand the boundless energies of the afterlife.\"",
            "It falls to Rhonas to instill this teaching in those who would enter the afterlife—but to his mind, the words themselves don't matter. Strength can't be taught. It must be built through practice and training. Rhonas demonstrates his teachings by his example, rather than by giving his students any kind of academic instruction. He welcomes the people of Naktamun to stand by the Hekma and watch him as he storms into the desert to battle the greatest horrors. He encourages them to observe his indomitable strength, for though they will never equal it, they can aspire to mimicry. He invites them to scrutinize every move and practice what they see.",
            "At each indicated cleric level, add the listed spells to your spells prepared.",
            "",
            "Strength Domain Spells",
            "Cleric Level | Spells",
            "1st | divine favor, shield of faith",
            "3rd | enhance ability, protection from poison",
            "5th | haste, protection from energy",
            "7th | dominate beast, stoneskin",
            "9th | destructive wave, insect plague",
            "",
            "Source: Plane Shift: Amonkhet p. 26"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Strength Domain (PSA): Acolyte of Strength"
          ],
          "text": [
            "At 1st level, you learn one druid cantrip of your choice. You also gain proficiency in one of the following skills of your choice: Animal Handling, Athletics, Nature, or Survival.",
            "",
            "Source: Plane Shift: Amonkhet p. 26"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Strength Domain (PSA): Bonus Proficiency"
          ],
          "text": [
            "Also at 1st level, you gain proficiency with heavy armor.",
            "",
            "Source: Plane Shift: Amonkhet p. 26"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Zeal Domain (PSA)"
          ],
          "text": [
            "\"The worthy shall rush to the God-Pharaoh's side with relentless zeal, rising to overcome every obstacle in their way.\"",
            "The God-Pharaoh expects those he welcomes into the afterlife to desire it above all other pleasures and achievements, and for them to show their dedication, passion, and fervor through their actions. Hazoret is charged with cultivating this zeal in the initiates who come under her care, and she has undertaken the task with appropriate enthusiasm. She recognizes, however, that the best way to teach zeal is by demonstrating it.",
            "At each indicated cleric level, add the listed spells to your spells prepared.",
            "",
            "Zeal Domain Spells",
            "Cleric Level | Spells",
            "1st | searing smite, thunderous smite",
            "3rd | magic weapon, shatter",
            "5th | haste, fireball",
            "7th | fire shield, freedom of movement",
            "9th | destructive wave, flame strike",
            "",
            "Source: Plane Shift: Amonkhet p. 28"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Zeal Domain (PSA): Bonus Proficiencies"
          ],
          "text": [
            "At 1st level, you gain proficiency with martial weapons and heavy armor.",
            "",
            "Source: Plane Shift: Amonkhet p. 28"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Zeal Domain (PSA): Priest of Zeal"
          ],
          "text": [
            "From 1st level, Hazoret delivers bolts of inspiration to you while you are engaged in battle. When you use the Attack action, you can make one weapon attack as a bonus action.",
            "You can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest.",
            "",
            "Source: Plane Shift: Amonkhet p. 28"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Ambition Domain (PSA): Channel Divinity: Invoke Duplicity"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to create an illusory duplicate of yourself.",
            "As an action, you create a perfect illusion of yourself that lasts for 1 minute, or until you lose your concentration (as if you were concentrating on a spell). The illusion appears in an unoccupied space that you can see within 30 feet of you. As a bonus action on your turn, you can move the illusion up to 30 feet to a space you can see, but it must remain within 120 feet of you.",
            "For the duration, you can cast spells as though you were in the illusion's space, but you must use your own senses. Additionally, when both you and your illusion are within 5 feet of a creature that can see the illusion, you have advantage on attack rolls against that creature, given how distracting the illusion is to the target.",
            "",
            "Source: Plane Shift: Amonkhet p. 27"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Knowledge Domain (PSA): Subclass Feature"
          ],
          "text": [
            "See the Knowledge domain.",
            "",
            "Source: Plane Shift: Amonkhet p. 25"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Solidarity Domain (PSA): Channel Divinity: Preserve Life"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to heal the badly injured.",
            "As an action, you present your holy symbol and evoke healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 30 feet of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum. You can't use this feature on an undead or a construct.",
            "",
            "Source: Plane Shift: Amonkhet p. 24"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Strength Domain (PSA): Channel Divinity: Feat of Strength"
          ],
          "text": [
            "At 2nd level, you can use your Channel Divinity to enhance your physical might. When you make an attack roll, ability check, or saving throw using Strength, you can use your Channel Divinity to gain a +10 bonus to the roll. You make this choice after you see the roll, but before the DM says whether the roll succeeds or fails.",
            "",
            "Source: Plane Shift: Amonkhet p. 26"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Zeal Domain (PSA): Channel Divinity: Consuming Fervor"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to channel your zeal into unchecked ferocity.",
            "When you roll fire or thunder damage, you can use your Channel Divinity to deal maximum damage instead of rolling.",
            "",
            "Source: Plane Shift: Amonkhet p. 28"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Ambition Domain (PSA): Channel Divinity: Cloak of Shadows"
          ],
          "text": [
            "Starting at 6th level, you can use your Channel Divinity to vanish. As an action, you become invisible until the end of your next turn. You become visible if you attack or cast a spell.",
            "",
            "Source: Plane Shift: Amonkhet p. 27"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Knowledge Domain (PSA): Subclass Feature"
          ],
          "text": [
            "See the Knowledge domain.",
            "",
            "Source: Plane Shift: Amonkhet p. 25"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Solidarity Domain (PSA): Oketra's Blessing"
          ],
          "text": [
            "At 6th level, when a creature within 30 feet of you makes an attack roll, you can use your reaction to grant that creature a +10 bonus to the roll, using your Channel Divinity. You make this choice after you see the roll, but before the DM says whether the attack hits or misses.",
            "",
            "Source: Plane Shift: Amonkhet p. 24"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Strength Domain (PSA): Rhonas's Blessing"
          ],
          "text": [
            "At 6th level, when a creature within 30 feet of you makes an attack roll, ability check, or saving throw using Strength, you can use your reaction to grant that creature a +10 bonus to the roll, using your Channel Divinity. You make this choice after you see the roll, but before the DM says whether the roll succeeds or fail.",
            "",
            "Source: Plane Shift: Amonkhet p. 26"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Zeal Domain (PSA): Resounding Strike"
          ],
          "text": [
            "At 6th level, when you deal thunder damage to a Large or smaller creature, you can also push it up to 10 feet away from you.",
            "",
            "Source: Plane Shift: Amonkhet p. 28"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Ambition Domain (PSA): Potent Spellcasting"
          ],
          "text": [
            "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip.",
            "",
            "Source: Plane Shift: Amonkhet p. 27"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Knowledge Domain (PSA): Subclass Feature"
          ],
          "text": [
            "See the Knowledge domain.",
            "",
            "Source: Plane Shift: Amonkhet p. 25"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Solidarity Domain (PSA): Divine Strike"
          ],
          "text": [
            "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type dealt by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Plane Shift: Amonkhet p. 24"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Strength Domain (PSA): Divine Strike"
          ],
          "text": [
            "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type dealt by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Plane Shift: Amonkhet p. 26"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Zeal Domain (PSA): Divine Strike"
          ],
          "text": [
            "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type dealt by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Plane Shift: Amonkhet p. 28"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Ambition Domain (PSA): Improved Duplicity"
          ],
          "text": [
            "At 17th level, you can create up to four duplicates of yourself, instead of one, when you use Invoke Duplicity. As a bonus action on your turn, you can move any number of them up to 30 feet, to a maximum range of 120 feet.",
            "",
            "Source: Plane Shift: Amonkhet p. 27"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Knowledge Domain (PSA): Subclass Feature"
          ],
          "text": [
            "See the Knowledge domain.",
            "",
            "Source: Plane Shift: Amonkhet p. 25"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Solidarity Domain (PSA): Supreme Healing"
          ],
          "text": [
            "Starting at 17th level, when you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die. For example, instead of restoring 2d6 hit points to a creature, you restore 12.",
            "",
            "Source: Plane Shift: Amonkhet p. 24"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Strength Domain (PSA): Avatar of Battle"
          ],
          "text": [
            "At 17th level, you gain resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks.",
            "",
            "Source: Plane Shift: Amonkhet p. 26"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Zeal Domain (PSA): Blaze of Glory"
          ],
          "text": [
            "Starting at 17th level, you can delay death for an instant to perform a final heroic act.",
            "When you are reduced to 0 hit points by an attacker you can see, even if you would be killed outright, you can use your reaction to move up to your speed toward the attacker and make one melee weapon attack against it, as long as the movement brings it within your reach. You make this attack with advantage. If the attack hits, the creature takes an extra 5d10 fire damage and an extra 5d10 damage of the weapon's type. You then fall unconscious and begin making death saving throws as normal, or you die if the damage you took would have killed you outright.",
            "Once you use this feature, you can't use it again until you finish a long rest.",
            "",
            "Source: Plane Shift: Amonkhet p. 28"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Love Domain (UA)"
          ],
          "text": [
            "Note: The Love domain was included in a leaked pre-release version of Unearthed Arcana 2020 Subclasses, Part 2, and superseded by the Unity domain for the final release.",
            "Love exists in many forms—compassion, infatuation, friendly affection, and passionate love as a few facets. Whatever form these feelings take, the gods of love deepen the bonds between individuals.",
            "",
            "Love Deities",
            "Deity | Pantheon",
            "Aengus | Celtic",
            "Aphrodite | Greek",
            "Balder | Norse",
            "Berronar Truesilver | Dwarven",
            "Boldrei | Eberron",
            "Cyrrollalee | Halfling",
            "Freya | Norse",
            "Hanali Celanil | Elven",
            "Hathor | Egyptian",
            "Mishakal | Dragonlance",
            "Myhriss | Greyhawk",
            "Sharindlar | Dwarven",
            "Sheyanna Flaxenstrand | Gnomish",
            "Sune | Forgotten Realms",
            "Clerics of these gods preside over marriages and other familial bonding customs, but they also nurture the emotional bonds of friendship and camaraderie. Their divine blessings bolster and protect allies in battle through these deep bonds and enkindle flares of infatuation to spur their allies and confound their foes.",
            "",
            "Love Domain Spells",
            "Cleric Level | Spells",
            "1st | charm person, heroism",
            "3rd | enthrall, warding bond",
            "5th | beacon of hope, hypnotic pattern",
            "7th | aura of purity, confusion",
            "9th | greater restoration, hold monster",
            "",
            "Source: Unearthed Arcana: 2020 Subclasses Pt2 p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Love Domain (UA): Emboldening Bond"
          ],
          "text": [
            "1st-level Love Domain feature",
            "You can forge an empowering bond between allies. As an action, you can choose two willing creatures you can see within 30 feet of you (this can include yourself) and create a magical bond between them. While either bonded creature is within 30 feet of the other, the creature can roll a d4 and add the number rolled to an attack roll, an ability check, or a saving throw it makes. Each creature can add the d4 no more than once per turn. The bond lasts for 1 hour or until you use this feature again.",
            "You can use this feature once, and you regain the ability to do so when you finish a long rest. You can also expend a spell slot to use the feature again.",
            "",
            "Source: Unearthed Arcana: 2020 Subclasses Pt2 p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Unity Domain (UA)"
          ],
          "text": [
            "A sense of oneness shines at the heart of healthy communities, whether bound together by friendship, blood, faith, or some other uniting force. The gods of unity deepen such bonds and delight in their strength.",
            "Clerics of these gods preside over marriages and other familial bonding customs, but they also nurture the emotional bonds of friendship and camaraderie. Their divine blessings bolster and protect allies in battle through these deep bonds and turn aside malign influences.",
            "",
            "Unity Deities",
            "Deity | Pantheon",
            "Angharradh | Elven",
            "Athena | Greek",
            "Berronar Truesilver | Dwarven",
            "Boldrei | Eberron",
            "Cyrrollalee | Halfling",
            "Eldath | Forgotten Realms",
            "Gaerdal Ironhand | Gnomish",
            "Heimdall | Norse",
            "Paladine | Dragonlance",
            "Rao | Greyhawk",
            "",
            "Unity Domain Spells",
            "Cleric Level | Spells",
            "1st | heroism, shield of faith",
            "3rd | aid, warding bond",
            "5th | beacon of hope, sending",
            "7th | aura of purity, guardian of faith",
            "9th | greater restoration, Rary's telepathic bond",
            "",
            "Source: Unearthed Arcana: 2020 Subclasses Pt2 p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Unity Domain (UA): Emboldening Bond"
          ],
          "text": [
            "1st-level Unity Domain feature",
            "You can forge an empowering bond between allies. As an action, you can choose two willing creatures you can see within 30 feet of you (this can include yourself) and create a magical bond between them. While either bonded creature is within 30 feet of the other, the creature can roll a d4 and add the number rolled to an attack roll, an ability check, or a saving throw it makes. Each creature can add the d4 no more than once per turn. The bond lasts for 1 hour or until you use this feature again.",
            "You can use this feature once, and you regain the ability to do so when you finish a long rest. You can also expend a spell slot to use the feature again.",
            "",
            "Source: Unearthed Arcana: 2020 Subclasses Pt2 p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Love Domain (UA): Channel Divinity: Impulsive Infatuation"
          ],
          "text": [
            "2nd-level Love Domain feature",
            "You can use your Channel Divinity to overwhelm a creature with a flash of short-lived but intense admiration for you, driving them to rash action in your defense.",
            "As an action, you present your holy symbol and choose one creature you can see within 30 feet of you. That creature must make a Wisdom saving throw; a creature can choose to fail this saving throw if it wishes. On a success, the creature is unaffected. On a failure, the creature is charmed by you until the start of your next turn, and it must immediately use its reaction to make a weapon attack against a target you designate. If there are no valid targets, it uses its reaction to admire you.",
            "",
            "Source: Unearthed Arcana: 2020 Subclasses Pt2 p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Unity Domain (UA): Channel Divinity: Shared Burden"
          ],
          "text": [
            "2nd-level Unity Domain feature",
            "You can use your Channel Divinity to protect your allies through the strength of your shared bonds.",
            "When a creature you can see within 30 feet of you takes damage, you can use your reaction to choose a number of other willing creatures you can see, up to a number of creatures equal to your Wisdom modifier (minimum of one creature). Distribute the damage taken between the original target and the chosen creatures. Each creature must take at least 1 damage. Apply any damage resistance or vulnerability of the creatures involved after you distribute the damage.",
            "",
            "Source: Unearthed Arcana: 2020 Subclasses Pt2 p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Love Domain (UA): Protective Bond"
          ],
          "text": [
            "6th-level Love Domain feature",
            "The bond you forge between people shields them from harm. While either creature chosen for your Emboldening Bond feature is within 30 feet of the other, the creature can use its reaction to grant resistance to all damage to the other creature when that other creature takes damage. This resistance lasts until the end of the current turn.",
            "",
            "Source: Unearthed Arcana: 2020 Subclasses Pt2 p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Unity Domain (UA): Protective Bond"
          ],
          "text": [
            "6th-level Unity Domain feature",
            "The bond you forge between people shields them from harm. While either creature chosen for your Emboldening Bond feature is within 30 feet of the other, the creature can use its reaction to grant resistance to all damage to the other creature when that other creature takes damage. This resistance lasts until the end of the current turn.",
            "",
            "Source: Unearthed Arcana: 2020 Subclasses Pt2 p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Love Domain (UA): Potent Spellcasting"
          ],
          "text": [
            "8th-level Love Domain feature",
            "You add your Wisdom modifier to the damage you deal with any cleric cantrip.",
            "",
            "Source: Unearthed Arcana: 2020 Subclasses Pt2 p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Unity Domain (UA): Potent Spellcasting"
          ],
          "text": [
            "8th-level Unity Domain feature",
            "You add your Wisdom modifier to the damage you deal with any cleric cantrip.",
            "",
            "Source: Unearthed Arcana: 2020 Subclasses Pt2 p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Love Domain (UA): Enduring Unity"
          ],
          "text": [
            "17th-level Love Domain feature",
            "The bonds you create endure across vast distances. Creatures affected by your Emboldening Bond feature gain its benefits, as well as those of your Protective Bond feature, while they are on the same plane of existence as each other.",
            "Additionally, when a creature chosen for your Emboldening Bond is reduced to 0 hit points, their bonded partner gains the following benefits for 1 minute, or until the creature regains at least 1 hit point:",
            "• The creature has advantage on attack rolls, ability checks, and saving throws",
            "• The creature gains resistance to all damage",
            "• As an action, the creature can touch their bonded partner to expend and roll any number of Hit Dice. Their bonded partner regains a number of hit points equal to the total rolled.",
            "",
            "Source: Unearthed Arcana: 2020 Subclasses Pt2 p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Unity Domain (UA): Enduring Unity"
          ],
          "text": [
            "17th-level Unity Domain feature",
            "The bonds you create endure across vast distances. Creatures affected by your Emboldening Bond feature gain its benefits, as well as those of your Protective Bond feature, while they are on the same plane of existence as each other.",
            "Additionally, when a creature chosen for your Emboldening Bond is reduced to 0 hit points, their bonded partner gains the following benefits for 1 minute, or until the creature regains at least 1 hit point:",
            "• The creature has advantage on attack rolls, ability checks, and saving throws",
            "• The creature gains resistance to all damage",
            "• As an action, the creature can touch their bonded partner to expend and roll any number of Hit Dice. Their bonded partner regains a number of hit points equal to the total rolled.",
            "",
            "Source: Unearthed Arcana: 2020 Subclasses Pt2 p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Forge Domain (UA)"
          ],
          "text": [
            "The gods of the forge are patrons of artisans who work with metal, from a humble blacksmith who keeps a village in horseshoes and plow blades to the mighty elf artisan whose diamond-tipped arrows of mithral have felled demon lords. The gods of the forge teach that, with patience and hard work, even the most intractable metal can transform from a lump of ore to a beautifully wrought object. Clerics of these deities quest to search for objects lost to the forces of darkness, liberate mines overrun by orcs, and uncover rare and wondrous materials necessary to create potent magic items. Followers of these gods take great pride in their work, and they are willing to craft and use heavy armor and powerful weapons to protect them. Deities of this domain include Gond, Reorx, Onatar, Moradin, Hephaestus, and Goibhniu.",
            "At each indicated cleric level, add the listed spells to your spells prepared.",
            "",
            "Forge Domain Spells",
            "Cleric Level | Spells",
            "1st | searing smite, shield",
            "3rd | heat metal, magic weapon",
            "5th | elemental weapon, protection from energy",
            "7th | fabricate, wall of fire",
            "9th | animate objects, creation",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Forge Domain (UA): Blessing of the Forge"
          ],
          "text": [
            "At 1st level, you gain the ability to imbue magic into a weapon or armor. At the end of a long rest, touch one nonmagical object that is a suit of armor or a simple or martial weapon. Until the end of your next long rest, the object becomes a magic item, granting a +1 bonus to AC if it's armor or a +1 bonus to attack and damage rolls if it's a weapon.",
            "Once you use this feature, you can't use it again until you finish a long rest.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Forge Domain (UA): Bonus Proficiency"
          ],
          "text": [
            "When you choose this domain at 1st level, you gain proficiency with heavy armor.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Grave Domain (UA)"
          ],
          "text": [
            "Gods of the grave watch over the line between life and death. To these deities, death and the afterlife are a foundational part of the multiverse's workings. To resist death, or to desecrate the dead's rest, is an abomination. Deities of the grave include Kelemvor, WeeJas, the ancestral spirits of the Undying Court, Hades, Anubis, and Osiris. These deities teach their followers to respect the dead and pay them due homage. Followers of these deities seek to put restless spirits to rest, destroy the undead wherever they find them, and ease the suffering of dying creatures. Their magic also allows them to stave off a creature's death, though they refuse to use such magic to extend a creature's lifespan beyond its mortal limits.",
            "At each indicated cleric level, add the listed spells to your spells prepared.",
            "",
            "Grave Domain Spells",
            "Cleric Level | Spells",
            "1st | bane, false life",
            "3rd | gentle repose, ray of enfeeblement",
            "5th | revivify, vampiric touch",
            "7th | blight, death ward",
            "9th | antilife shell, raise dead",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Grave Domain (UA): Bonus Proficiency"
          ],
          "text": [
            "When you choose this domain at 1st level, you gain proficiency with heavy armor.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Grave Domain (UA): Circle of Mortality"
          ],
          "text": [
            "At 1st level, you gain the ability to manipulate the line between life and death. When you cast a spell that restores hit points to a living creature currently at 0, treat any dice rolled to determine the spell's healing as having rolled their maximum result. In addition, if you have the spare the dying cantrip, you can cast it as a bonus action.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Grave Domain (UA): Eyes of the Grave"
          ],
          "text": [
            "Starting at 1st level, you gain an innate sense of creatures whose existence is an insult to the natural cycle of life. If you spend 1 minute in uninterrupted contemplation, you can determine the presence and nature of undead creatures in the area. This detection extends up to 1 mile in all directions. You learn the number of undead and their distance and direction from you. In addition, you learn the creature type of the undead in that area that has the highest challenge rating.",
            "Once you use this feature, you can't use it again until you finish a long rest.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Protection Domain (UA)"
          ],
          "text": [
            "The protection domain is the purview of deities who charge their followers to shield the weak from the strong. The gods' faithful dwell in villages and towns on the borderlands, where they help bolster defenses and seek out evils to defeat. These gods believe that a strong shield and a suit of armor is the best defense against evil, second only to a stout mace on hand to respond to any attacks in kind. Deities who grant this domain include Helm, Ilmater, Torm, Tyr, Heironeous, St. Cuthbert, Paladine, Dol Dorn, the Silver Flame, Bahamut, Yondalla, Athena, and Odin.",
            "At each indicated cleric level, add the listed spells to your spells prepared.",
            "",
            "Protection Domain Spells",
            "Cleric Level | Spells",
            "1st | compelled duel, protection from evil and good",
            "3rd | aid, protection from poison",
            "5th | protection from energy, slow",
            "7th | guardian of faith, Otiluke's resilient sphere",
            "9th | antilife shell, wall of force",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 3"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Protection Domain (UA): Bonus Proficiency"
          ],
          "text": [
            "When you choose this domain at 1st level, you gain proficiency with heavy armor.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 3"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Protection Domain (UA): Shield of the Faithful"
          ],
          "text": [
            "Starting at 1st level, you gain the ability to hinder attacks intended for others. When a creature attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. To do so, you must be able to see both the attacker and the target. You interpose an arm, a shield, or some other part of yourself to try to throw the attack off target.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 3"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Forge Domain (UA): Channel Divinity: Artisan's Blessing"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to create simple items.",
            "Starting at the beginning of a short rest, you conduct a ritual to your deity that grants you the ability to craft a finished item that is at least part metal. The item is completed at the end of the rest.",
            "The object can be worth no more than 100 gp, and as part of this ritual you must expend metals, such as coins or other finished items, with a value equal to the item you want to make. The item can be an exact duplicate of a nonmagical item, such as a copy of a key, if you possess the original during your short rest.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Grave Domain (UA): Channel Divinity: Path to the Grave"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to mark another creature's life force for termination.",
            "As an action, you touch a creature. The next time that creature takes damage from a spell or an attack from you or an ally, it is vulnerable to that spell or attack's damage. If the source of damage has multiple damage types, the creature is vulnerable to all of them. The vulnerability applies only to the first time that source inflicts damage, and then ends.",
            "If the creature has resistance or is immune to the damage, it instead loses its resistance or immunity against that spell or attack when it first applies damage.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Protection Domain (UA): Channel Divinity: Radiant Defense"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to cloak your allies in radiant armor.",
            "As an action, you channel blessed energy into an ally that you can see within 30 feet of you. The first time that ally is hit by an attack within the next minute, the attacker takes radiant damage equal to 2d10 + your cleric level.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 3"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Forge Domain (UA): Soul of the Forge"
          ],
          "text": [
            "Starting at 6th level, your mastery of the forge grants you a number of special abilities:",
            "• You gain a +1 bonus to AC while you are wearing medium or heavy armor.",
            "• You gain resistance to fire damage.",
            "• When you hit a construct with an attack, you deal additional force damage to it equal to your cleric level.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Grave Domain (UA): Sentinel at Death's Door"
          ],
          "text": [
            "Starting at 6th level, you gain the ability to impede death's progress. As a reaction when you or an ally that you can see within 30 feet of you suffers a critical hit, you can turn that attack into a normal hit. Any effects triggered by a critical hit are canceled.",
            "Once you use this feature, you can't use it again until you finish a short or long rest.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Protection Domain (UA): Blessed Healer"
          ],
          "text": [
            "Beginning at 6th level, the healing spells you cast on others can heal you as well. When you cast a spell with a spell slot and it restores hit points to any creature other than you this turn, you regain hit points equal to 2 + the spell's level.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 3"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Forge Domain (UA): Divine Strike"
          ],
          "text": [
            "At 8th level, you gain the ability to infuse your weapon strikes with the fiery power of the forge. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 fire damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Grave Domain (UA): Divine Strike"
          ],
          "text": [
            "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 necrotic damage. When you reach 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Protection Domain (UA): Divine Strike"
          ],
          "text": [
            "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 3"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Forge Domain (UA): Saint of Forge and Fire"
          ],
          "text": [
            "At 17th level, your affinity for fire and metal becomes more powerful due to your deity's blessing. You gain immunity to fire damage, and while you're wearing heavy armor, you have resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Grave Domain (UA): Keeper of Souls"
          ],
          "text": [
            "At 17th level, you gain the ability to manipulate the boundary between life and death. When an enemy you can see dies within 30 feet of you, you or one ally of your choice that is within 30 feet of you regains hit points equal to the enemy's number of Hit Dice. You can use this feature as long as you aren't incapacitated, but no more than once per round.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 2"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Protection Domain (UA): Indomitable Defense"
          ],
          "text": [
            "At 17th level, you gain resistance to two damage types of your choice, choosing from bludgeoning, necrotic, piercing, radiant, and slashing. Whenever you finish a short or long rest, you can change the damage types you chose.",
            "As an action, you can temporarily give up this resistance and transfer it to one creature you touch. The creature keeps the resistance until the end of your next short or long rest or until you transfer it back to yourself as a bonus action.",
            "",
            "Source: Unearthed Arcana: Cleric Divine Domains p. 3"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Twilight Domain (UA)"
          ],
          "text": [
            "The Twilight Domain governs the transition and blending of light into darkness. It is a time of rest and comfort, but also the threshold between safety and the unknown. Deities of healing or respite (such as Boldrei, Hestia, Mishakal, or Pelor), bravery or protection (such as Dol Arrah, Hajama, Helm, or Ilmater), travel or transition (such as Fharlanghn, Hermes, the Raven Queen, or the Traveler), or the night and dreams (such as Celestian, Morpheus, Nut, or Selûne) might grant their clerics the Twilight Domain. Clerics who serve these deities tend to be brave, delving into the dark to hold its dangers at bay and to bring comfort to those lost far from the light.",
            "At each indicated cleric level, you add the listed spells to your spells prepared.",
            "",
            "Twilight Domain Spells",
            "Cleric Level | Spells",
            "1st | faerie fire, sleep",
            "3rd | darkness, invisibility",
            "5th | aura of vitality, Leomund's tiny hut",
            "7th | aura of life, greater invisibility",
            "9th | circle of power, dream",
            "",
            "Source: Unearthed Arcana: Cleric Druid Wizard p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Twilight Domain (UA): Bonus Proficiency"
          ],
          "text": [
            "1st-level Twilight Domain feature",
            "You gain proficiency with martial weapons and heavy armor.",
            "",
            "Source: Unearthed Arcana: Cleric Druid Wizard p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Twilight Domain (UA): Eyes of Night"
          ],
          "text": [
            "1st-level Twilight Domain feature",
            "Your eyes are blessed, allowing you to see through the deepest gloom. You have darkvision with no maximum range; you can see in dim light as if it were bright light and in darkness as if it were dim light.",
            "As an action, you can magically give the benefit of this feature to any number of creatures you can see within 10 feet of you. The shared benefit lasts for 10 minutes. You can extend this benefit a number of times equal to your Wisdom modifier (a minimum of once), and you regain all expended uses when you finish a long rest.",
            "",
            "Source: Unearthed Arcana: Cleric Druid Wizard p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Twilight Domain (UA): Vigilant Blessing"
          ],
          "text": [
            "1st-level Twilight Domain feature",
            "The night has taught you to be vigilant. As an action, you give one creature you touch (including possibly yourself) advantage on the next initiative roll the creature makes. This benefit ends immediately after the roll or if you use this feature again.",
            "",
            "Source: Unearthed Arcana: Cleric Druid Wizard p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Twilight Domain (UA): Channel Divinity: Twilight Sanctuary"
          ],
          "text": [
            "2nd-level Twilight Domain feature",
            "You can use your Channel Divinity to refresh your allies with soothing twilight.",
            "As an action, you present your holy symbol, and a sphere of twilight emanates from you. The sphere is centered on you, has a 30-foot radius, and is filled with dim light. The sphere moves with you, and it lasts for 1 minute or until you are incapacitated or die. Whenever a creature (including you) ends its turn in the sphere, you can grant that creature one of these benefits:",
            "• Give it 1d8 temporary hit points.",
            "• End one effect causing it to be charmed or frightened.",
            "",
            "Source: Unearthed Arcana: Cleric Druid Wizard p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Twilight Domain (UA): Steps of the Brave"
          ],
          "text": [
            "6th-level Twilight Domain feature",
            "You draw strength from your connection to twilight and find yourself at home within its dark embrace, gaining two benefits:",
            "• You have advantage on saving throws against being frightened.",
            "• If you are in dim light or darkness, you can use a bonus action to magically give yourself a flying speed equal to your walking speed until the end of your next turn.",
            "",
            "Source: Unearthed Arcana: Cleric Druid Wizard p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Twilight Domain (UA): Divine Strike"
          ],
          "text": [
            "8th-level Twilight Domain feature",
            "You gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 psychic damage. When you reach 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Unearthed Arcana: Cleric Druid Wizard p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Twilight Domain (UA): Midnight Shroud"
          ],
          "text": [
            "17th-level Twilight Domain feature",
            "You can harness the shrouding power of night to protect your allies and stymie your foes. Whenever you cast the darkness spell using a spell slot, you can choose a number of creatures that you can see (including yourself) equal to your Wisdom modifier (minimum of one). The chosen creatures can see through the darkness.",
            "",
            "Source: Unearthed Arcana: Cleric Druid Wizard p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: City Domain (UA)"
          ],
          "text": [
            "The City domain is concerned with the citizenry, commerce, traffic, and even architecture of modern civilization. In the eyes of a cleric of the city, the center of modern life is a sense and spirit of community, and the gravest enemies of the city are those who seek to harm the common weal of its citizens.",
            "At each indicated cleric level, add the listed spells to your spells prepared. They do not count towards your limit.",
            "Spells marked with an asterisk can be found in Unearthed Arcana: Modern Magic.",
            "",
            "City Domain Spells",
            "Cleric Level | Spells",
            "1st | comprehend languages, remote access (UA)*",
            "3rd | find vehicle (UA)*, heat metal",
            "5th | lightning bolt, protection from ballistics (UA)*",
            "7th | locate creature, synchronicity (UA)*",
            "9th | commune with city (UA)*, shutdown (UA)*",
            "",
            "Source: Unearthed Arcana: Modern Magic p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "City Domain (UA): Bonus Cantrip"
          ],
          "text": [
            "When you choose this domain at 1st level, you gain the On/Off (UA) cantrip in addition to your chosen cantrips.",
            "",
            "Source: Unearthed Arcana: Modern Magic p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "City Domain (UA): Bonus Proficiencies"
          ],
          "text": [
            "Also starting at 1st level, you gain proficiency with sidearms and proficiency with vehicles (land).",
            "",
            "Source: Unearthed Arcana: Modern Magic p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "City Domain (UA): Heart of the City"
          ],
          "text": [
            "From 1st level, you are able to tap into the spirit of community found in the city. While you are within any city, you can gain advantage on a single Charisma (Deception, Intimidation, or Persuasion) check, and you are considered proficient in the appropriate skill. You can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain any expended uses when you finish a long rest.",
            "",
            "Source: Unearthed Arcana: Modern Magic p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "City Domain (UA): Channel Divinity: Spirits of the City"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to call on the city for aid. As an action, you present your holy symbol, and any city utility within 30 feet of you either works perfectly or shuts down entirely for 1 minute (your choice).",
            "Additionally, each hostile creature within 30 feet of you must make a Charisma saving throw. On a failed save, the creature is knocked prone or restrained (your choice) by hazards such as entangling wires, high-pressure water erupting from fire hydrants, pavement collapsing to unseen potholes, and so on. A restrained creature can escape by making a successful Strength (Athletics) or Dexterity (Acrobatics) check against your spell save DC.",
            "This effect is entirely local and affects only utilities within 30 feet of you. Determination of what utilities are available within range and how the physical effects of those utilities manifest are left to the DM.",
            "",
            "Source: Unearthed Arcana: Modern Magic p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "City Domain (UA): Block Watch"
          ],
          "text": [
            "Starting at 6th level, your awareness while in the city extends preternaturally. While in an urban environment, you are considered proficient in the Insight and Perception skills, and you add double your proficiency bonus to Wisdom (Insight) and Wisdom (Perception) checks, instead of your normal proficiency bonus.",
            "",
            "Source: Unearthed Arcana: Modern Magic p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "City Domain (UA): Divine Strike"
          ],
          "text": [
            "At 8th level, you gain the ability to infuse your weapon strikes with psychic energy borrowed from the citizens of your city. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 psychic damage to the target. When you reach 14th level, the extra psychic damage increases to 2d8.",
            "",
            "Source: Unearthed Arcana: Modern Magic p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "City Domain (UA): Express Transit"
          ],
          "text": [
            "At 17th level, you can use mass transit routes to transport instantaneously to other points in the city. Starting from a bus stop, train station, subway stop, or other suitable mass transit site within the city, you can teleport to any other similar transit stop within the city, as if you had cast a teleport spell whose destination is a permanent teleportation circle you know. Once you use this feature, you must finish a short or long rest before using it again.",
            "",
            "Source: Unearthed Arcana: Modern Magic p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Divine Domain: Order Domain (UA)"
          ],
          "text": [
            "The Order domain represents discipline, as well as service to a society or an institution, whether that service is rendered in obedience to or enforcement of the law—civil, religious, or both. Gods on many worlds grant access to this domain, including Bane, Tyr, Majere, Erathis, Pholtus, Wee Jas, Aureon, Maglubiyet, Nuada, Athena, Anubis, Forseti, and Asmodeus.",
            "The ideal of order is obedience to the law above all else, rather than to a specific individual or the passing influence of emotion or popular rule. Clerics of order are typically concerned with how things are done, rather than whether an action's results are just. Following the law and obeying its edicts is critical, especially when it benefits these clerics and their deities.",
            "More importantly, law establishes hierarchies. Those selected by the law to lead must be obeyed. Those who obey must do so to the best of their ability. In this manner, law creates an intricate web of obligations that allows society to forge order and security in a chaotic multiverse.",
            "At each indicated cleric level, you add the listed spells to your spells prepared.",
            "",
            "Order Domain Spells",
            "Cleric Level | Spells",
            "1st | command, heroism",
            "3rd | enhance ability, hold person",
            "5th | mass healing word, slow",
            "7th | compulsion, locate creature",
            "9th | commune, dominate person",
            "",
            "Source: Unearthed Arcana: Order Domain p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain (UA): Bonus Proficiency"
          ],
          "text": [
            "When you choose this domain at 1st level, you gain proficiency with heavy armor.",
            "",
            "Source: Unearthed Arcana: Order Domain p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "1"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain (UA): Voice of Authority"
          ],
          "text": [
            "Starting at 1st level, you can invoke the power of law to drive an ally to attack. Immediately after you cast a spell on an ally using a spell slot of 1st level or higher, that ally can use their reaction to make one weapon attack against a target of your choice that you can see. If the spell targets more than one ally, you choose the ally who can make the attack.",
            "",
            "Source: Unearthed Arcana: Order Domain p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "2"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain (UA): Channel Divinity: Order's Demand"
          ],
          "text": [
            "Starting at 2nd level, you can use your Channel Divinity to exert an intimidating presence over others.",
            "As an action, you present your holy symbol, and each creature of your choice that can see or hear you within 30 feet of you must succeed on a Wisdom saving throw or be charmed by you until the end of your next turn or until the charmed creature takes any damage. You can also cause any of the charmed creatures to fall prone when they fail the saving throw.",
            "",
            "Source: Unearthed Arcana: Order Domain p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "6"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain (UA): Order's Dominion"
          ],
          "text": [
            "At 6th level, you become extraordinarily adept at channeling magical energy to compel others.",
            "When you cast a spell of the enchantment school using a spell slot of 2nd level or higher, you regain one expended spell slot. The slot you regain must be of a level lower than the spell you cast and can't be higher than 5th level.",
            "",
            "Source: Unearthed Arcana: Order Domain p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "8"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain (UA): Divine Strike"
          ],
          "text": [
            "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 force damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
            "",
            "Source: Unearthed Arcana: Order Domain p. 1"
          ]
        }
      ]
    },
    {
      "$": {
        "level": "17"
      },
      "feature": [
        {
          "$": {
            "optional": "YES"
          },
          "name": [
            "Order Domain (UA): Order's Wrath"
          ],
          "text": [
            "Starting at 17th level, enemies you designate for destruction wilt under the combined efforts of you and your allies. If you deal your Divine Strike damage to a creature, that creature takes an extra 2d8 force damage the first time each turn that any ally of yours hits it with a weapon attack. This benefit lasts until the start of your next turn.",
            "",
            "Source: Unearthed Arcana: Order Domain p. 1"
          ]
        }
      ]
    }
  ]
}